Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/uart/uart_echo_interrupt/firmware/src/packs/ATSAMA5D29_DFP/component/isc.h
/*
 * Component description for ISC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-04T10:37:14Z */
#ifndef _SAMA5D_ISC_COMPONENT_H_
#define _SAMA5D_ISC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR ISC                                          */
/* ************************************************************************** */

/* -------- ISC_DAD : (ISC Offset: 0x00) (R/W 32) DMA Address 0 Register -------- */
#define ISC_DAD_AD0_Pos                       _UINT32_(0)                                          /* (ISC_DAD) Channel 0 Address Position */
#define ISC_DAD_AD0_Msk                       (_UINT32_(0xFFFFFFFF) << ISC_DAD_AD0_Pos)            /* (ISC_DAD) Channel 0 Address Mask */
#define ISC_DAD_AD0(value)                    (ISC_DAD_AD0_Msk & (_UINT32_(value) << ISC_DAD_AD0_Pos)) /* Assigment of value for AD0 in the ISC_DAD register */
#define ISC_DAD_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ISC_DAD) Register Mask  */


/* -------- ISC_DST : (ISC Offset: 0x04) (R/W 32) DMA Stride 0 Register -------- */
#define ISC_DST_ST0_Pos                       _UINT32_(0)                                          /* (ISC_DST) Channel 0 Stride Position */
#define ISC_DST_ST0_Msk                       (_UINT32_(0xFFFFFFFF) << ISC_DST_ST0_Pos)            /* (ISC_DST) Channel 0 Stride Mask */
#define ISC_DST_ST0(value)                    (ISC_DST_ST0_Msk & (_UINT32_(value) << ISC_DST_ST0_Pos)) /* Assigment of value for ST0 in the ISC_DST register */
#define ISC_DST_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ISC_DST) Register Mask  */


/* -------- ISC_CBC_BRIGHT : (ISC Offset: 0x3BC) (R/W 32) Contrast and Brightness, Brightness Register -------- */
#define ISC_CBC_BRIGHT_BRIGHT_Pos             _UINT32_(0)                                          /* (ISC_CBC_BRIGHT) Brightness Control (signed 11 bits 1:10:0) Position */
#define ISC_CBC_BRIGHT_BRIGHT_Msk             (_UINT32_(0x7FF) << ISC_CBC_BRIGHT_BRIGHT_Pos)       /* (ISC_CBC_BRIGHT) Brightness Control (signed 11 bits 1:10:0) Mask */
#define ISC_CBC_BRIGHT_BRIGHT(value)          (ISC_CBC_BRIGHT_BRIGHT_Msk & (_UINT32_(value) << ISC_CBC_BRIGHT_BRIGHT_Pos)) /* Assigment of value for BRIGHT in the ISC_CBC_BRIGHT register */
#define ISC_CBC_BRIGHT_Msk                    _UINT32_(0x000007FF)                                 /* (ISC_CBC_BRIGHT) Register Mask  */


/* -------- ISC_CBC_CFG : (ISC Offset: 0x3B8) (R/W 32) Contrast and Brightness Configuration Register -------- */
#define ISC_CBC_CFG_CCIR_Pos                  _UINT32_(0)                                          /* (ISC_CBC_CFG) CCIR656 Stream Enable Position */
#define ISC_CBC_CFG_CCIR_Msk                  (_UINT32_(0x1) << ISC_CBC_CFG_CCIR_Pos)              /* (ISC_CBC_CFG) CCIR656 Stream Enable Mask */
#define ISC_CBC_CFG_CCIR(value)               (ISC_CBC_CFG_CCIR_Msk & (_UINT32_(value) << ISC_CBC_CFG_CCIR_Pos)) /* Assigment of value for CCIR in the ISC_CBC_CFG register */
#define ISC_CBC_CFG_CCIRMODE_Pos              _UINT32_(1)                                          /* (ISC_CBC_CFG) CCIR656 Byte Ordering Position */
#define ISC_CBC_CFG_CCIRMODE_Msk              (_UINT32_(0x3) << ISC_CBC_CFG_CCIRMODE_Pos)          /* (ISC_CBC_CFG) CCIR656 Byte Ordering Mask */
#define ISC_CBC_CFG_CCIRMODE(value)           (ISC_CBC_CFG_CCIRMODE_Msk & (_UINT32_(value) << ISC_CBC_CFG_CCIRMODE_Pos)) /* Assigment of value for CCIRMODE in the ISC_CBC_CFG register */
#define   ISC_CBC_CFG_CCIRMODE_CBY_Val        _UINT32_(0x0)                                        /* (ISC_CBC_CFG) Byte ordering Cb0, Y0, Cr0, Y1  */
#define   ISC_CBC_CFG_CCIRMODE_CRY_Val        _UINT32_(0x1)                                        /* (ISC_CBC_CFG) Byte ordering Cr0, Y0, Cb0, Y1  */
#define   ISC_CBC_CFG_CCIRMODE_YCB_Val        _UINT32_(0x2)                                        /* (ISC_CBC_CFG) Byte ordering Y0, Cb0, Y1, Cr0  */
#define   ISC_CBC_CFG_CCIRMODE_YCR_Val        _UINT32_(0x3)                                        /* (ISC_CBC_CFG) Byte ordering Y0, Cr0, Y1, Cb0  */
#define ISC_CBC_CFG_CCIRMODE_CBY              (ISC_CBC_CFG_CCIRMODE_CBY_Val << ISC_CBC_CFG_CCIRMODE_Pos) /* (ISC_CBC_CFG) Byte ordering Cb0, Y0, Cr0, Y1 Position  */
#define ISC_CBC_CFG_CCIRMODE_CRY              (ISC_CBC_CFG_CCIRMODE_CRY_Val << ISC_CBC_CFG_CCIRMODE_Pos) /* (ISC_CBC_CFG) Byte ordering Cr0, Y0, Cb0, Y1 Position  */
#define ISC_CBC_CFG_CCIRMODE_YCB              (ISC_CBC_CFG_CCIRMODE_YCB_Val << ISC_CBC_CFG_CCIRMODE_Pos) /* (ISC_CBC_CFG) Byte ordering Y0, Cb0, Y1, Cr0 Position  */
#define ISC_CBC_CFG_CCIRMODE_YCR              (ISC_CBC_CFG_CCIRMODE_YCR_Val << ISC_CBC_CFG_CCIRMODE_Pos) /* (ISC_CBC_CFG) Byte ordering Y0, Cr0, Y1, Cb0 Position  */
#define ISC_CBC_CFG_Msk                       _UINT32_(0x00000007)                                 /* (ISC_CBC_CFG) Register Mask  */


