Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/uart/uart_echo_interrupt/firmware/src/packs/ATSAMA5D29_DFP/component/isc.h
/* -------- ISC_CBC_CONTRAST : (ISC Offset: 0x3C0) (R/W 32) Contrast and Brightness, Contrast Register -------- */
#define ISC_CBC_CONTRAST_CONTRAST_Pos         _UINT32_(0)                                          /* (ISC_CBC_CONTRAST) Contrast (unsigned 12 bits 0:4:8) Position */
#define ISC_CBC_CONTRAST_CONTRAST_Msk         (_UINT32_(0xFFF) << ISC_CBC_CONTRAST_CONTRAST_Pos)   /* (ISC_CBC_CONTRAST) Contrast (unsigned 12 bits 0:4:8) Mask */
#define ISC_CBC_CONTRAST_CONTRAST(value)      (ISC_CBC_CONTRAST_CONTRAST_Msk & (_UINT32_(value) << ISC_CBC_CONTRAST_CONTRAST_Pos)) /* Assigment of value for CONTRAST in the ISC_CBC_CONTRAST register */
#define ISC_CBC_CONTRAST_Msk                  _UINT32_(0x00000FFF)                                 /* (ISC_CBC_CONTRAST) Register Mask  */


/* -------- ISC_CBC_CTRL : (ISC Offset: 0x3B4) (R/W 32) Contrast and Brightness Control Register -------- */
#define ISC_CBC_CTRL_ENABLE_Pos               _UINT32_(0)                                          /* (ISC_CBC_CTRL) Contrast and Brightness Control Enable Position */
#define ISC_CBC_CTRL_ENABLE_Msk               (_UINT32_(0x1) << ISC_CBC_CTRL_ENABLE_Pos)           /* (ISC_CBC_CTRL) Contrast and Brightness Control Enable Mask */
#define ISC_CBC_CTRL_ENABLE(value)            (ISC_CBC_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_CBC_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_CBC_CTRL register */
#define ISC_CBC_CTRL_Msk                      _UINT32_(0x00000001)                                 /* (ISC_CBC_CTRL) Register Mask  */


/* -------- ISC_CC_BB_OB : (ISC Offset: 0x90) (R/W 32) Color Correction BB OB Register -------- */
#define ISC_CC_BB_OB_BBGAIN_Pos               _UINT32_(0)                                          /* (ISC_CC_BB_OB) Blue Gain for Blue Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_BB_OB_BBGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_BB_OB_BBGAIN_Pos)         /* (ISC_CC_BB_OB) Blue Gain for Blue Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_BB_OB_BBGAIN(value)            (ISC_CC_BB_OB_BBGAIN_Msk & (_UINT32_(value) << ISC_CC_BB_OB_BBGAIN_Pos)) /* Assigment of value for BBGAIN in the ISC_CC_BB_OB register */
#define ISC_CC_BB_OB_BOFST_Pos                _UINT32_(16)                                         /* (ISC_CC_BB_OB) Blue Component Offset (signed 13 bits, 1:12:0) Position */
#define ISC_CC_BB_OB_BOFST_Msk                (_UINT32_(0x1FFF) << ISC_CC_BB_OB_BOFST_Pos)         /* (ISC_CC_BB_OB) Blue Component Offset (signed 13 bits, 1:12:0) Mask */
#define ISC_CC_BB_OB_BOFST(value)             (ISC_CC_BB_OB_BOFST_Msk & (_UINT32_(value) << ISC_CC_BB_OB_BOFST_Pos)) /* Assigment of value for BOFST in the ISC_CC_BB_OB register */
#define ISC_CC_BB_OB_Msk                      _UINT32_(0x1FFF0FFF)                                 /* (ISC_CC_BB_OB) Register Mask  */


/* -------- ISC_CC_BR_BG : (ISC Offset: 0x8C) (R/W 32) Color Correction BR BG Register -------- */
#define ISC_CC_BR_BG_BRGAIN_Pos               _UINT32_(0)                                          /* (ISC_CC_BR_BG) Red Gain for Blue Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_BR_BG_BRGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_BR_BG_BRGAIN_Pos)         /* (ISC_CC_BR_BG) Red Gain for Blue Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_BR_BG_BRGAIN(value)            (ISC_CC_BR_BG_BRGAIN_Msk & (_UINT32_(value) << ISC_CC_BR_BG_BRGAIN_Pos)) /* Assigment of value for BRGAIN in the ISC_CC_BR_BG register */
#define ISC_CC_BR_BG_BGGAIN_Pos               _UINT32_(16)                                         /* (ISC_CC_BR_BG) Green Gain for Blue Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_BR_BG_BGGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_BR_BG_BGGAIN_Pos)         /* (ISC_CC_BR_BG) Green Gain for Blue Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_BR_BG_BGGAIN(value)            (ISC_CC_BR_BG_BGGAIN_Msk & (_UINT32_(value) << ISC_CC_BR_BG_BGGAIN_Pos)) /* Assigment of value for BGGAIN in the ISC_CC_BR_BG register */
#define ISC_CC_BR_BG_Msk                      _UINT32_(0x0FFF0FFF)                                 /* (ISC_CC_BR_BG) Register Mask  */


/* -------- ISC_CC_CTRL : (ISC Offset: 0x78) (R/W 32) Color Correction Control Register -------- */
#define ISC_CC_CTRL_ENABLE_Pos                _UINT32_(0)                                          /* (ISC_CC_CTRL) Color Correction Enable Position */
#define ISC_CC_CTRL_ENABLE_Msk                (_UINT32_(0x1) << ISC_CC_CTRL_ENABLE_Pos)            /* (ISC_CC_CTRL) Color Correction Enable Mask */
#define ISC_CC_CTRL_ENABLE(value)             (ISC_CC_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_CC_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_CC_CTRL register */
#define ISC_CC_CTRL_Msk                       _UINT32_(0x00000001)                                 /* (ISC_CC_CTRL) Register Mask  */


/* -------- ISC_CC_GB_OG : (ISC Offset: 0x88) (R/W 32) Color Correction GB OG Register -------- */
#define ISC_CC_GB_OG_GBGAIN_Pos               _UINT32_(0)                                          /* (ISC_CC_GB_OG) Blue Gain for Green Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_GB_OG_GBGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_GB_OG_GBGAIN_Pos)         /* (ISC_CC_GB_OG) Blue Gain for Green Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_GB_OG_GBGAIN(value)            (ISC_CC_GB_OG_GBGAIN_Msk & (_UINT32_(value) << ISC_CC_GB_OG_GBGAIN_Pos)) /* Assigment of value for GBGAIN in the ISC_CC_GB_OG register */
#define ISC_CC_GB_OG_ROFST_Pos                _UINT32_(16)                                         /* (ISC_CC_GB_OG) Green Component Offset (signed 13 bits, 1:12:0) Position */
#define ISC_CC_GB_OG_ROFST_Msk                (_UINT32_(0x1FFF) << ISC_CC_GB_OG_ROFST_Pos)         /* (ISC_CC_GB_OG) Green Component Offset (signed 13 bits, 1:12:0) Mask */
#define ISC_CC_GB_OG_ROFST(value)             (ISC_CC_GB_OG_ROFST_Msk & (_UINT32_(value) << ISC_CC_GB_OG_ROFST_Pos)) /* Assigment of value for ROFST in the ISC_CC_GB_OG register */
#define ISC_CC_GB_OG_Msk                      _UINT32_(0x1FFF0FFF)                                 /* (ISC_CC_GB_OG) Register Mask  */


/* -------- ISC_CC_GR_GG : (ISC Offset: 0x84) (R/W 32) Color Correction GR GG Register -------- */
#define ISC_CC_GR_GG_GRGAIN_Pos               _UINT32_(0)                                          /* (ISC_CC_GR_GG) Red Gain for Green Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_GR_GG_GRGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_GR_GG_GRGAIN_Pos)         /* (ISC_CC_GR_GG) Red Gain for Green Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_GR_GG_GRGAIN(value)            (ISC_CC_GR_GG_GRGAIN_Msk & (_UINT32_(value) << ISC_CC_GR_GG_GRGAIN_Pos)) /* Assigment of value for GRGAIN in the ISC_CC_GR_GG register */
#define ISC_CC_GR_GG_GGGAIN_Pos               _UINT32_(16)                                         /* (ISC_CC_GR_GG) Green Gain for Green Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_GR_GG_GGGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_GR_GG_GGGAIN_Pos)         /* (ISC_CC_GR_GG) Green Gain for Green Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_GR_GG_GGGAIN(value)            (ISC_CC_GR_GG_GGGAIN_Msk & (_UINT32_(value) << ISC_CC_GR_GG_GGGAIN_Pos)) /* Assigment of value for GGGAIN in the ISC_CC_GR_GG register */
#define ISC_CC_GR_GG_Msk                      _UINT32_(0x0FFF0FFF)                                 /* (ISC_CC_GR_GG) Register Mask  */


/* -------- ISC_CC_RB_OR : (ISC Offset: 0x80) (R/W 32) Color Correction RB OR Register -------- */
#define ISC_CC_RB_OR_RBGAIN_Pos               _UINT32_(0)                                          /* (ISC_CC_RB_OR) Blue Gain for Red Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_RB_OR_RBGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_RB_OR_RBGAIN_Pos)         /* (ISC_CC_RB_OR) Blue Gain for Red Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_RB_OR_RBGAIN(value)            (ISC_CC_RB_OR_RBGAIN_Msk & (_UINT32_(value) << ISC_CC_RB_OR_RBGAIN_Pos)) /* Assigment of value for RBGAIN in the ISC_CC_RB_OR register */
#define ISC_CC_RB_OR_ROFST_Pos                _UINT32_(16)                                         /* (ISC_CC_RB_OR) Red Component Offset (signed 13 bits, 1:12:0) Position */
#define ISC_CC_RB_OR_ROFST_Msk                (_UINT32_(0x1FFF) << ISC_CC_RB_OR_ROFST_Pos)         /* (ISC_CC_RB_OR) Red Component Offset (signed 13 bits, 1:12:0) Mask */
#define ISC_CC_RB_OR_ROFST(value)             (ISC_CC_RB_OR_ROFST_Msk & (_UINT32_(value) << ISC_CC_RB_OR_ROFST_Pos)) /* Assigment of value for ROFST in the ISC_CC_RB_OR register */
#define ISC_CC_RB_OR_Msk                      _UINT32_(0x1FFF0FFF)                                 /* (ISC_CC_RB_OR) Register Mask  */


