Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/uart/uart_echo_interrupt/firmware/src/packs/ATSAMA5D29_DFP/component/isc.h
/* -------- ISC_CC_RR_RG : (ISC Offset: 0x7C) (R/W 32) Color Correction RR RG Register -------- */
#define ISC_CC_RR_RG_RRGAIN_Pos               _UINT32_(0)                                          /* (ISC_CC_RR_RG) Red Gain for Red Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_RR_RG_RRGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_RR_RG_RRGAIN_Pos)         /* (ISC_CC_RR_RG) Red Gain for Red Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_RR_RG_RRGAIN(value)            (ISC_CC_RR_RG_RRGAIN_Msk & (_UINT32_(value) << ISC_CC_RR_RG_RRGAIN_Pos)) /* Assigment of value for RRGAIN in the ISC_CC_RR_RG register */
#define ISC_CC_RR_RG_RGGAIN_Pos               _UINT32_(16)                                         /* (ISC_CC_RR_RG) Green Gain for Red Component (signed 12 bits, 1:3:8) Position */
#define ISC_CC_RR_RG_RGGAIN_Msk               (_UINT32_(0xFFF) << ISC_CC_RR_RG_RGGAIN_Pos)         /* (ISC_CC_RR_RG) Green Gain for Red Component (signed 12 bits, 1:3:8) Mask */
#define ISC_CC_RR_RG_RGGAIN(value)            (ISC_CC_RR_RG_RGGAIN_Msk & (_UINT32_(value) << ISC_CC_RR_RG_RGGAIN_Pos)) /* Assigment of value for RGGAIN in the ISC_CC_RR_RG register */
#define ISC_CC_RR_RG_Msk                      _UINT32_(0x0FFF0FFF)                                 /* (ISC_CC_RR_RG) Register Mask  */


/* -------- ISC_CFA_CFG : (ISC Offset: 0x74) (R/W 32) Color Filter Array Configuration Register -------- */
#define ISC_CFA_CFG_BAYCFG_Pos                _UINT32_(0)                                          /* (ISC_CFA_CFG) Color Filter Array Pattern Position */
#define ISC_CFA_CFG_BAYCFG_Msk                (_UINT32_(0x3) << ISC_CFA_CFG_BAYCFG_Pos)            /* (ISC_CFA_CFG) Color Filter Array Pattern Mask */
#define ISC_CFA_CFG_BAYCFG(value)             (ISC_CFA_CFG_BAYCFG_Msk & (_UINT32_(value) << ISC_CFA_CFG_BAYCFG_Pos)) /* Assigment of value for BAYCFG in the ISC_CFA_CFG register */
#define   ISC_CFA_CFG_BAYCFG_GRGR_Val         _UINT32_(0x0)                                        /* (ISC_CFA_CFG) Starting row configuration is G R G R (red row)  */
#define   ISC_CFA_CFG_BAYCFG_RGRG_Val         _UINT32_(0x1)                                        /* (ISC_CFA_CFG) Starting row configuration is R G R G (red row  */
#define   ISC_CFA_CFG_BAYCFG_GBGB_Val         _UINT32_(0x2)                                        /* (ISC_CFA_CFG) Starting row configuration is G B G B (blue row)  */
#define   ISC_CFA_CFG_BAYCFG_BGBG_Val         _UINT32_(0x3)                                        /* (ISC_CFA_CFG) Starting row configuration is B G B G (blue row)  */
#define ISC_CFA_CFG_BAYCFG_GRGR               (ISC_CFA_CFG_BAYCFG_GRGR_Val << ISC_CFA_CFG_BAYCFG_Pos) /* (ISC_CFA_CFG) Starting row configuration is G R G R (red row) Position  */
#define ISC_CFA_CFG_BAYCFG_RGRG               (ISC_CFA_CFG_BAYCFG_RGRG_Val << ISC_CFA_CFG_BAYCFG_Pos) /* (ISC_CFA_CFG) Starting row configuration is R G R G (red row Position  */
#define ISC_CFA_CFG_BAYCFG_GBGB               (ISC_CFA_CFG_BAYCFG_GBGB_Val << ISC_CFA_CFG_BAYCFG_Pos) /* (ISC_CFA_CFG) Starting row configuration is G B G B (blue row) Position  */
#define ISC_CFA_CFG_BAYCFG_BGBG               (ISC_CFA_CFG_BAYCFG_BGBG_Val << ISC_CFA_CFG_BAYCFG_Pos) /* (ISC_CFA_CFG) Starting row configuration is B G B G (blue row) Position  */
#define ISC_CFA_CFG_EITPOL_Pos                _UINT32_(4)                                          /* (ISC_CFA_CFG) Edge Interpolation Position */
#define ISC_CFA_CFG_EITPOL_Msk                (_UINT32_(0x1) << ISC_CFA_CFG_EITPOL_Pos)            /* (ISC_CFA_CFG) Edge Interpolation Mask */
#define ISC_CFA_CFG_EITPOL(value)             (ISC_CFA_CFG_EITPOL_Msk & (_UINT32_(value) << ISC_CFA_CFG_EITPOL_Pos)) /* Assigment of value for EITPOL in the ISC_CFA_CFG register */
#define ISC_CFA_CFG_Msk                       _UINT32_(0x00000013)                                 /* (ISC_CFA_CFG) Register Mask  */


/* -------- ISC_CFA_CTRL : (ISC Offset: 0x70) (R/W 32) Color Filter Array Control Register -------- */
#define ISC_CFA_CTRL_ENABLE_Pos               _UINT32_(0)                                          /* (ISC_CFA_CTRL) Color Filter Array Interpolation Enable Position */
#define ISC_CFA_CTRL_ENABLE_Msk               (_UINT32_(0x1) << ISC_CFA_CTRL_ENABLE_Pos)           /* (ISC_CFA_CTRL) Color Filter Array Interpolation Enable Mask */
#define ISC_CFA_CTRL_ENABLE(value)            (ISC_CFA_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_CFA_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_CFA_CTRL register */
#define ISC_CFA_CTRL_Msk                      _UINT32_(0x00000001)                                 /* (ISC_CFA_CTRL) Register Mask  */


/* -------- ISC_CLKCFG : (ISC Offset: 0x24) (R/W 32) Clock Configuration Register -------- */
#define ISC_CLKCFG_ICDIV_Pos                  _UINT32_(0)                                          /* (ISC_CLKCFG) ISP Clock Divider Position */
#define ISC_CLKCFG_ICDIV_Msk                  (_UINT32_(0xFF) << ISC_CLKCFG_ICDIV_Pos)             /* (ISC_CLKCFG) ISP Clock Divider Mask */
#define ISC_CLKCFG_ICDIV(value)               (ISC_CLKCFG_ICDIV_Msk & (_UINT32_(value) << ISC_CLKCFG_ICDIV_Pos)) /* Assigment of value for ICDIV in the ISC_CLKCFG register */
#define ISC_CLKCFG_ICSEL_Pos                  _UINT32_(8)                                          /* (ISC_CLKCFG) ISP Clock Selection Position */
#define ISC_CLKCFG_ICSEL_Msk                  (_UINT32_(0x1) << ISC_CLKCFG_ICSEL_Pos)              /* (ISC_CLKCFG) ISP Clock Selection Mask */
#define ISC_CLKCFG_ICSEL(value)               (ISC_CLKCFG_ICSEL_Msk & (_UINT32_(value) << ISC_CLKCFG_ICSEL_Pos)) /* Assigment of value for ICSEL in the ISC_CLKCFG register */
#define ISC_CLKCFG_MCDIV_Pos                  _UINT32_(16)                                         /* (ISC_CLKCFG) Master Clock Divider Position */
#define ISC_CLKCFG_MCDIV_Msk                  (_UINT32_(0xFF) << ISC_CLKCFG_MCDIV_Pos)             /* (ISC_CLKCFG) Master Clock Divider Mask */
#define ISC_CLKCFG_MCDIV(value)               (ISC_CLKCFG_MCDIV_Msk & (_UINT32_(value) << ISC_CLKCFG_MCDIV_Pos)) /* Assigment of value for MCDIV in the ISC_CLKCFG register */
#define ISC_CLKCFG_MCSEL_Pos                  _UINT32_(24)                                         /* (ISC_CLKCFG) Master Clock Reference Clock Selection Position */
#define ISC_CLKCFG_MCSEL_Msk                  (_UINT32_(0x3) << ISC_CLKCFG_MCSEL_Pos)              /* (ISC_CLKCFG) Master Clock Reference Clock Selection Mask */
#define ISC_CLKCFG_MCSEL(value)               (ISC_CLKCFG_MCSEL_Msk & (_UINT32_(value) << ISC_CLKCFG_MCSEL_Pos)) /* Assigment of value for MCSEL in the ISC_CLKCFG register */
#define ISC_CLKCFG_Msk                        _UINT32_(0x03FF01FF)                                 /* (ISC_CLKCFG) Register Mask  */


