Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/uart/uart_echo_interrupt/firmware/src/packs/ATSAMA5D29_DFP/component/isc.h
/* -------- ISC_CLKDIS : (ISC Offset: 0x1C) ( /W 32) Clock Disable Register -------- */
#define ISC_CLKDIS_ICDIS_Pos                  _UINT32_(0)                                          /* (ISC_CLKDIS) ISP Clock Disable Position */
#define ISC_CLKDIS_ICDIS_Msk                  (_UINT32_(0x1) << ISC_CLKDIS_ICDIS_Pos)              /* (ISC_CLKDIS) ISP Clock Disable Mask */
#define ISC_CLKDIS_ICDIS(value)               (ISC_CLKDIS_ICDIS_Msk & (_UINT32_(value) << ISC_CLKDIS_ICDIS_Pos)) /* Assigment of value for ICDIS in the ISC_CLKDIS register */
#define ISC_CLKDIS_MCDIS_Pos                  _UINT32_(1)                                          /* (ISC_CLKDIS) Master Clock Disable Position */
#define ISC_CLKDIS_MCDIS_Msk                  (_UINT32_(0x1) << ISC_CLKDIS_MCDIS_Pos)              /* (ISC_CLKDIS) Master Clock Disable Mask */
#define ISC_CLKDIS_MCDIS(value)               (ISC_CLKDIS_MCDIS_Msk & (_UINT32_(value) << ISC_CLKDIS_MCDIS_Pos)) /* Assigment of value for MCDIS in the ISC_CLKDIS register */
#define ISC_CLKDIS_ICSWRST_Pos                _UINT32_(8)                                          /* (ISC_CLKDIS) ISP Clock Software Reset Position */
#define ISC_CLKDIS_ICSWRST_Msk                (_UINT32_(0x1) << ISC_CLKDIS_ICSWRST_Pos)            /* (ISC_CLKDIS) ISP Clock Software Reset Mask */
#define ISC_CLKDIS_ICSWRST(value)             (ISC_CLKDIS_ICSWRST_Msk & (_UINT32_(value) << ISC_CLKDIS_ICSWRST_Pos)) /* Assigment of value for ICSWRST in the ISC_CLKDIS register */
#define ISC_CLKDIS_MCSWRST_Pos                _UINT32_(9)                                          /* (ISC_CLKDIS) Master Clock Software Reset Position */
#define ISC_CLKDIS_MCSWRST_Msk                (_UINT32_(0x1) << ISC_CLKDIS_MCSWRST_Pos)            /* (ISC_CLKDIS) Master Clock Software Reset Mask */
#define ISC_CLKDIS_MCSWRST(value)             (ISC_CLKDIS_MCSWRST_Msk & (_UINT32_(value) << ISC_CLKDIS_MCSWRST_Pos)) /* Assigment of value for MCSWRST in the ISC_CLKDIS register */
#define ISC_CLKDIS_Msk                        _UINT32_(0x00000303)                                 /* (ISC_CLKDIS) Register Mask  */


/* -------- ISC_CLKEN : (ISC Offset: 0x18) ( /W 32) Clock Enable Register -------- */
#define ISC_CLKEN_ICEN_Pos                    _UINT32_(0)                                          /* (ISC_CLKEN) ISP Clock Enable Position */
#define ISC_CLKEN_ICEN_Msk                    (_UINT32_(0x1) << ISC_CLKEN_ICEN_Pos)                /* (ISC_CLKEN) ISP Clock Enable Mask */
#define ISC_CLKEN_ICEN(value)                 (ISC_CLKEN_ICEN_Msk & (_UINT32_(value) << ISC_CLKEN_ICEN_Pos)) /* Assigment of value for ICEN in the ISC_CLKEN register */
#define ISC_CLKEN_MCEN_Pos                    _UINT32_(1)                                          /* (ISC_CLKEN) Master Clock Enable Position */
#define ISC_CLKEN_MCEN_Msk                    (_UINT32_(0x1) << ISC_CLKEN_MCEN_Pos)                /* (ISC_CLKEN) Master Clock Enable Mask */
#define ISC_CLKEN_MCEN(value)                 (ISC_CLKEN_MCEN_Msk & (_UINT32_(value) << ISC_CLKEN_MCEN_Pos)) /* Assigment of value for MCEN in the ISC_CLKEN register */
#define ISC_CLKEN_Msk                         _UINT32_(0x00000003)                                 /* (ISC_CLKEN) Register Mask  */


/* -------- ISC_CLKSR : (ISC Offset: 0x20) ( R/ 32) Clock Status Register -------- */
#define ISC_CLKSR_ICSR_Pos                    _UINT32_(0)                                          /* (ISC_CLKSR) ISP Clock Status Register Position */
#define ISC_CLKSR_ICSR_Msk                    (_UINT32_(0x1) << ISC_CLKSR_ICSR_Pos)                /* (ISC_CLKSR) ISP Clock Status Register Mask */
#define ISC_CLKSR_ICSR(value)                 (ISC_CLKSR_ICSR_Msk & (_UINT32_(value) << ISC_CLKSR_ICSR_Pos)) /* Assigment of value for ICSR in the ISC_CLKSR register */
#define ISC_CLKSR_MCSR_Pos                    _UINT32_(1)                                          /* (ISC_CLKSR) Master Clock Status Register Position */
#define ISC_CLKSR_MCSR_Msk                    (_UINT32_(0x1) << ISC_CLKSR_MCSR_Pos)                /* (ISC_CLKSR) Master Clock Status Register Mask */
#define ISC_CLKSR_MCSR(value)                 (ISC_CLKSR_MCSR_Msk & (_UINT32_(value) << ISC_CLKSR_MCSR_Pos)) /* Assigment of value for MCSR in the ISC_CLKSR register */
#define ISC_CLKSR_SIP_Pos                     _UINT32_(31)                                         /* (ISC_CLKSR) Synchronization In Progress Position */
#define ISC_CLKSR_SIP_Msk                     (_UINT32_(0x1) << ISC_CLKSR_SIP_Pos)                 /* (ISC_CLKSR) Synchronization In Progress Mask */
#define ISC_CLKSR_SIP(value)                  (ISC_CLKSR_SIP_Msk & (_UINT32_(value) << ISC_CLKSR_SIP_Pos)) /* Assigment of value for SIP in the ISC_CLKSR register */
#define ISC_CLKSR_Msk                         _UINT32_(0x80000003)                                 /* (ISC_CLKSR) Register Mask  */


/* -------- ISC_CSC_CBB_OCB : (ISC Offset: 0x3A8) (R/W 32) Color Space Conversion CBB OCB Register -------- */
#define ISC_CSC_CBB_OCB_CBBGAIN_Pos           _UINT32_(0)                                          /* (ISC_CSC_CBB_OCB) Blue Gain for Blue Chrominance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_CBB_OCB_CBBGAIN_Msk           (_UINT32_(0xFFF) << ISC_CSC_CBB_OCB_CBBGAIN_Pos)     /* (ISC_CSC_CBB_OCB) Blue Gain for Blue Chrominance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_CBB_OCB_CBBGAIN(value)        (ISC_CSC_CBB_OCB_CBBGAIN_Msk & (_UINT32_(value) << ISC_CSC_CBB_OCB_CBBGAIN_Pos)) /* Assigment of value for CBBGAIN in the ISC_CSC_CBB_OCB register */
#define ISC_CSC_CBB_OCB_CBOFST_Pos            _UINT32_(16)                                         /* (ISC_CSC_CBB_OCB) Blue Chrominance Offset (signed 11 bits 1:10:0) Position */
#define ISC_CSC_CBB_OCB_CBOFST_Msk            (_UINT32_(0x7FF) << ISC_CSC_CBB_OCB_CBOFST_Pos)      /* (ISC_CSC_CBB_OCB) Blue Chrominance Offset (signed 11 bits 1:10:0) Mask */
#define ISC_CSC_CBB_OCB_CBOFST(value)         (ISC_CSC_CBB_OCB_CBOFST_Msk & (_UINT32_(value) << ISC_CSC_CBB_OCB_CBOFST_Pos)) /* Assigment of value for CBOFST in the ISC_CSC_CBB_OCB register */
#define ISC_CSC_CBB_OCB_Msk                   _UINT32_(0x07FF0FFF)                                 /* (ISC_CSC_CBB_OCB) Register Mask  */


/* -------- ISC_CSC_CBR_CBG : (ISC Offset: 0x3A4) (R/W 32) Color Space Conversion CBR CBG Register -------- */
#define ISC_CSC_CBR_CBG_CBRGAIN_Pos           _UINT32_(0)                                          /* (ISC_CSC_CBR_CBG) Red Gain for Blue Chrominance (signed 12 bits, 1:3:8) Position */
#define ISC_CSC_CBR_CBG_CBRGAIN_Msk           (_UINT32_(0xFFF) << ISC_CSC_CBR_CBG_CBRGAIN_Pos)     /* (ISC_CSC_CBR_CBG) Red Gain for Blue Chrominance (signed 12 bits, 1:3:8) Mask */
#define ISC_CSC_CBR_CBG_CBRGAIN(value)        (ISC_CSC_CBR_CBG_CBRGAIN_Msk & (_UINT32_(value) << ISC_CSC_CBR_CBG_CBRGAIN_Pos)) /* Assigment of value for CBRGAIN in the ISC_CSC_CBR_CBG register */
#define ISC_CSC_CBR_CBG_CBGGAIN_Pos           _UINT32_(16)                                         /* (ISC_CSC_CBR_CBG) Green Gain for Blue Chrominance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_CBR_CBG_CBGGAIN_Msk           (_UINT32_(0xFFF) << ISC_CSC_CBR_CBG_CBGGAIN_Pos)     /* (ISC_CSC_CBR_CBG) Green Gain for Blue Chrominance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_CBR_CBG_CBGGAIN(value)        (ISC_CSC_CBR_CBG_CBGGAIN_Msk & (_UINT32_(value) << ISC_CSC_CBR_CBG_CBGGAIN_Pos)) /* Assigment of value for CBGGAIN in the ISC_CSC_CBR_CBG register */
#define ISC_CSC_CBR_CBG_Msk                   _UINT32_(0x0FFF0FFF)                                 /* (ISC_CSC_CBR_CBG) Register Mask  */


/* -------- ISC_CSC_CRB_OCR : (ISC Offset: 0x3B0) (R/W 32) Color Space Conversion CRB OCR Register -------- */
#define ISC_CSC_CRB_OCR_CRBGAIN_Pos           _UINT32_(0)                                          /* (ISC_CSC_CRB_OCR) Blue Gain for Red Chrominance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_CRB_OCR_CRBGAIN_Msk           (_UINT32_(0xFFF) << ISC_CSC_CRB_OCR_CRBGAIN_Pos)     /* (ISC_CSC_CRB_OCR) Blue Gain for Red Chrominance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_CRB_OCR_CRBGAIN(value)        (ISC_CSC_CRB_OCR_CRBGAIN_Msk & (_UINT32_(value) << ISC_CSC_CRB_OCR_CRBGAIN_Pos)) /* Assigment of value for CRBGAIN in the ISC_CSC_CRB_OCR register */
#define ISC_CSC_CRB_OCR_CROFST_Pos            _UINT32_(16)                                         /* (ISC_CSC_CRB_OCR) Red Chrominance Offset (signed 11 bits 1:10:0) Position */
#define ISC_CSC_CRB_OCR_CROFST_Msk            (_UINT32_(0x7FF) << ISC_CSC_CRB_OCR_CROFST_Pos)      /* (ISC_CSC_CRB_OCR) Red Chrominance Offset (signed 11 bits 1:10:0) Mask */
#define ISC_CSC_CRB_OCR_CROFST(value)         (ISC_CSC_CRB_OCR_CROFST_Msk & (_UINT32_(value) << ISC_CSC_CRB_OCR_CROFST_Pos)) /* Assigment of value for CROFST in the ISC_CSC_CRB_OCR register */
#define ISC_CSC_CRB_OCR_Msk                   _UINT32_(0x07FF0FFF)                                 /* (ISC_CSC_CRB_OCR) Register Mask  */


/* -------- ISC_CSC_CRR_CRG : (ISC Offset: 0x3AC) (R/W 32) Color Space Conversion CRR CRG Register -------- */
#define ISC_CSC_CRR_CRG_CRRGAIN_Pos           _UINT32_(0)                                          /* (ISC_CSC_CRR_CRG) Red Gain for Red Chrominance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_CRR_CRG_CRRGAIN_Msk           (_UINT32_(0xFFF) << ISC_CSC_CRR_CRG_CRRGAIN_Pos)     /* (ISC_CSC_CRR_CRG) Red Gain for Red Chrominance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_CRR_CRG_CRRGAIN(value)        (ISC_CSC_CRR_CRG_CRRGAIN_Msk & (_UINT32_(value) << ISC_CSC_CRR_CRG_CRRGAIN_Pos)) /* Assigment of value for CRRGAIN in the ISC_CSC_CRR_CRG register */
#define ISC_CSC_CRR_CRG_CRGGAIN_Pos           _UINT32_(16)                                         /* (ISC_CSC_CRR_CRG) Green Gain for Red Chrominance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_CRR_CRG_CRGGAIN_Msk           (_UINT32_(0xFFF) << ISC_CSC_CRR_CRG_CRGGAIN_Pos)     /* (ISC_CSC_CRR_CRG) Green Gain for Red Chrominance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_CRR_CRG_CRGGAIN(value)        (ISC_CSC_CRR_CRG_CRGGAIN_Msk & (_UINT32_(value) << ISC_CSC_CRR_CRG_CRGGAIN_Pos)) /* Assigment of value for CRGGAIN in the ISC_CSC_CRR_CRG register */
#define ISC_CSC_CRR_CRG_Msk                   _UINT32_(0x0FFF0FFF)                                 /* (ISC_CSC_CRR_CRG) Register Mask  */


