Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/uart/uart_echo_interrupt/firmware/src/packs/ATSAMA5D29_DFP/component/isc.h
/* -------- ISC_CSC_CTRL : (ISC Offset: 0x398) (R/W 32) Color Space Conversion Control Register -------- */
#define ISC_CSC_CTRL_ENABLE_Pos               _UINT32_(0)                                          /* (ISC_CSC_CTRL) RGB to YCbCr Color Space Conversion Enable Position */
#define ISC_CSC_CTRL_ENABLE_Msk               (_UINT32_(0x1) << ISC_CSC_CTRL_ENABLE_Pos)           /* (ISC_CSC_CTRL) RGB to YCbCr Color Space Conversion Enable Mask */
#define ISC_CSC_CTRL_ENABLE(value)            (ISC_CSC_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_CSC_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_CSC_CTRL register */
#define ISC_CSC_CTRL_Msk                      _UINT32_(0x00000001)                                 /* (ISC_CSC_CTRL) Register Mask  */


/* -------- ISC_CSC_YB_OY : (ISC Offset: 0x3A0) (R/W 32) Color Space Conversion YB, OY Register -------- */
#define ISC_CSC_YB_OY_YBGAIN_Pos              _UINT32_(0)                                          /* (ISC_CSC_YB_OY) Blue Gain for Luminance Component (12 bits signed 1:3:8) Position */
#define ISC_CSC_YB_OY_YBGAIN_Msk              (_UINT32_(0xFFF) << ISC_CSC_YB_OY_YBGAIN_Pos)        /* (ISC_CSC_YB_OY) Blue Gain for Luminance Component (12 bits signed 1:3:8) Mask */
#define ISC_CSC_YB_OY_YBGAIN(value)           (ISC_CSC_YB_OY_YBGAIN_Msk & (_UINT32_(value) << ISC_CSC_YB_OY_YBGAIN_Pos)) /* Assigment of value for YBGAIN in the ISC_CSC_YB_OY register */
#define ISC_CSC_YB_OY_YOFST_Pos               _UINT32_(16)                                         /* (ISC_CSC_YB_OY) Luminance Offset (11 bits signed 1:10:0) Position */
#define ISC_CSC_YB_OY_YOFST_Msk               (_UINT32_(0x7FF) << ISC_CSC_YB_OY_YOFST_Pos)         /* (ISC_CSC_YB_OY) Luminance Offset (11 bits signed 1:10:0) Mask */
#define ISC_CSC_YB_OY_YOFST(value)            (ISC_CSC_YB_OY_YOFST_Msk & (_UINT32_(value) << ISC_CSC_YB_OY_YOFST_Pos)) /* Assigment of value for YOFST in the ISC_CSC_YB_OY register */
#define ISC_CSC_YB_OY_Msk                     _UINT32_(0x07FF0FFF)                                 /* (ISC_CSC_YB_OY) Register Mask  */


/* -------- ISC_CSC_YR_YG : (ISC Offset: 0x39C) (R/W 32) Color Space Conversion YR, YG Register -------- */
#define ISC_CSC_YR_YG_YRGAIN_Pos              _UINT32_(0)                                          /* (ISC_CSC_YR_YG) Reg Gain for Luminance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_YR_YG_YRGAIN_Msk              (_UINT32_(0xFFF) << ISC_CSC_YR_YG_YRGAIN_Pos)        /* (ISC_CSC_YR_YG) Reg Gain for Luminance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_YR_YG_YRGAIN(value)           (ISC_CSC_YR_YG_YRGAIN_Msk & (_UINT32_(value) << ISC_CSC_YR_YG_YRGAIN_Pos)) /* Assigment of value for YRGAIN in the ISC_CSC_YR_YG register */
#define ISC_CSC_YR_YG_YGGAIN_Pos              _UINT32_(16)                                         /* (ISC_CSC_YR_YG) Green Gain for Luminance (signed 12 bits 1:3:8) Position */
#define ISC_CSC_YR_YG_YGGAIN_Msk              (_UINT32_(0xFFF) << ISC_CSC_YR_YG_YGGAIN_Pos)        /* (ISC_CSC_YR_YG) Green Gain for Luminance (signed 12 bits 1:3:8) Mask */
#define ISC_CSC_YR_YG_YGGAIN(value)           (ISC_CSC_YR_YG_YGGAIN_Msk & (_UINT32_(value) << ISC_CSC_YR_YG_YGGAIN_Pos)) /* Assigment of value for YGGAIN in the ISC_CSC_YR_YG register */
#define ISC_CSC_YR_YG_Msk                     _UINT32_(0x0FFF0FFF)                                 /* (ISC_CSC_YR_YG) Register Mask  */


/* -------- ISC_CTRLDIS : (ISC Offset: 0x04) ( /W 32) Control Disable Register -------- */
#define ISC_CTRLDIS_DISABLE_Pos               _UINT32_(0)                                          /* (ISC_CTRLDIS) Capture Disable Position */
#define ISC_CTRLDIS_DISABLE_Msk               (_UINT32_(0x1) << ISC_CTRLDIS_DISABLE_Pos)           /* (ISC_CTRLDIS) Capture Disable Mask */
#define ISC_CTRLDIS_DISABLE(value)            (ISC_CTRLDIS_DISABLE_Msk & (_UINT32_(value) << ISC_CTRLDIS_DISABLE_Pos)) /* Assigment of value for DISABLE in the ISC_CTRLDIS register */
#define ISC_CTRLDIS_SWRST_Pos                 _UINT32_(8)                                          /* (ISC_CTRLDIS) Software Reset Position */
#define ISC_CTRLDIS_SWRST_Msk                 (_UINT32_(0x1) << ISC_CTRLDIS_SWRST_Pos)             /* (ISC_CTRLDIS) Software Reset Mask */
#define ISC_CTRLDIS_SWRST(value)              (ISC_CTRLDIS_SWRST_Msk & (_UINT32_(value) << ISC_CTRLDIS_SWRST_Pos)) /* Assigment of value for SWRST in the ISC_CTRLDIS register */
#define ISC_CTRLDIS_Msk                       _UINT32_(0x00000101)                                 /* (ISC_CTRLDIS) Register Mask  */


/* -------- ISC_CTRLEN : (ISC Offset: 0x00) ( /W 32) Control Enable Register -------- */
#define ISC_CTRLEN_CAPTURE_Pos                _UINT32_(0)                                          /* (ISC_CTRLEN) Capture Input Stream Command Position */
#define ISC_CTRLEN_CAPTURE_Msk                (_UINT32_(0x1) << ISC_CTRLEN_CAPTURE_Pos)            /* (ISC_CTRLEN) Capture Input Stream Command Mask */
#define ISC_CTRLEN_CAPTURE(value)             (ISC_CTRLEN_CAPTURE_Msk & (_UINT32_(value) << ISC_CTRLEN_CAPTURE_Pos)) /* Assigment of value for CAPTURE in the ISC_CTRLEN register */
#define ISC_CTRLEN_UPPRO_Pos                  _UINT32_(1)                                          /* (ISC_CTRLEN) Update Profile Position */
#define ISC_CTRLEN_UPPRO_Msk                  (_UINT32_(0x1) << ISC_CTRLEN_UPPRO_Pos)              /* (ISC_CTRLEN) Update Profile Mask */
#define ISC_CTRLEN_UPPRO(value)               (ISC_CTRLEN_UPPRO_Msk & (_UINT32_(value) << ISC_CTRLEN_UPPRO_Pos)) /* Assigment of value for UPPRO in the ISC_CTRLEN register */
#define ISC_CTRLEN_HISREQ_Pos                 _UINT32_(2)                                          /* (ISC_CTRLEN) Histogram Request Position */
#define ISC_CTRLEN_HISREQ_Msk                 (_UINT32_(0x1) << ISC_CTRLEN_HISREQ_Pos)             /* (ISC_CTRLEN) Histogram Request Mask */
#define ISC_CTRLEN_HISREQ(value)              (ISC_CTRLEN_HISREQ_Msk & (_UINT32_(value) << ISC_CTRLEN_HISREQ_Pos)) /* Assigment of value for HISREQ in the ISC_CTRLEN register */
#define ISC_CTRLEN_HISCLR_Pos                 _UINT32_(3)                                          /* (ISC_CTRLEN) Histogram Clear Position */
#define ISC_CTRLEN_HISCLR_Msk                 (_UINT32_(0x1) << ISC_CTRLEN_HISCLR_Pos)             /* (ISC_CTRLEN) Histogram Clear Mask */
#define ISC_CTRLEN_HISCLR(value)              (ISC_CTRLEN_HISCLR_Msk & (_UINT32_(value) << ISC_CTRLEN_HISCLR_Pos)) /* Assigment of value for HISCLR in the ISC_CTRLEN register */
#define ISC_CTRLEN_Msk                        _UINT32_(0x0000000F)                                 /* (ISC_CTRLEN) Register Mask  */


/* -------- ISC_CTRLSR : (ISC Offset: 0x08) ( R/ 32) Control Status Register -------- */
#define ISC_CTRLSR_CAPTURE_Pos                _UINT32_(0)                                          /* (ISC_CTRLSR) Capture pending Position */
#define ISC_CTRLSR_CAPTURE_Msk                (_UINT32_(0x1) << ISC_CTRLSR_CAPTURE_Pos)            /* (ISC_CTRLSR) Capture pending Mask */
#define ISC_CTRLSR_CAPTURE(value)             (ISC_CTRLSR_CAPTURE_Msk & (_UINT32_(value) << ISC_CTRLSR_CAPTURE_Pos)) /* Assigment of value for CAPTURE in the ISC_CTRLSR register */
#define ISC_CTRLSR_UPPRO_Pos                  _UINT32_(1)                                          /* (ISC_CTRLSR) Profile Update Pending Position */
#define ISC_CTRLSR_UPPRO_Msk                  (_UINT32_(0x1) << ISC_CTRLSR_UPPRO_Pos)              /* (ISC_CTRLSR) Profile Update Pending Mask */
#define ISC_CTRLSR_UPPRO(value)               (ISC_CTRLSR_UPPRO_Msk & (_UINT32_(value) << ISC_CTRLSR_UPPRO_Pos)) /* Assigment of value for UPPRO in the ISC_CTRLSR register */
#define ISC_CTRLSR_HISREQ_Pos                 _UINT32_(2)                                          /* (ISC_CTRLSR) Histogram Request Pending Position */
#define ISC_CTRLSR_HISREQ_Msk                 (_UINT32_(0x1) << ISC_CTRLSR_HISREQ_Pos)             /* (ISC_CTRLSR) Histogram Request Pending Mask */
#define ISC_CTRLSR_HISREQ(value)              (ISC_CTRLSR_HISREQ_Msk & (_UINT32_(value) << ISC_CTRLSR_HISREQ_Pos)) /* Assigment of value for HISREQ in the ISC_CTRLSR register */
#define ISC_CTRLSR_FIELD_Pos                  _UINT32_(4)                                          /* (ISC_CTRLSR) Field Status (only relevant when the video stream is interlaced) Position */
#define ISC_CTRLSR_FIELD_Msk                  (_UINT32_(0x1) << ISC_CTRLSR_FIELD_Pos)              /* (ISC_CTRLSR) Field Status (only relevant when the video stream is interlaced) Mask */
#define ISC_CTRLSR_FIELD(value)               (ISC_CTRLSR_FIELD_Msk & (_UINT32_(value) << ISC_CTRLSR_FIELD_Pos)) /* Assigment of value for FIELD in the ISC_CTRLSR register */
#define ISC_CTRLSR_SIP_Pos                    _UINT32_(31)                                         /* (ISC_CTRLSR) Synchronization In Progress Position */
#define ISC_CTRLSR_SIP_Msk                    (_UINT32_(0x1) << ISC_CTRLSR_SIP_Pos)                /* (ISC_CTRLSR) Synchronization In Progress Mask */
#define ISC_CTRLSR_SIP(value)                 (ISC_CTRLSR_SIP_Msk & (_UINT32_(value) << ISC_CTRLSR_SIP_Pos)) /* Assigment of value for SIP in the ISC_CTRLSR register */
#define ISC_CTRLSR_Msk                        _UINT32_(0x80000017)                                 /* (ISC_CTRLSR) Register Mask  */


/* -------- ISC_DCFG : (ISC Offset: 0x3E0) (R/W 32) DMA Configuration Register -------- */
#define ISC_DCFG_IMODE_Pos                    _UINT32_(0)                                          /* (ISC_DCFG) DMA Input Mode Selection Position */
#define ISC_DCFG_IMODE_Msk                    (_UINT32_(0x7) << ISC_DCFG_IMODE_Pos)                /* (ISC_DCFG) DMA Input Mode Selection Mask */
#define ISC_DCFG_IMODE(value)                 (ISC_DCFG_IMODE_Msk & (_UINT32_(value) << ISC_DCFG_IMODE_Pos)) /* Assigment of value for IMODE in the ISC_DCFG register */
#define   ISC_DCFG_IMODE_PACKED8_Val          _UINT32_(0x0)                                        /* (ISC_DCFG) 8 bits, single channel packed  */
#define   ISC_DCFG_IMODE_PACKED16_Val         _UINT32_(0x1)                                        /* (ISC_DCFG) 16 bits, single channel packed  */
#define   ISC_DCFG_IMODE_PACKED32_Val         _UINT32_(0x2)                                        /* (ISC_DCFG) 32 bits, single channel packed  */
#define   ISC_DCFG_IMODE_YC422SP_Val          _UINT32_(0x3)                                        /* (ISC_DCFG) 32 bits, dual channel  */
#define   ISC_DCFG_IMODE_YC422P_Val           _UINT32_(0x4)                                        /* (ISC_DCFG) 32 bits, triple channel  */
#define   ISC_DCFG_IMODE_YC420SP_Val          _UINT32_(0x5)                                        /* (ISC_DCFG) 32 bits, dual channel  */
#define   ISC_DCFG_IMODE_YC420P_Val           _UINT32_(0x6)                                        /* (ISC_DCFG) 32 bits, triple channel  */
#define ISC_DCFG_IMODE_PACKED8                (ISC_DCFG_IMODE_PACKED8_Val << ISC_DCFG_IMODE_Pos)   /* (ISC_DCFG) 8 bits, single channel packed Position  */
#define ISC_DCFG_IMODE_PACKED16               (ISC_DCFG_IMODE_PACKED16_Val << ISC_DCFG_IMODE_Pos)  /* (ISC_DCFG) 16 bits, single channel packed Position  */
#define ISC_DCFG_IMODE_PACKED32               (ISC_DCFG_IMODE_PACKED32_Val << ISC_DCFG_IMODE_Pos)  /* (ISC_DCFG) 32 bits, single channel packed Position  */
#define ISC_DCFG_IMODE_YC422SP                (ISC_DCFG_IMODE_YC422SP_Val << ISC_DCFG_IMODE_Pos)   /* (ISC_DCFG) 32 bits, dual channel Position  */
#define ISC_DCFG_IMODE_YC422P                 (ISC_DCFG_IMODE_YC422P_Val << ISC_DCFG_IMODE_Pos)    /* (ISC_DCFG) 32 bits, triple channel Position  */
#define ISC_DCFG_IMODE_YC420SP                (ISC_DCFG_IMODE_YC420SP_Val << ISC_DCFG_IMODE_Pos)   /* (ISC_DCFG) 32 bits, dual channel Position  */
#define ISC_DCFG_IMODE_YC420P                 (ISC_DCFG_IMODE_YC420P_Val << ISC_DCFG_IMODE_Pos)    /* (ISC_DCFG) 32 bits, triple channel Position  */
#define ISC_DCFG_YMBSIZE_Pos                  _UINT32_(4)                                          /* (ISC_DCFG) DMA Memory Burst Size Y channel Position */
#define ISC_DCFG_YMBSIZE_Msk                  (_UINT32_(0x3) << ISC_DCFG_YMBSIZE_Pos)              /* (ISC_DCFG) DMA Memory Burst Size Y channel Mask */
#define ISC_DCFG_YMBSIZE(value)               (ISC_DCFG_YMBSIZE_Msk & (_UINT32_(value) << ISC_DCFG_YMBSIZE_Pos)) /* Assigment of value for YMBSIZE in the ISC_DCFG register */
#define   ISC_DCFG_YMBSIZE_SINGLE_Val         _UINT32_(0x0)                                        /* (ISC_DCFG) DMA single access  */
#define   ISC_DCFG_YMBSIZE_BEATS4_Val         _UINT32_(0x1)                                        /* (ISC_DCFG) 4-beat burst access  */
#define   ISC_DCFG_YMBSIZE_BEATS8_Val         _UINT32_(0x2)                                        /* (ISC_DCFG) 8-beat burst access  */
#define   ISC_DCFG_YMBSIZE_BEATS16_Val        _UINT32_(0x3)                                        /* (ISC_DCFG) 16-beat burst access  */
#define ISC_DCFG_YMBSIZE_SINGLE               (ISC_DCFG_YMBSIZE_SINGLE_Val << ISC_DCFG_YMBSIZE_Pos) /* (ISC_DCFG) DMA single access Position  */
#define ISC_DCFG_YMBSIZE_BEATS4               (ISC_DCFG_YMBSIZE_BEATS4_Val << ISC_DCFG_YMBSIZE_Pos) /* (ISC_DCFG) 4-beat burst access Position  */
#define ISC_DCFG_YMBSIZE_BEATS8               (ISC_DCFG_YMBSIZE_BEATS8_Val << ISC_DCFG_YMBSIZE_Pos) /* (ISC_DCFG) 8-beat burst access Position  */
#define ISC_DCFG_YMBSIZE_BEATS16              (ISC_DCFG_YMBSIZE_BEATS16_Val << ISC_DCFG_YMBSIZE_Pos) /* (ISC_DCFG) 16-beat burst access Position  */
#define ISC_DCFG_CMBSIZE_Pos                  _UINT32_(8)                                          /* (ISC_DCFG) DMA Memory Burst Size C channel Position */
#define ISC_DCFG_CMBSIZE_Msk                  (_UINT32_(0x3) << ISC_DCFG_CMBSIZE_Pos)              /* (ISC_DCFG) DMA Memory Burst Size C channel Mask */
#define ISC_DCFG_CMBSIZE(value)               (ISC_DCFG_CMBSIZE_Msk & (_UINT32_(value) << ISC_DCFG_CMBSIZE_Pos)) /* Assigment of value for CMBSIZE in the ISC_DCFG register */
#define   ISC_DCFG_CMBSIZE_SINGLE_Val         _UINT32_(0x0)                                        /* (ISC_DCFG) DMA single access  */
#define   ISC_DCFG_CMBSIZE_BEATS4_Val         _UINT32_(0x1)                                        /* (ISC_DCFG) 4-beat burst access  */
#define   ISC_DCFG_CMBSIZE_BEATS8_Val         _UINT32_(0x2)                                        /* (ISC_DCFG) 8-beat burst access  */
#define   ISC_DCFG_CMBSIZE_BEATS16_Val        _UINT32_(0x3)                                        /* (ISC_DCFG) 16-beat burst access  */
#define ISC_DCFG_CMBSIZE_SINGLE               (ISC_DCFG_CMBSIZE_SINGLE_Val << ISC_DCFG_CMBSIZE_Pos) /* (ISC_DCFG) DMA single access Position  */
#define ISC_DCFG_CMBSIZE_BEATS4               (ISC_DCFG_CMBSIZE_BEATS4_Val << ISC_DCFG_CMBSIZE_Pos) /* (ISC_DCFG) 4-beat burst access Position  */
#define ISC_DCFG_CMBSIZE_BEATS8               (ISC_DCFG_CMBSIZE_BEATS8_Val << ISC_DCFG_CMBSIZE_Pos) /* (ISC_DCFG) 8-beat burst access Position  */
#define ISC_DCFG_CMBSIZE_BEATS16              (ISC_DCFG_CMBSIZE_BEATS16_Val << ISC_DCFG_CMBSIZE_Pos) /* (ISC_DCFG) 16-beat burst access Position  */
#define ISC_DCFG_Msk                          _UINT32_(0x00000337)                                 /* (ISC_DCFG) Register Mask  */


/* -------- ISC_DCTRL : (ISC Offset: 0x3E4) (R/W 32) DMA Control Register -------- */
#define ISC_DCTRL_DE_Pos                      _UINT32_(0)                                          /* (ISC_DCTRL) Descriptor Enable Position */
#define ISC_DCTRL_DE_Msk                      (_UINT32_(0x1) << ISC_DCTRL_DE_Pos)                  /* (ISC_DCTRL) Descriptor Enable Mask */
#define ISC_DCTRL_DE(value)                   (ISC_DCTRL_DE_Msk & (_UINT32_(value) << ISC_DCTRL_DE_Pos)) /* Assigment of value for DE in the ISC_DCTRL register */
#define ISC_DCTRL_DVIEW_Pos                   _UINT32_(1)                                          /* (ISC_DCTRL) Descriptor View Position */
#define ISC_DCTRL_DVIEW_Msk                   (_UINT32_(0x3) << ISC_DCTRL_DVIEW_Pos)               /* (ISC_DCTRL) Descriptor View Mask */
#define ISC_DCTRL_DVIEW(value)                (ISC_DCTRL_DVIEW_Msk & (_UINT32_(value) << ISC_DCTRL_DVIEW_Pos)) /* Assigment of value for DVIEW in the ISC_DCTRL register */
#define   ISC_DCTRL_DVIEW_PACKED_Val          _UINT32_(0x0)                                        /* (ISC_DCTRL) Address {0} Stride {0} are updated  */
#define   ISC_DCTRL_DVIEW_SEMIPLANAR_Val      _UINT32_(0x1)                                        /* (ISC_DCTRL) Address {0,1} Stride {0,1} are updated  */
#define   ISC_DCTRL_DVIEW_PLANAR_Val          _UINT32_(0x2)                                        /* (ISC_DCTRL) Address {0,1,2} Stride {0,1,2} are updated  */
#define ISC_DCTRL_DVIEW_PACKED                (ISC_DCTRL_DVIEW_PACKED_Val << ISC_DCTRL_DVIEW_Pos)  /* (ISC_DCTRL) Address {0} Stride {0} are updated Position  */
#define ISC_DCTRL_DVIEW_SEMIPLANAR            (ISC_DCTRL_DVIEW_SEMIPLANAR_Val << ISC_DCTRL_DVIEW_Pos) /* (ISC_DCTRL) Address {0,1} Stride {0,1} are updated Position  */
#define ISC_DCTRL_DVIEW_PLANAR                (ISC_DCTRL_DVIEW_PLANAR_Val << ISC_DCTRL_DVIEW_Pos)  /* (ISC_DCTRL) Address {0,1,2} Stride {0,1,2} are updated Position  */
#define ISC_DCTRL_IE_Pos                      _UINT32_(4)                                          /* (ISC_DCTRL) Interrupt Enable Position */
#define ISC_DCTRL_IE_Msk                      (_UINT32_(0x1) << ISC_DCTRL_IE_Pos)                  /* (ISC_DCTRL) Interrupt Enable Mask */
#define ISC_DCTRL_IE(value)                   (ISC_DCTRL_IE_Msk & (_UINT32_(value) << ISC_DCTRL_IE_Pos)) /* Assigment of value for IE in the ISC_DCTRL register */
#define ISC_DCTRL_WB_Pos                      _UINT32_(5)                                          /* (ISC_DCTRL) Write Back Operation Enable Position */
#define ISC_DCTRL_WB_Msk                      (_UINT32_(0x1) << ISC_DCTRL_WB_Pos)                  /* (ISC_DCTRL) Write Back Operation Enable Mask */
#define ISC_DCTRL_WB(value)                   (ISC_DCTRL_WB_Msk & (_UINT32_(value) << ISC_DCTRL_WB_Pos)) /* Assigment of value for WB in the ISC_DCTRL register */
#define ISC_DCTRL_FIELD_Pos                   _UINT32_(6)                                          /* (ISC_DCTRL) Value of Captured Frame Field Signal(1)(2) Position */
#define ISC_DCTRL_FIELD_Msk                   (_UINT32_(0x1) << ISC_DCTRL_FIELD_Pos)               /* (ISC_DCTRL) Value of Captured Frame Field Signal(1)(2) Mask */
#define ISC_DCTRL_FIELD(value)                (ISC_DCTRL_FIELD_Msk & (_UINT32_(value) << ISC_DCTRL_FIELD_Pos)) /* Assigment of value for FIELD in the ISC_DCTRL register */
#define ISC_DCTRL_DONE_Pos                    _UINT32_(7)                                          /* (ISC_DCTRL) Descriptor Processing Status(2) Position */
#define ISC_DCTRL_DONE_Msk                    (_UINT32_(0x1) << ISC_DCTRL_DONE_Pos)                /* (ISC_DCTRL) Descriptor Processing Status(2) Mask */
#define ISC_DCTRL_DONE(value)                 (ISC_DCTRL_DONE_Msk & (_UINT32_(value) << ISC_DCTRL_DONE_Pos)) /* Assigment of value for DONE in the ISC_DCTRL register */
#define ISC_DCTRL_Msk                         _UINT32_(0x000000F7)                                 /* (ISC_DCTRL) Register Mask  */


/* -------- ISC_DNDA : (ISC Offset: 0x3E8) (R/W 32) DMA Descriptor Address Register -------- */
#define ISC_DNDA_NDA_Pos                      _UINT32_(2)                                          /* (ISC_DNDA) Next Descriptor Address Register Position */
#define ISC_DNDA_NDA_Msk                      (_UINT32_(0x3FFFFFFF) << ISC_DNDA_NDA_Pos)           /* (ISC_DNDA) Next Descriptor Address Register Mask */
#define ISC_DNDA_NDA(value)                   (ISC_DNDA_NDA_Msk & (_UINT32_(value) << ISC_DNDA_NDA_Pos)) /* Assigment of value for NDA in the ISC_DNDA register */
#define ISC_DNDA_Msk                          _UINT32_(0xFFFFFFFC)                                 /* (ISC_DNDA) Register Mask  */


/* -------- ISC_GAM_BENTRY : (ISC Offset: 0x98) (R/W 32) Gamma Correction Blue Entry -------- */
#define ISC_GAM_BENTRY_BSLOPE_Pos             _UINT32_(0)                                          /* (ISC_GAM_BENTRY) Blue Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6) Position */
#define ISC_GAM_BENTRY_BSLOPE_Msk             (_UINT32_(0x3FF) << ISC_GAM_BENTRY_BSLOPE_Pos)       /* (ISC_GAM_BENTRY) Blue Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6) Mask */
#define ISC_GAM_BENTRY_BSLOPE(value)          (ISC_GAM_BENTRY_BSLOPE_Msk & (_UINT32_(value) << ISC_GAM_BENTRY_BSLOPE_Pos)) /* Assigment of value for BSLOPE in the ISC_GAM_BENTRY register */
#define ISC_GAM_BENTRY_BCONSTANT_Pos          _UINT32_(16)                                         /* (ISC_GAM_BENTRY) Blue Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0) Position */
#define ISC_GAM_BENTRY_BCONSTANT_Msk          (_UINT32_(0x3FF) << ISC_GAM_BENTRY_BCONSTANT_Pos)    /* (ISC_GAM_BENTRY) Blue Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0) Mask */
#define ISC_GAM_BENTRY_BCONSTANT(value)       (ISC_GAM_BENTRY_BCONSTANT_Msk & (_UINT32_(value) << ISC_GAM_BENTRY_BCONSTANT_Pos)) /* Assigment of value for BCONSTANT in the ISC_GAM_BENTRY register */
#define ISC_GAM_BENTRY_Msk                    _UINT32_(0x03FF03FF)                                 /* (ISC_GAM_BENTRY) Register Mask  */


/* -------- ISC_GAM_CTRL : (ISC Offset: 0x94) (R/W 32) Gamma Correction Control Register -------- */
#define ISC_GAM_CTRL_ENABLE_Pos               _UINT32_(0)                                          /* (ISC_GAM_CTRL) Gamma Correction Enable Position */
#define ISC_GAM_CTRL_ENABLE_Msk               (_UINT32_(0x1) << ISC_GAM_CTRL_ENABLE_Pos)           /* (ISC_GAM_CTRL) Gamma Correction Enable Mask */
#define ISC_GAM_CTRL_ENABLE(value)            (ISC_GAM_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_GAM_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_GAM_CTRL register */
#define ISC_GAM_CTRL_BENABLE_Pos              _UINT32_(1)                                          /* (ISC_GAM_CTRL) Gamma Correction Enable for B Channel Position */
#define ISC_GAM_CTRL_BENABLE_Msk              (_UINT32_(0x1) << ISC_GAM_CTRL_BENABLE_Pos)          /* (ISC_GAM_CTRL) Gamma Correction Enable for B Channel Mask */
#define ISC_GAM_CTRL_BENABLE(value)           (ISC_GAM_CTRL_BENABLE_Msk & (_UINT32_(value) << ISC_GAM_CTRL_BENABLE_Pos)) /* Assigment of value for BENABLE in the ISC_GAM_CTRL register */
#define ISC_GAM_CTRL_GENABLE_Pos              _UINT32_(2)                                          /* (ISC_GAM_CTRL) Gamma Correction Enable for G Channel Position */
#define ISC_GAM_CTRL_GENABLE_Msk              (_UINT32_(0x1) << ISC_GAM_CTRL_GENABLE_Pos)          /* (ISC_GAM_CTRL) Gamma Correction Enable for G Channel Mask */
#define ISC_GAM_CTRL_GENABLE(value)           (ISC_GAM_CTRL_GENABLE_Msk & (_UINT32_(value) << ISC_GAM_CTRL_GENABLE_Pos)) /* Assigment of value for GENABLE in the ISC_GAM_CTRL register */
#define ISC_GAM_CTRL_RENABLE_Pos              _UINT32_(3)                                          /* (ISC_GAM_CTRL) Gamma Correction Enable for R Channel Position */
#define ISC_GAM_CTRL_RENABLE_Msk              (_UINT32_(0x1) << ISC_GAM_CTRL_RENABLE_Pos)          /* (ISC_GAM_CTRL) Gamma Correction Enable for R Channel Mask */
#define ISC_GAM_CTRL_RENABLE(value)           (ISC_GAM_CTRL_RENABLE_Msk & (_UINT32_(value) << ISC_GAM_CTRL_RENABLE_Pos)) /* Assigment of value for RENABLE in the ISC_GAM_CTRL register */
#define ISC_GAM_CTRL_Msk                      _UINT32_(0x0000000F)                                 /* (ISC_GAM_CTRL) Register Mask  */


