Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/uart/uart_echo_interrupt/firmware/src/packs/ATSAMA5D29_DFP/component/isc.h
/* -------- ISC_GAM_GENTRY : (ISC Offset: 0x198) (R/W 32) Gamma Correction Green Entry -------- */
#define ISC_GAM_GENTRY_GSLOPE_Pos             _UINT32_(0)                                          /* (ISC_GAM_GENTRY) Green Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6) Position */
#define ISC_GAM_GENTRY_GSLOPE_Msk             (_UINT32_(0x3FF) << ISC_GAM_GENTRY_GSLOPE_Pos)       /* (ISC_GAM_GENTRY) Green Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6) Mask */
#define ISC_GAM_GENTRY_GSLOPE(value)          (ISC_GAM_GENTRY_GSLOPE_Msk & (_UINT32_(value) << ISC_GAM_GENTRY_GSLOPE_Pos)) /* Assigment of value for GSLOPE in the ISC_GAM_GENTRY register */
#define ISC_GAM_GENTRY_GCONSTANT_Pos          _UINT32_(16)                                         /* (ISC_GAM_GENTRY) Green Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0) Position */
#define ISC_GAM_GENTRY_GCONSTANT_Msk          (_UINT32_(0x3FF) << ISC_GAM_GENTRY_GCONSTANT_Pos)    /* (ISC_GAM_GENTRY) Green Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0) Mask */
#define ISC_GAM_GENTRY_GCONSTANT(value)       (ISC_GAM_GENTRY_GCONSTANT_Msk & (_UINT32_(value) << ISC_GAM_GENTRY_GCONSTANT_Pos)) /* Assigment of value for GCONSTANT in the ISC_GAM_GENTRY register */
#define ISC_GAM_GENTRY_Msk                    _UINT32_(0x03FF03FF)                                 /* (ISC_GAM_GENTRY) Register Mask  */


/* -------- ISC_GAM_RENTRY : (ISC Offset: 0x298) (R/W 32) Gamma Correction Red Entry -------- */
#define ISC_GAM_RENTRY_RSLOPE_Pos             _UINT32_(0)                                          /* (ISC_GAM_RENTRY) Red Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6) Position */
#define ISC_GAM_RENTRY_RSLOPE_Msk             (_UINT32_(0x3FF) << ISC_GAM_RENTRY_RSLOPE_Pos)       /* (ISC_GAM_RENTRY) Red Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6) Mask */
#define ISC_GAM_RENTRY_RSLOPE(value)          (ISC_GAM_RENTRY_RSLOPE_Msk & (_UINT32_(value) << ISC_GAM_RENTRY_RSLOPE_Pos)) /* Assigment of value for RSLOPE in the ISC_GAM_RENTRY register */
#define ISC_GAM_RENTRY_RCONSTANT_Pos          _UINT32_(16)                                         /* (ISC_GAM_RENTRY) Red Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0) Position */
#define ISC_GAM_RENTRY_RCONSTANT_Msk          (_UINT32_(0x3FF) << ISC_GAM_RENTRY_RCONSTANT_Pos)    /* (ISC_GAM_RENTRY) Red Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0) Mask */
#define ISC_GAM_RENTRY_RCONSTANT(value)       (ISC_GAM_RENTRY_RCONSTANT_Msk & (_UINT32_(value) << ISC_GAM_RENTRY_RCONSTANT_Pos)) /* Assigment of value for RCONSTANT in the ISC_GAM_RENTRY register */
#define ISC_GAM_RENTRY_Msk                    _UINT32_(0x03FF03FF)                                 /* (ISC_GAM_RENTRY) Register Mask  */


/* -------- ISC_HIS_CFG : (ISC Offset: 0x3D8) (R/W 32) Histogram Configuration Register -------- */
#define ISC_HIS_CFG_MODE_Pos                  _UINT32_(0)                                          /* (ISC_HIS_CFG) Histogram Operating Mode Position */
#define ISC_HIS_CFG_MODE_Msk                  (_UINT32_(0x7) << ISC_HIS_CFG_MODE_Pos)              /* (ISC_HIS_CFG) Histogram Operating Mode Mask */
#define ISC_HIS_CFG_MODE(value)               (ISC_HIS_CFG_MODE_Msk & (_UINT32_(value) << ISC_HIS_CFG_MODE_Pos)) /* Assigment of value for MODE in the ISC_HIS_CFG register */
#define   ISC_HIS_CFG_MODE_Gr_Val             _UINT32_(0x0)                                        /* (ISC_HIS_CFG) Gr sampling  */
#define   ISC_HIS_CFG_MODE_R_Val              _UINT32_(0x1)                                        /* (ISC_HIS_CFG) R sampling  */
#define   ISC_HIS_CFG_MODE_Gb_Val             _UINT32_(0x2)                                        /* (ISC_HIS_CFG) Gb sampling  */
#define   ISC_HIS_CFG_MODE_B_Val              _UINT32_(0x3)                                        /* (ISC_HIS_CFG) B sampling  */
#define   ISC_HIS_CFG_MODE_Y_Val              _UINT32_(0x4)                                        /* (ISC_HIS_CFG) Luminance-only mode  */
#define   ISC_HIS_CFG_MODE_RAW_Val            _UINT32_(0x5)                                        /* (ISC_HIS_CFG) Raw sampling  */
#define   ISC_HIS_CFG_MODE_YCCIR656_Val       _UINT32_(0x6)                                        /* (ISC_HIS_CFG) Luminance only with CCIR656 10-bit or 8-bit mode  */
#define ISC_HIS_CFG_MODE_Gr                   (ISC_HIS_CFG_MODE_Gr_Val << ISC_HIS_CFG_MODE_Pos)    /* (ISC_HIS_CFG) Gr sampling Position  */
#define ISC_HIS_CFG_MODE_R                    (ISC_HIS_CFG_MODE_R_Val << ISC_HIS_CFG_MODE_Pos)     /* (ISC_HIS_CFG) R sampling Position  */
#define ISC_HIS_CFG_MODE_Gb                   (ISC_HIS_CFG_MODE_Gb_Val << ISC_HIS_CFG_MODE_Pos)    /* (ISC_HIS_CFG) Gb sampling Position  */
#define ISC_HIS_CFG_MODE_B                    (ISC_HIS_CFG_MODE_B_Val << ISC_HIS_CFG_MODE_Pos)     /* (ISC_HIS_CFG) B sampling Position  */
#define ISC_HIS_CFG_MODE_Y                    (ISC_HIS_CFG_MODE_Y_Val << ISC_HIS_CFG_MODE_Pos)     /* (ISC_HIS_CFG) Luminance-only mode Position  */
#define ISC_HIS_CFG_MODE_RAW                  (ISC_HIS_CFG_MODE_RAW_Val << ISC_HIS_CFG_MODE_Pos)   /* (ISC_HIS_CFG) Raw sampling Position  */
#define ISC_HIS_CFG_MODE_YCCIR656             (ISC_HIS_CFG_MODE_YCCIR656_Val << ISC_HIS_CFG_MODE_Pos) /* (ISC_HIS_CFG) Luminance only with CCIR656 10-bit or 8-bit mode Position  */
#define ISC_HIS_CFG_BAYSEL_Pos                _UINT32_(4)                                          /* (ISC_HIS_CFG) Bayer Color Component Selection Position */
#define ISC_HIS_CFG_BAYSEL_Msk                (_UINT32_(0x3) << ISC_HIS_CFG_BAYSEL_Pos)            /* (ISC_HIS_CFG) Bayer Color Component Selection Mask */
#define ISC_HIS_CFG_BAYSEL(value)             (ISC_HIS_CFG_BAYSEL_Msk & (_UINT32_(value) << ISC_HIS_CFG_BAYSEL_Pos)) /* Assigment of value for BAYSEL in the ISC_HIS_CFG register */
#define   ISC_HIS_CFG_BAYSEL_GRGR_Val         _UINT32_(0x0)                                        /* (ISC_HIS_CFG) Starting row configuration is G R G R (red row)  */
#define   ISC_HIS_CFG_BAYSEL_RGRG_Val         _UINT32_(0x1)                                        /* (ISC_HIS_CFG) Starting row configuration is R G R G (red row)  */
#define   ISC_HIS_CFG_BAYSEL_GBGB_Val         _UINT32_(0x2)                                        /* (ISC_HIS_CFG) Starting row configuration is G B G B (blue row  */
#define   ISC_HIS_CFG_BAYSEL_BGBG_Val         _UINT32_(0x3)                                        /* (ISC_HIS_CFG) Starting row configuration is B G B G (blue row)  */
#define ISC_HIS_CFG_BAYSEL_GRGR               (ISC_HIS_CFG_BAYSEL_GRGR_Val << ISC_HIS_CFG_BAYSEL_Pos) /* (ISC_HIS_CFG) Starting row configuration is G R G R (red row) Position  */
#define ISC_HIS_CFG_BAYSEL_RGRG               (ISC_HIS_CFG_BAYSEL_RGRG_Val << ISC_HIS_CFG_BAYSEL_Pos) /* (ISC_HIS_CFG) Starting row configuration is R G R G (red row) Position  */
#define ISC_HIS_CFG_BAYSEL_GBGB               (ISC_HIS_CFG_BAYSEL_GBGB_Val << ISC_HIS_CFG_BAYSEL_Pos) /* (ISC_HIS_CFG) Starting row configuration is G B G B (blue row Position  */
#define ISC_HIS_CFG_BAYSEL_BGBG               (ISC_HIS_CFG_BAYSEL_BGBG_Val << ISC_HIS_CFG_BAYSEL_Pos) /* (ISC_HIS_CFG) Starting row configuration is B G B G (blue row) Position  */
#define ISC_HIS_CFG_RAR_Pos                   _UINT32_(8)                                          /* (ISC_HIS_CFG) Histogram Reset After Read Position */
#define ISC_HIS_CFG_RAR_Msk                   (_UINT32_(0x1) << ISC_HIS_CFG_RAR_Pos)               /* (ISC_HIS_CFG) Histogram Reset After Read Mask */
#define ISC_HIS_CFG_RAR(value)                (ISC_HIS_CFG_RAR_Msk & (_UINT32_(value) << ISC_HIS_CFG_RAR_Pos)) /* Assigment of value for RAR in the ISC_HIS_CFG register */
#define ISC_HIS_CFG_Msk                       _UINT32_(0x00000137)                                 /* (ISC_HIS_CFG) Register Mask  */


/* -------- ISC_HIS_CTRL : (ISC Offset: 0x3D4) (R/W 32) Histogram Control Register -------- */
#define ISC_HIS_CTRL_ENABLE_Pos               _UINT32_(0)                                          /* (ISC_HIS_CTRL) Histogram Sub Module Enable Position */
#define ISC_HIS_CTRL_ENABLE_Msk               (_UINT32_(0x1) << ISC_HIS_CTRL_ENABLE_Pos)           /* (ISC_HIS_CTRL) Histogram Sub Module Enable Mask */
#define ISC_HIS_CTRL_ENABLE(value)            (ISC_HIS_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_HIS_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_HIS_CTRL register */
#define ISC_HIS_CTRL_Msk                      _UINT32_(0x00000001)                                 /* (ISC_HIS_CTRL) Register Mask  */


/* -------- ISC_HIS_ENTRY : (ISC Offset: 0x410) ( R/ 32) Histogram Entry -------- */
#define ISC_HIS_ENTRY_COUNT_Pos               _UINT32_(0)                                          /* (ISC_HIS_ENTRY) Entry Counter Position */
#define ISC_HIS_ENTRY_COUNT_Msk               (_UINT32_(0xFFFFF) << ISC_HIS_ENTRY_COUNT_Pos)       /* (ISC_HIS_ENTRY) Entry Counter Mask */
#define ISC_HIS_ENTRY_COUNT(value)            (ISC_HIS_ENTRY_COUNT_Msk & (_UINT32_(value) << ISC_HIS_ENTRY_COUNT_Pos)) /* Assigment of value for COUNT in the ISC_HIS_ENTRY register */
#define ISC_HIS_ENTRY_Msk                     _UINT32_(0x000FFFFF)                                 /* (ISC_HIS_ENTRY) Register Mask  */


/* -------- ISC_INTDIS : (ISC Offset: 0x2C) ( /W 32) Interrupt Disable Register -------- */
#define ISC_INTDIS_VD_Pos                     _UINT32_(0)                                          /* (ISC_INTDIS) Vertical Synchronization Detection Interrupt Disable Position */
#define ISC_INTDIS_VD_Msk                     (_UINT32_(0x1) << ISC_INTDIS_VD_Pos)                 /* (ISC_INTDIS) Vertical Synchronization Detection Interrupt Disable Mask */
#define ISC_INTDIS_VD(value)                  (ISC_INTDIS_VD_Msk & (_UINT32_(value) << ISC_INTDIS_VD_Pos)) /* Assigment of value for VD in the ISC_INTDIS register */
#define ISC_INTDIS_HD_Pos                     _UINT32_(1)                                          /* (ISC_INTDIS) Horizontal Synchronization Detection Interrupt Disable Position */
#define ISC_INTDIS_HD_Msk                     (_UINT32_(0x1) << ISC_INTDIS_HD_Pos)                 /* (ISC_INTDIS) Horizontal Synchronization Detection Interrupt Disable Mask */
#define ISC_INTDIS_HD(value)                  (ISC_INTDIS_HD_Msk & (_UINT32_(value) << ISC_INTDIS_HD_Pos)) /* Assigment of value for HD in the ISC_INTDIS register */
#define ISC_INTDIS_SWRST_Pos                  _UINT32_(4)                                          /* (ISC_INTDIS) Software Reset Completed Interrupt Disable Position */
#define ISC_INTDIS_SWRST_Msk                  (_UINT32_(0x1) << ISC_INTDIS_SWRST_Pos)              /* (ISC_INTDIS) Software Reset Completed Interrupt Disable Mask */
#define ISC_INTDIS_SWRST(value)               (ISC_INTDIS_SWRST_Msk & (_UINT32_(value) << ISC_INTDIS_SWRST_Pos)) /* Assigment of value for SWRST in the ISC_INTDIS register */
#define ISC_INTDIS_DIS_Pos                    _UINT32_(5)                                          /* (ISC_INTDIS) Disable Completed Interrupt Disable Position */
#define ISC_INTDIS_DIS_Msk                    (_UINT32_(0x1) << ISC_INTDIS_DIS_Pos)                /* (ISC_INTDIS) Disable Completed Interrupt Disable Mask */
#define ISC_INTDIS_DIS(value)                 (ISC_INTDIS_DIS_Msk & (_UINT32_(value) << ISC_INTDIS_DIS_Pos)) /* Assigment of value for DIS in the ISC_INTDIS register */
#define ISC_INTDIS_DDONE_Pos                  _UINT32_(8)                                          /* (ISC_INTDIS) DMA Done Interrupt Disable Position */
#define ISC_INTDIS_DDONE_Msk                  (_UINT32_(0x1) << ISC_INTDIS_DDONE_Pos)              /* (ISC_INTDIS) DMA Done Interrupt Disable Mask */
#define ISC_INTDIS_DDONE(value)               (ISC_INTDIS_DDONE_Msk & (_UINT32_(value) << ISC_INTDIS_DDONE_Pos)) /* Assigment of value for DDONE in the ISC_INTDIS register */
#define ISC_INTDIS_LDONE_Pos                  _UINT32_(9)                                          /* (ISC_INTDIS) DMA List Done Interrupt Disable Position */
#define ISC_INTDIS_LDONE_Msk                  (_UINT32_(0x1) << ISC_INTDIS_LDONE_Pos)              /* (ISC_INTDIS) DMA List Done Interrupt Disable Mask */
#define ISC_INTDIS_LDONE(value)               (ISC_INTDIS_LDONE_Msk & (_UINT32_(value) << ISC_INTDIS_LDONE_Pos)) /* Assigment of value for LDONE in the ISC_INTDIS register */
#define ISC_INTDIS_HISDONE_Pos                _UINT32_(12)                                         /* (ISC_INTDIS) Histogram Completed Interrupt Disable Position */
#define ISC_INTDIS_HISDONE_Msk                (_UINT32_(0x1) << ISC_INTDIS_HISDONE_Pos)            /* (ISC_INTDIS) Histogram Completed Interrupt Disable Mask */
#define ISC_INTDIS_HISDONE(value)             (ISC_INTDIS_HISDONE_Msk & (_UINT32_(value) << ISC_INTDIS_HISDONE_Pos)) /* Assigment of value for HISDONE in the ISC_INTDIS register */
#define ISC_INTDIS_HISCLR_Pos                 _UINT32_(13)                                         /* (ISC_INTDIS) Histogram Clear Interrupt Disable Position */
#define ISC_INTDIS_HISCLR_Msk                 (_UINT32_(0x1) << ISC_INTDIS_HISCLR_Pos)             /* (ISC_INTDIS) Histogram Clear Interrupt Disable Mask */
#define ISC_INTDIS_HISCLR(value)              (ISC_INTDIS_HISCLR_Msk & (_UINT32_(value) << ISC_INTDIS_HISCLR_Pos)) /* Assigment of value for HISCLR in the ISC_INTDIS register */
#define ISC_INTDIS_WERR_Pos                   _UINT32_(16)                                         /* (ISC_INTDIS) Write Channel Error Interrupt Disable Position */
#define ISC_INTDIS_WERR_Msk                   (_UINT32_(0x1) << ISC_INTDIS_WERR_Pos)               /* (ISC_INTDIS) Write Channel Error Interrupt Disable Mask */
#define ISC_INTDIS_WERR(value)                (ISC_INTDIS_WERR_Msk & (_UINT32_(value) << ISC_INTDIS_WERR_Pos)) /* Assigment of value for WERR in the ISC_INTDIS register */
#define ISC_INTDIS_RERR_Pos                   _UINT32_(20)                                         /* (ISC_INTDIS) Read Channel Error Interrupt Disable Position */
#define ISC_INTDIS_RERR_Msk                   (_UINT32_(0x1) << ISC_INTDIS_RERR_Pos)               /* (ISC_INTDIS) Read Channel Error Interrupt Disable Mask */
#define ISC_INTDIS_RERR(value)                (ISC_INTDIS_RERR_Msk & (_UINT32_(value) << ISC_INTDIS_RERR_Pos)) /* Assigment of value for RERR in the ISC_INTDIS register */
#define ISC_INTDIS_VFPOV_Pos                  _UINT32_(24)                                         /* (ISC_INTDIS) Vertical Front Porch Overflow Interrupt Disable Position */
#define ISC_INTDIS_VFPOV_Msk                  (_UINT32_(0x1) << ISC_INTDIS_VFPOV_Pos)              /* (ISC_INTDIS) Vertical Front Porch Overflow Interrupt Disable Mask */
#define ISC_INTDIS_VFPOV(value)               (ISC_INTDIS_VFPOV_Msk & (_UINT32_(value) << ISC_INTDIS_VFPOV_Pos)) /* Assigment of value for VFPOV in the ISC_INTDIS register */
#define ISC_INTDIS_DAOV_Pos                   _UINT32_(25)                                         /* (ISC_INTDIS) Data Overflow Interrupt Disable Position */
#define ISC_INTDIS_DAOV_Msk                   (_UINT32_(0x1) << ISC_INTDIS_DAOV_Pos)               /* (ISC_INTDIS) Data Overflow Interrupt Disable Mask */
#define ISC_INTDIS_DAOV(value)                (ISC_INTDIS_DAOV_Msk & (_UINT32_(value) << ISC_INTDIS_DAOV_Pos)) /* Assigment of value for DAOV in the ISC_INTDIS register */
#define ISC_INTDIS_VDTO_Pos                   _UINT32_(26)                                         /* (ISC_INTDIS) Vertical Synchronization Timeout Interrupt Disable Position */
#define ISC_INTDIS_VDTO_Msk                   (_UINT32_(0x1) << ISC_INTDIS_VDTO_Pos)               /* (ISC_INTDIS) Vertical Synchronization Timeout Interrupt Disable Mask */
#define ISC_INTDIS_VDTO(value)                (ISC_INTDIS_VDTO_Msk & (_UINT32_(value) << ISC_INTDIS_VDTO_Pos)) /* Assigment of value for VDTO in the ISC_INTDIS register */
#define ISC_INTDIS_HDTO_Pos                   _UINT32_(27)                                         /* (ISC_INTDIS) Horizontal Synchronization Timeout Interrupt Disable Position */
#define ISC_INTDIS_HDTO_Msk                   (_UINT32_(0x1) << ISC_INTDIS_HDTO_Pos)               /* (ISC_INTDIS) Horizontal Synchronization Timeout Interrupt Disable Mask */
#define ISC_INTDIS_HDTO(value)                (ISC_INTDIS_HDTO_Msk & (_UINT32_(value) << ISC_INTDIS_HDTO_Pos)) /* Assigment of value for HDTO in the ISC_INTDIS register */
#define ISC_INTDIS_CCIRERR_Pos                _UINT32_(28)                                         /* (ISC_INTDIS) CCIR Decoder Error Interrupt Disable Position */
#define ISC_INTDIS_CCIRERR_Msk                (_UINT32_(0x1) << ISC_INTDIS_CCIRERR_Pos)            /* (ISC_INTDIS) CCIR Decoder Error Interrupt Disable Mask */
#define ISC_INTDIS_CCIRERR(value)             (ISC_INTDIS_CCIRERR_Msk & (_UINT32_(value) << ISC_INTDIS_CCIRERR_Pos)) /* Assigment of value for CCIRERR in the ISC_INTDIS register */
#define ISC_INTDIS_Msk                        _UINT32_(0x1F113333)                                 /* (ISC_INTDIS) Register Mask  */


