Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/uart/uart_echo_interrupt/firmware/src/packs/ATSAMA5D29_DFP/component/isc.h
/* -------- ISC_INTEN : (ISC Offset: 0x28) ( /W 32) Interrupt Enable Register -------- */
#define ISC_INTEN_VD_Pos                      _UINT32_(0)                                          /* (ISC_INTEN) Vertical Synchronization Detection Interrupt Enable Position */
#define ISC_INTEN_VD_Msk                      (_UINT32_(0x1) << ISC_INTEN_VD_Pos)                  /* (ISC_INTEN) Vertical Synchronization Detection Interrupt Enable Mask */
#define ISC_INTEN_VD(value)                   (ISC_INTEN_VD_Msk & (_UINT32_(value) << ISC_INTEN_VD_Pos)) /* Assigment of value for VD in the ISC_INTEN register */
#define ISC_INTEN_HD_Pos                      _UINT32_(1)                                          /* (ISC_INTEN) Horizontal Synchronization Detection Interrupt Enable Position */
#define ISC_INTEN_HD_Msk                      (_UINT32_(0x1) << ISC_INTEN_HD_Pos)                  /* (ISC_INTEN) Horizontal Synchronization Detection Interrupt Enable Mask */
#define ISC_INTEN_HD(value)                   (ISC_INTEN_HD_Msk & (_UINT32_(value) << ISC_INTEN_HD_Pos)) /* Assigment of value for HD in the ISC_INTEN register */
#define ISC_INTEN_SWRST_Pos                   _UINT32_(4)                                          /* (ISC_INTEN) Software Reset Completed Interrupt Enable Position */
#define ISC_INTEN_SWRST_Msk                   (_UINT32_(0x1) << ISC_INTEN_SWRST_Pos)               /* (ISC_INTEN) Software Reset Completed Interrupt Enable Mask */
#define ISC_INTEN_SWRST(value)                (ISC_INTEN_SWRST_Msk & (_UINT32_(value) << ISC_INTEN_SWRST_Pos)) /* Assigment of value for SWRST in the ISC_INTEN register */
#define ISC_INTEN_DIS_Pos                     _UINT32_(5)                                          /* (ISC_INTEN) Disable Completed Interrupt Enable Position */
#define ISC_INTEN_DIS_Msk                     (_UINT32_(0x1) << ISC_INTEN_DIS_Pos)                 /* (ISC_INTEN) Disable Completed Interrupt Enable Mask */
#define ISC_INTEN_DIS(value)                  (ISC_INTEN_DIS_Msk & (_UINT32_(value) << ISC_INTEN_DIS_Pos)) /* Assigment of value for DIS in the ISC_INTEN register */
#define ISC_INTEN_DDONE_Pos                   _UINT32_(8)                                          /* (ISC_INTEN) DMA Done Interrupt Enable Position */
#define ISC_INTEN_DDONE_Msk                   (_UINT32_(0x1) << ISC_INTEN_DDONE_Pos)               /* (ISC_INTEN) DMA Done Interrupt Enable Mask */
#define ISC_INTEN_DDONE(value)                (ISC_INTEN_DDONE_Msk & (_UINT32_(value) << ISC_INTEN_DDONE_Pos)) /* Assigment of value for DDONE in the ISC_INTEN register */
#define ISC_INTEN_LDONE_Pos                   _UINT32_(9)                                          /* (ISC_INTEN) DMA List Done Interrupt Enable Position */
#define ISC_INTEN_LDONE_Msk                   (_UINT32_(0x1) << ISC_INTEN_LDONE_Pos)               /* (ISC_INTEN) DMA List Done Interrupt Enable Mask */
#define ISC_INTEN_LDONE(value)                (ISC_INTEN_LDONE_Msk & (_UINT32_(value) << ISC_INTEN_LDONE_Pos)) /* Assigment of value for LDONE in the ISC_INTEN register */
#define ISC_INTEN_HISDONE_Pos                 _UINT32_(12)                                         /* (ISC_INTEN) Histogram Completed Interrupt Enable Position */
#define ISC_INTEN_HISDONE_Msk                 (_UINT32_(0x1) << ISC_INTEN_HISDONE_Pos)             /* (ISC_INTEN) Histogram Completed Interrupt Enable Mask */
#define ISC_INTEN_HISDONE(value)              (ISC_INTEN_HISDONE_Msk & (_UINT32_(value) << ISC_INTEN_HISDONE_Pos)) /* Assigment of value for HISDONE in the ISC_INTEN register */
#define ISC_INTEN_HISCLR_Pos                  _UINT32_(13)                                         /* (ISC_INTEN) Histogram Clear Interrupt Enable Position */
#define ISC_INTEN_HISCLR_Msk                  (_UINT32_(0x1) << ISC_INTEN_HISCLR_Pos)              /* (ISC_INTEN) Histogram Clear Interrupt Enable Mask */
#define ISC_INTEN_HISCLR(value)               (ISC_INTEN_HISCLR_Msk & (_UINT32_(value) << ISC_INTEN_HISCLR_Pos)) /* Assigment of value for HISCLR in the ISC_INTEN register */
#define ISC_INTEN_WERR_Pos                    _UINT32_(16)                                         /* (ISC_INTEN) Write Channel Error Interrupt Enable Position */
#define ISC_INTEN_WERR_Msk                    (_UINT32_(0x1) << ISC_INTEN_WERR_Pos)                /* (ISC_INTEN) Write Channel Error Interrupt Enable Mask */
#define ISC_INTEN_WERR(value)                 (ISC_INTEN_WERR_Msk & (_UINT32_(value) << ISC_INTEN_WERR_Pos)) /* Assigment of value for WERR in the ISC_INTEN register */
#define ISC_INTEN_RERR_Pos                    _UINT32_(20)                                         /* (ISC_INTEN) Read Channel Error Interrupt Enable Position */
#define ISC_INTEN_RERR_Msk                    (_UINT32_(0x1) << ISC_INTEN_RERR_Pos)                /* (ISC_INTEN) Read Channel Error Interrupt Enable Mask */
#define ISC_INTEN_RERR(value)                 (ISC_INTEN_RERR_Msk & (_UINT32_(value) << ISC_INTEN_RERR_Pos)) /* Assigment of value for RERR in the ISC_INTEN register */
#define ISC_INTEN_VFPOV_Pos                   _UINT32_(24)                                         /* (ISC_INTEN) Vertical Front Porch Overflow Interrupt Enable Position */
#define ISC_INTEN_VFPOV_Msk                   (_UINT32_(0x1) << ISC_INTEN_VFPOV_Pos)               /* (ISC_INTEN) Vertical Front Porch Overflow Interrupt Enable Mask */
#define ISC_INTEN_VFPOV(value)                (ISC_INTEN_VFPOV_Msk & (_UINT32_(value) << ISC_INTEN_VFPOV_Pos)) /* Assigment of value for VFPOV in the ISC_INTEN register */
#define ISC_INTEN_DAOV_Pos                    _UINT32_(25)                                         /* (ISC_INTEN) Data Overflow Interrupt Enable Position */
#define ISC_INTEN_DAOV_Msk                    (_UINT32_(0x1) << ISC_INTEN_DAOV_Pos)                /* (ISC_INTEN) Data Overflow Interrupt Enable Mask */
#define ISC_INTEN_DAOV(value)                 (ISC_INTEN_DAOV_Msk & (_UINT32_(value) << ISC_INTEN_DAOV_Pos)) /* Assigment of value for DAOV in the ISC_INTEN register */
#define ISC_INTEN_VDTO_Pos                    _UINT32_(26)                                         /* (ISC_INTEN) Vertical Synchronization Timeout Interrupt Enable Position */
#define ISC_INTEN_VDTO_Msk                    (_UINT32_(0x1) << ISC_INTEN_VDTO_Pos)                /* (ISC_INTEN) Vertical Synchronization Timeout Interrupt Enable Mask */
#define ISC_INTEN_VDTO(value)                 (ISC_INTEN_VDTO_Msk & (_UINT32_(value) << ISC_INTEN_VDTO_Pos)) /* Assigment of value for VDTO in the ISC_INTEN register */
#define ISC_INTEN_HDTO_Pos                    _UINT32_(27)                                         /* (ISC_INTEN) Horizontal Synchronization Timeout Interrupt Enable Position */
#define ISC_INTEN_HDTO_Msk                    (_UINT32_(0x1) << ISC_INTEN_HDTO_Pos)                /* (ISC_INTEN) Horizontal Synchronization Timeout Interrupt Enable Mask */
#define ISC_INTEN_HDTO(value)                 (ISC_INTEN_HDTO_Msk & (_UINT32_(value) << ISC_INTEN_HDTO_Pos)) /* Assigment of value for HDTO in the ISC_INTEN register */
#define ISC_INTEN_CCIRERR_Pos                 _UINT32_(28)                                         /* (ISC_INTEN) CCIR Decoder Error Interrupt Enable Position */
#define ISC_INTEN_CCIRERR_Msk                 (_UINT32_(0x1) << ISC_INTEN_CCIRERR_Pos)             /* (ISC_INTEN) CCIR Decoder Error Interrupt Enable Mask */
#define ISC_INTEN_CCIRERR(value)              (ISC_INTEN_CCIRERR_Msk & (_UINT32_(value) << ISC_INTEN_CCIRERR_Pos)) /* Assigment of value for CCIRERR in the ISC_INTEN register */
#define ISC_INTEN_Msk                         _UINT32_(0x1F113333)                                 /* (ISC_INTEN) Register Mask  */


/* -------- ISC_INTMASK : (ISC Offset: 0x30) ( R/ 32) Interrupt Mask Register -------- */
#define ISC_INTMASK_VD_Pos                    _UINT32_(0)                                          /* (ISC_INTMASK) Vertical Synchronization Detection Interrupt Mask Position */
#define ISC_INTMASK_VD_Msk                    (_UINT32_(0x1) << ISC_INTMASK_VD_Pos)                /* (ISC_INTMASK) Vertical Synchronization Detection Interrupt Mask Mask */
#define ISC_INTMASK_VD(value)                 (ISC_INTMASK_VD_Msk & (_UINT32_(value) << ISC_INTMASK_VD_Pos)) /* Assigment of value for VD in the ISC_INTMASK register */
#define ISC_INTMASK_HD_Pos                    _UINT32_(1)                                          /* (ISC_INTMASK) Horizontal Synchronization Detection Interrupt Mask Position */
#define ISC_INTMASK_HD_Msk                    (_UINT32_(0x1) << ISC_INTMASK_HD_Pos)                /* (ISC_INTMASK) Horizontal Synchronization Detection Interrupt Mask Mask */
#define ISC_INTMASK_HD(value)                 (ISC_INTMASK_HD_Msk & (_UINT32_(value) << ISC_INTMASK_HD_Pos)) /* Assigment of value for HD in the ISC_INTMASK register */
#define ISC_INTMASK_SWRST_Pos                 _UINT32_(4)                                          /* (ISC_INTMASK) Software Reset Completed Interrupt Mask Position */
#define ISC_INTMASK_SWRST_Msk                 (_UINT32_(0x1) << ISC_INTMASK_SWRST_Pos)             /* (ISC_INTMASK) Software Reset Completed Interrupt Mask Mask */
#define ISC_INTMASK_SWRST(value)              (ISC_INTMASK_SWRST_Msk & (_UINT32_(value) << ISC_INTMASK_SWRST_Pos)) /* Assigment of value for SWRST in the ISC_INTMASK register */
#define ISC_INTMASK_DIS_Pos                   _UINT32_(5)                                          /* (ISC_INTMASK) Disable Completed Interrupt Mask Position */
#define ISC_INTMASK_DIS_Msk                   (_UINT32_(0x1) << ISC_INTMASK_DIS_Pos)               /* (ISC_INTMASK) Disable Completed Interrupt Mask Mask */
#define ISC_INTMASK_DIS(value)                (ISC_INTMASK_DIS_Msk & (_UINT32_(value) << ISC_INTMASK_DIS_Pos)) /* Assigment of value for DIS in the ISC_INTMASK register */
#define ISC_INTMASK_DDONE_Pos                 _UINT32_(8)                                          /* (ISC_INTMASK) DMA Done Interrupt Mask Position */
#define ISC_INTMASK_DDONE_Msk                 (_UINT32_(0x1) << ISC_INTMASK_DDONE_Pos)             /* (ISC_INTMASK) DMA Done Interrupt Mask Mask */
#define ISC_INTMASK_DDONE(value)              (ISC_INTMASK_DDONE_Msk & (_UINT32_(value) << ISC_INTMASK_DDONE_Pos)) /* Assigment of value for DDONE in the ISC_INTMASK register */
#define ISC_INTMASK_LDONE_Pos                 _UINT32_(9)                                          /* (ISC_INTMASK) DMA List Done Interrupt Mask Position */
#define ISC_INTMASK_LDONE_Msk                 (_UINT32_(0x1) << ISC_INTMASK_LDONE_Pos)             /* (ISC_INTMASK) DMA List Done Interrupt Mask Mask */
#define ISC_INTMASK_LDONE(value)              (ISC_INTMASK_LDONE_Msk & (_UINT32_(value) << ISC_INTMASK_LDONE_Pos)) /* Assigment of value for LDONE in the ISC_INTMASK register */
#define ISC_INTMASK_HISDONE_Pos               _UINT32_(12)                                         /* (ISC_INTMASK) Histogram Completed Interrupt Mask Position */
#define ISC_INTMASK_HISDONE_Msk               (_UINT32_(0x1) << ISC_INTMASK_HISDONE_Pos)           /* (ISC_INTMASK) Histogram Completed Interrupt Mask Mask */
#define ISC_INTMASK_HISDONE(value)            (ISC_INTMASK_HISDONE_Msk & (_UINT32_(value) << ISC_INTMASK_HISDONE_Pos)) /* Assigment of value for HISDONE in the ISC_INTMASK register */
#define ISC_INTMASK_HISCLR_Pos                _UINT32_(13)                                         /* (ISC_INTMASK) Histogram Clear Interrupt Mask Position */
#define ISC_INTMASK_HISCLR_Msk                (_UINT32_(0x1) << ISC_INTMASK_HISCLR_Pos)            /* (ISC_INTMASK) Histogram Clear Interrupt Mask Mask */
#define ISC_INTMASK_HISCLR(value)             (ISC_INTMASK_HISCLR_Msk & (_UINT32_(value) << ISC_INTMASK_HISCLR_Pos)) /* Assigment of value for HISCLR in the ISC_INTMASK register */
#define ISC_INTMASK_WERR_Pos                  _UINT32_(16)                                         /* (ISC_INTMASK) Write Channel Error Interrupt Mask Position */
#define ISC_INTMASK_WERR_Msk                  (_UINT32_(0x1) << ISC_INTMASK_WERR_Pos)              /* (ISC_INTMASK) Write Channel Error Interrupt Mask Mask */
#define ISC_INTMASK_WERR(value)               (ISC_INTMASK_WERR_Msk & (_UINT32_(value) << ISC_INTMASK_WERR_Pos)) /* Assigment of value for WERR in the ISC_INTMASK register */
#define ISC_INTMASK_RERR_Pos                  _UINT32_(20)                                         /* (ISC_INTMASK) Read Channel Error Interrupt Mask Position */
#define ISC_INTMASK_RERR_Msk                  (_UINT32_(0x1) << ISC_INTMASK_RERR_Pos)              /* (ISC_INTMASK) Read Channel Error Interrupt Mask Mask */
#define ISC_INTMASK_RERR(value)               (ISC_INTMASK_RERR_Msk & (_UINT32_(value) << ISC_INTMASK_RERR_Pos)) /* Assigment of value for RERR in the ISC_INTMASK register */
#define ISC_INTMASK_VFPOV_Pos                 _UINT32_(24)                                         /* (ISC_INTMASK) Vertical Front Porch Overflow Interrupt Mask Position */
#define ISC_INTMASK_VFPOV_Msk                 (_UINT32_(0x1) << ISC_INTMASK_VFPOV_Pos)             /* (ISC_INTMASK) Vertical Front Porch Overflow Interrupt Mask Mask */
#define ISC_INTMASK_VFPOV(value)              (ISC_INTMASK_VFPOV_Msk & (_UINT32_(value) << ISC_INTMASK_VFPOV_Pos)) /* Assigment of value for VFPOV in the ISC_INTMASK register */
#define ISC_INTMASK_DAOV_Pos                  _UINT32_(25)                                         /* (ISC_INTMASK) Data Overflow Interrupt Mask Position */
#define ISC_INTMASK_DAOV_Msk                  (_UINT32_(0x1) << ISC_INTMASK_DAOV_Pos)              /* (ISC_INTMASK) Data Overflow Interrupt Mask Mask */
#define ISC_INTMASK_DAOV(value)               (ISC_INTMASK_DAOV_Msk & (_UINT32_(value) << ISC_INTMASK_DAOV_Pos)) /* Assigment of value for DAOV in the ISC_INTMASK register */
#define ISC_INTMASK_VDTO_Pos                  _UINT32_(26)                                         /* (ISC_INTMASK) Vertical Synchronization Timeout Interrupt Mask Position */
#define ISC_INTMASK_VDTO_Msk                  (_UINT32_(0x1) << ISC_INTMASK_VDTO_Pos)              /* (ISC_INTMASK) Vertical Synchronization Timeout Interrupt Mask Mask */
#define ISC_INTMASK_VDTO(value)               (ISC_INTMASK_VDTO_Msk & (_UINT32_(value) << ISC_INTMASK_VDTO_Pos)) /* Assigment of value for VDTO in the ISC_INTMASK register */
#define ISC_INTMASK_HDTO_Pos                  _UINT32_(27)                                         /* (ISC_INTMASK) Horizontal Synchronization Timeout Interrupt Mask Position */
#define ISC_INTMASK_HDTO_Msk                  (_UINT32_(0x1) << ISC_INTMASK_HDTO_Pos)              /* (ISC_INTMASK) Horizontal Synchronization Timeout Interrupt Mask Mask */
#define ISC_INTMASK_HDTO(value)               (ISC_INTMASK_HDTO_Msk & (_UINT32_(value) << ISC_INTMASK_HDTO_Pos)) /* Assigment of value for HDTO in the ISC_INTMASK register */
#define ISC_INTMASK_CCIRERR_Pos               _UINT32_(28)                                         /* (ISC_INTMASK) CCIR Decoder Error Interrupt Mask Position */
#define ISC_INTMASK_CCIRERR_Msk               (_UINT32_(0x1) << ISC_INTMASK_CCIRERR_Pos)           /* (ISC_INTMASK) CCIR Decoder Error Interrupt Mask Mask */
#define ISC_INTMASK_CCIRERR(value)            (ISC_INTMASK_CCIRERR_Msk & (_UINT32_(value) << ISC_INTMASK_CCIRERR_Pos)) /* Assigment of value for CCIRERR in the ISC_INTMASK register */
#define ISC_INTMASK_Msk                       _UINT32_(0x1F113333)                                 /* (ISC_INTMASK) Register Mask  */


