Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/uart/uart_echo_interrupt/firmware/src/packs/ATSAMA5D29_DFP/component/isc.h
/* -------- ISC_INTSR : (ISC Offset: 0x34) ( R/ 32) Interrupt Status Register -------- */
#define ISC_INTSR_VD_Pos                      _UINT32_(0)                                          /* (ISC_INTSR) Vertical Synchronization Detected Interrupt Position */
#define ISC_INTSR_VD_Msk                      (_UINT32_(0x1) << ISC_INTSR_VD_Pos)                  /* (ISC_INTSR) Vertical Synchronization Detected Interrupt Mask */
#define ISC_INTSR_VD(value)                   (ISC_INTSR_VD_Msk & (_UINT32_(value) << ISC_INTSR_VD_Pos)) /* Assigment of value for VD in the ISC_INTSR register */
#define ISC_INTSR_HD_Pos                      _UINT32_(1)                                          /* (ISC_INTSR) Horizontal Synchronization Detected Interrupt Position */
#define ISC_INTSR_HD_Msk                      (_UINT32_(0x1) << ISC_INTSR_HD_Pos)                  /* (ISC_INTSR) Horizontal Synchronization Detected Interrupt Mask */
#define ISC_INTSR_HD(value)                   (ISC_INTSR_HD_Msk & (_UINT32_(value) << ISC_INTSR_HD_Pos)) /* Assigment of value for HD in the ISC_INTSR register */
#define ISC_INTSR_SWRST_Pos                   _UINT32_(4)                                          /* (ISC_INTSR) Software Reset Completed Interrupt Position */
#define ISC_INTSR_SWRST_Msk                   (_UINT32_(0x1) << ISC_INTSR_SWRST_Pos)               /* (ISC_INTSR) Software Reset Completed Interrupt Mask */
#define ISC_INTSR_SWRST(value)                (ISC_INTSR_SWRST_Msk & (_UINT32_(value) << ISC_INTSR_SWRST_Pos)) /* Assigment of value for SWRST in the ISC_INTSR register */
#define ISC_INTSR_DIS_Pos                     _UINT32_(5)                                          /* (ISC_INTSR) Disable Completed Interrupt Position */
#define ISC_INTSR_DIS_Msk                     (_UINT32_(0x1) << ISC_INTSR_DIS_Pos)                 /* (ISC_INTSR) Disable Completed Interrupt Mask */
#define ISC_INTSR_DIS(value)                  (ISC_INTSR_DIS_Msk & (_UINT32_(value) << ISC_INTSR_DIS_Pos)) /* Assigment of value for DIS in the ISC_INTSR register */
#define ISC_INTSR_DDONE_Pos                   _UINT32_(8)                                          /* (ISC_INTSR) DMA Done Interrupt Position */
#define ISC_INTSR_DDONE_Msk                   (_UINT32_(0x1) << ISC_INTSR_DDONE_Pos)               /* (ISC_INTSR) DMA Done Interrupt Mask */
#define ISC_INTSR_DDONE(value)                (ISC_INTSR_DDONE_Msk & (_UINT32_(value) << ISC_INTSR_DDONE_Pos)) /* Assigment of value for DDONE in the ISC_INTSR register */
#define ISC_INTSR_LDONE_Pos                   _UINT32_(9)                                          /* (ISC_INTSR) DMA List Done Interrupt Position */
#define ISC_INTSR_LDONE_Msk                   (_UINT32_(0x1) << ISC_INTSR_LDONE_Pos)               /* (ISC_INTSR) DMA List Done Interrupt Mask */
#define ISC_INTSR_LDONE(value)                (ISC_INTSR_LDONE_Msk & (_UINT32_(value) << ISC_INTSR_LDONE_Pos)) /* Assigment of value for LDONE in the ISC_INTSR register */
#define ISC_INTSR_HISDONE_Pos                 _UINT32_(12)                                         /* (ISC_INTSR) Histogram Completed Interrupt Position */
#define ISC_INTSR_HISDONE_Msk                 (_UINT32_(0x1) << ISC_INTSR_HISDONE_Pos)             /* (ISC_INTSR) Histogram Completed Interrupt Mask */
#define ISC_INTSR_HISDONE(value)              (ISC_INTSR_HISDONE_Msk & (_UINT32_(value) << ISC_INTSR_HISDONE_Pos)) /* Assigment of value for HISDONE in the ISC_INTSR register */
#define ISC_INTSR_HISCLR_Pos                  _UINT32_(13)                                         /* (ISC_INTSR) Histogram Clear Interrupt Position */
#define ISC_INTSR_HISCLR_Msk                  (_UINT32_(0x1) << ISC_INTSR_HISCLR_Pos)              /* (ISC_INTSR) Histogram Clear Interrupt Mask */
#define ISC_INTSR_HISCLR(value)               (ISC_INTSR_HISCLR_Msk & (_UINT32_(value) << ISC_INTSR_HISCLR_Pos)) /* Assigment of value for HISCLR in the ISC_INTSR register */
#define ISC_INTSR_WERR_Pos                    _UINT32_(16)                                         /* (ISC_INTSR) Write Channel Error Interrupt Position */
#define ISC_INTSR_WERR_Msk                    (_UINT32_(0x1) << ISC_INTSR_WERR_Pos)                /* (ISC_INTSR) Write Channel Error Interrupt Mask */
#define ISC_INTSR_WERR(value)                 (ISC_INTSR_WERR_Msk & (_UINT32_(value) << ISC_INTSR_WERR_Pos)) /* Assigment of value for WERR in the ISC_INTSR register */
#define ISC_INTSR_WERRID_Pos                  _UINT32_(17)                                         /* (ISC_INTSR) Write Channel Error Identifier Position */
#define ISC_INTSR_WERRID_Msk                  (_UINT32_(0x3) << ISC_INTSR_WERRID_Pos)              /* (ISC_INTSR) Write Channel Error Identifier Mask */
#define ISC_INTSR_WERRID(value)               (ISC_INTSR_WERRID_Msk & (_UINT32_(value) << ISC_INTSR_WERRID_Pos)) /* Assigment of value for WERRID in the ISC_INTSR register */
#define   ISC_INTSR_WERRID_CH0_Val            _UINT32_(0x0)                                        /* (ISC_INTSR) An error occurred for Channel 0 (RAW/RGB/Y)  */
#define   ISC_INTSR_WERRID_CH1_Val            _UINT32_(0x1)                                        /* (ISC_INTSR) An error occurred for Channel 1 (CbCr/Cb)  */
#define   ISC_INTSR_WERRID_CH2_Val            _UINT32_(0x2)                                        /* (ISC_INTSR) An error occurred for Channel 2 (Cr)  */
#define   ISC_INTSR_WERRID_WB_Val             _UINT32_(0x3)                                        /* (ISC_INTSR) Write back channel error  */
#define ISC_INTSR_WERRID_CH0                  (ISC_INTSR_WERRID_CH0_Val << ISC_INTSR_WERRID_Pos)   /* (ISC_INTSR) An error occurred for Channel 0 (RAW/RGB/Y) Position  */
#define ISC_INTSR_WERRID_CH1                  (ISC_INTSR_WERRID_CH1_Val << ISC_INTSR_WERRID_Pos)   /* (ISC_INTSR) An error occurred for Channel 1 (CbCr/Cb) Position  */
#define ISC_INTSR_WERRID_CH2                  (ISC_INTSR_WERRID_CH2_Val << ISC_INTSR_WERRID_Pos)   /* (ISC_INTSR) An error occurred for Channel 2 (Cr) Position  */
#define ISC_INTSR_WERRID_WB                   (ISC_INTSR_WERRID_WB_Val << ISC_INTSR_WERRID_Pos)    /* (ISC_INTSR) Write back channel error Position  */
#define ISC_INTSR_RERR_Pos                    _UINT32_(20)                                         /* (ISC_INTSR) Read Channel Error Interrupt Position */
#define ISC_INTSR_RERR_Msk                    (_UINT32_(0x1) << ISC_INTSR_RERR_Pos)                /* (ISC_INTSR) Read Channel Error Interrupt Mask */
#define ISC_INTSR_RERR(value)                 (ISC_INTSR_RERR_Msk & (_UINT32_(value) << ISC_INTSR_RERR_Pos)) /* Assigment of value for RERR in the ISC_INTSR register */
#define ISC_INTSR_VFPOV_Pos                   _UINT32_(24)                                         /* (ISC_INTSR) Vertical Front Porch Overflow Interrupt Position */
#define ISC_INTSR_VFPOV_Msk                   (_UINT32_(0x1) << ISC_INTSR_VFPOV_Pos)               /* (ISC_INTSR) Vertical Front Porch Overflow Interrupt Mask */
#define ISC_INTSR_VFPOV(value)                (ISC_INTSR_VFPOV_Msk & (_UINT32_(value) << ISC_INTSR_VFPOV_Pos)) /* Assigment of value for VFPOV in the ISC_INTSR register */
#define ISC_INTSR_DAOV_Pos                    _UINT32_(25)                                         /* (ISC_INTSR) Data Overflow Interrupt Position */
#define ISC_INTSR_DAOV_Msk                    (_UINT32_(0x1) << ISC_INTSR_DAOV_Pos)                /* (ISC_INTSR) Data Overflow Interrupt Mask */
#define ISC_INTSR_DAOV(value)                 (ISC_INTSR_DAOV_Msk & (_UINT32_(value) << ISC_INTSR_DAOV_Pos)) /* Assigment of value for DAOV in the ISC_INTSR register */
#define ISC_INTSR_VDTO_Pos                    _UINT32_(26)                                         /* (ISC_INTSR) Vertical Synchronization Timeout Interrupt Position */
#define ISC_INTSR_VDTO_Msk                    (_UINT32_(0x1) << ISC_INTSR_VDTO_Pos)                /* (ISC_INTSR) Vertical Synchronization Timeout Interrupt Mask */
#define ISC_INTSR_VDTO(value)                 (ISC_INTSR_VDTO_Msk & (_UINT32_(value) << ISC_INTSR_VDTO_Pos)) /* Assigment of value for VDTO in the ISC_INTSR register */
#define ISC_INTSR_HDTO_Pos                    _UINT32_(27)                                         /* (ISC_INTSR) Horizontal Synchronization Timeout Interrupt Position */
#define ISC_INTSR_HDTO_Msk                    (_UINT32_(0x1) << ISC_INTSR_HDTO_Pos)                /* (ISC_INTSR) Horizontal Synchronization Timeout Interrupt Mask */
#define ISC_INTSR_HDTO(value)                 (ISC_INTSR_HDTO_Msk & (_UINT32_(value) << ISC_INTSR_HDTO_Pos)) /* Assigment of value for HDTO in the ISC_INTSR register */
#define ISC_INTSR_CCIRERR_Pos                 _UINT32_(28)                                         /* (ISC_INTSR) CCIR Decoder Error Interrupt Position */
#define ISC_INTSR_CCIRERR_Msk                 (_UINT32_(0x1) << ISC_INTSR_CCIRERR_Pos)             /* (ISC_INTSR) CCIR Decoder Error Interrupt Mask */
#define ISC_INTSR_CCIRERR(value)              (ISC_INTSR_CCIRERR_Msk & (_UINT32_(value) << ISC_INTSR_CCIRERR_Pos)) /* Assigment of value for CCIRERR in the ISC_INTSR register */
#define ISC_INTSR_Msk                         _UINT32_(0x1F173333)                                 /* (ISC_INTSR) Register Mask  */


/* -------- ISC_PFE_CFG0 : (ISC Offset: 0x0C) (R/W 32) Parallel Front End Configuration 0 Register -------- */
#define ISC_PFE_CFG0_HPOL_Pos                 _UINT32_(0)                                          /* (ISC_PFE_CFG0) Horizontal Synchronization Polarity Position */
#define ISC_PFE_CFG0_HPOL_Msk                 (_UINT32_(0x1) << ISC_PFE_CFG0_HPOL_Pos)             /* (ISC_PFE_CFG0) Horizontal Synchronization Polarity Mask */
#define ISC_PFE_CFG0_HPOL(value)              (ISC_PFE_CFG0_HPOL_Msk & (_UINT32_(value) << ISC_PFE_CFG0_HPOL_Pos)) /* Assigment of value for HPOL in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_VPOL_Pos                 _UINT32_(1)                                          /* (ISC_PFE_CFG0) Vertical Synchronization Polarity Position */
#define ISC_PFE_CFG0_VPOL_Msk                 (_UINT32_(0x1) << ISC_PFE_CFG0_VPOL_Pos)             /* (ISC_PFE_CFG0) Vertical Synchronization Polarity Mask */
#define ISC_PFE_CFG0_VPOL(value)              (ISC_PFE_CFG0_VPOL_Msk & (_UINT32_(value) << ISC_PFE_CFG0_VPOL_Pos)) /* Assigment of value for VPOL in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_PPOL_Pos                 _UINT32_(2)                                          /* (ISC_PFE_CFG0) Pixel Clock Polarity Position */
#define ISC_PFE_CFG0_PPOL_Msk                 (_UINT32_(0x1) << ISC_PFE_CFG0_PPOL_Pos)             /* (ISC_PFE_CFG0) Pixel Clock Polarity Mask */
#define ISC_PFE_CFG0_PPOL(value)              (ISC_PFE_CFG0_PPOL_Msk & (_UINT32_(value) << ISC_PFE_CFG0_PPOL_Pos)) /* Assigment of value for PPOL in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_FPOL_Pos                 _UINT32_(3)                                          /* (ISC_PFE_CFG0) Field Polarity Position */
#define ISC_PFE_CFG0_FPOL_Msk                 (_UINT32_(0x1) << ISC_PFE_CFG0_FPOL_Pos)             /* (ISC_PFE_CFG0) Field Polarity Mask */
#define ISC_PFE_CFG0_FPOL(value)              (ISC_PFE_CFG0_FPOL_Msk & (_UINT32_(value) << ISC_PFE_CFG0_FPOL_Pos)) /* Assigment of value for FPOL in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_MODE_Pos                 _UINT32_(4)                                          /* (ISC_PFE_CFG0) Parallel Front End Mode Position */
#define ISC_PFE_CFG0_MODE_Msk                 (_UINT32_(0x7) << ISC_PFE_CFG0_MODE_Pos)             /* (ISC_PFE_CFG0) Parallel Front End Mode Mask */
#define ISC_PFE_CFG0_MODE(value)              (ISC_PFE_CFG0_MODE_Msk & (_UINT32_(value) << ISC_PFE_CFG0_MODE_Pos)) /* Assigment of value for MODE in the ISC_PFE_CFG0 register */
#define   ISC_PFE_CFG0_MODE_PROGRESSIVE_Val   _UINT32_(0x0)                                        /* (ISC_PFE_CFG0) Video source is progressive.  */
#define   ISC_PFE_CFG0_MODE_DF_TOP_Val        _UINT32_(0x1)                                        /* (ISC_PFE_CFG0) Video source is interlaced, two fields are captured starting with top field.  */
#define   ISC_PFE_CFG0_MODE_DF_BOTTOM_Val     _UINT32_(0x2)                                        /* (ISC_PFE_CFG0) Video source is interlaced, two fields are captured starting with bottom field.  */
#define   ISC_PFE_CFG0_MODE_DF_IMMEDIATE_Val  _UINT32_(0x3)                                        /* (ISC_PFE_CFG0) Video source is interlaced, two fields are captured immediately.  */
#define   ISC_PFE_CFG0_MODE_SF_TOP_Val        _UINT32_(0x4)                                        /* (ISC_PFE_CFG0) Video source is interlaced, one field is captured starting with the top field.  */
#define   ISC_PFE_CFG0_MODE_SF_BOTTOM_Val     _UINT32_(0x5)                                        /* (ISC_PFE_CFG0) Video source is interlaced, one field is captured starting with the bottom field.  */
#define   ISC_PFE_CFG0_MODE_SF_IMMEDIATE_Val  _UINT32_(0x6)                                        /* (ISC_PFE_CFG0) Video source is interlaced, one field is captured starting immediately.  */
#define ISC_PFE_CFG0_MODE_PROGRESSIVE         (ISC_PFE_CFG0_MODE_PROGRESSIVE_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is progressive. Position  */
#define ISC_PFE_CFG0_MODE_DF_TOP              (ISC_PFE_CFG0_MODE_DF_TOP_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is interlaced, two fields are captured starting with top field. Position  */
#define ISC_PFE_CFG0_MODE_DF_BOTTOM           (ISC_PFE_CFG0_MODE_DF_BOTTOM_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is interlaced, two fields are captured starting with bottom field. Position  */
#define ISC_PFE_CFG0_MODE_DF_IMMEDIATE        (ISC_PFE_CFG0_MODE_DF_IMMEDIATE_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is interlaced, two fields are captured immediately. Position  */
#define ISC_PFE_CFG0_MODE_SF_TOP              (ISC_PFE_CFG0_MODE_SF_TOP_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is interlaced, one field is captured starting with the top field. Position  */
#define ISC_PFE_CFG0_MODE_SF_BOTTOM           (ISC_PFE_CFG0_MODE_SF_BOTTOM_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is interlaced, one field is captured starting with the bottom field. Position  */
#define ISC_PFE_CFG0_MODE_SF_IMMEDIATE        (ISC_PFE_CFG0_MODE_SF_IMMEDIATE_Val << ISC_PFE_CFG0_MODE_Pos) /* (ISC_PFE_CFG0) Video source is interlaced, one field is captured starting immediately. Position  */
#define ISC_PFE_CFG0_CONT_Pos                 _UINT32_(7)                                          /* (ISC_PFE_CFG0) Continuous Acquisition Position */
#define ISC_PFE_CFG0_CONT_Msk                 (_UINT32_(0x1) << ISC_PFE_CFG0_CONT_Pos)             /* (ISC_PFE_CFG0) Continuous Acquisition Mask */
#define ISC_PFE_CFG0_CONT(value)              (ISC_PFE_CFG0_CONT_Msk & (_UINT32_(value) << ISC_PFE_CFG0_CONT_Pos)) /* Assigment of value for CONT in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_GATED_Pos                _UINT32_(8)                                          /* (ISC_PFE_CFG0) Gated input clock Position */
#define ISC_PFE_CFG0_GATED_Msk                (_UINT32_(0x1) << ISC_PFE_CFG0_GATED_Pos)            /* (ISC_PFE_CFG0) Gated input clock Mask */
#define ISC_PFE_CFG0_GATED(value)             (ISC_PFE_CFG0_GATED_Msk & (_UINT32_(value) << ISC_PFE_CFG0_GATED_Pos)) /* Assigment of value for GATED in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_CCIR656_Pos              _UINT32_(9)                                          /* (ISC_PFE_CFG0) CCIR656 input mode Position */
#define ISC_PFE_CFG0_CCIR656_Msk              (_UINT32_(0x1) << ISC_PFE_CFG0_CCIR656_Pos)          /* (ISC_PFE_CFG0) CCIR656 input mode Mask */
#define ISC_PFE_CFG0_CCIR656(value)           (ISC_PFE_CFG0_CCIR656_Msk & (_UINT32_(value) << ISC_PFE_CFG0_CCIR656_Pos)) /* Assigment of value for CCIR656 in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_CCIR_CRC_Pos             _UINT32_(10)                                         /* (ISC_PFE_CFG0) CCIR656 CRC Decoder Position */
#define ISC_PFE_CFG0_CCIR_CRC_Msk             (_UINT32_(0x1) << ISC_PFE_CFG0_CCIR_CRC_Pos)         /* (ISC_PFE_CFG0) CCIR656 CRC Decoder Mask */
#define ISC_PFE_CFG0_CCIR_CRC(value)          (ISC_PFE_CFG0_CCIR_CRC_Msk & (_UINT32_(value) << ISC_PFE_CFG0_CCIR_CRC_Pos)) /* Assigment of value for CCIR_CRC in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_CCIR10_8N_Pos            _UINT32_(11)                                         /* (ISC_PFE_CFG0) CCIR 10 bits or 8 bits Position */
#define ISC_PFE_CFG0_CCIR10_8N_Msk            (_UINT32_(0x1) << ISC_PFE_CFG0_CCIR10_8N_Pos)        /* (ISC_PFE_CFG0) CCIR 10 bits or 8 bits Mask */
#define ISC_PFE_CFG0_CCIR10_8N(value)         (ISC_PFE_CFG0_CCIR10_8N_Msk & (_UINT32_(value) << ISC_PFE_CFG0_CCIR10_8N_Pos)) /* Assigment of value for CCIR10_8N in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_COLEN_Pos                _UINT32_(12)                                         /* (ISC_PFE_CFG0) Column Cropping Enable Position */
#define ISC_PFE_CFG0_COLEN_Msk                (_UINT32_(0x1) << ISC_PFE_CFG0_COLEN_Pos)            /* (ISC_PFE_CFG0) Column Cropping Enable Mask */
#define ISC_PFE_CFG0_COLEN(value)             (ISC_PFE_CFG0_COLEN_Msk & (_UINT32_(value) << ISC_PFE_CFG0_COLEN_Pos)) /* Assigment of value for COLEN in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_ROWEN_Pos                _UINT32_(13)                                         /* (ISC_PFE_CFG0) Row Cropping Enable Position */
#define ISC_PFE_CFG0_ROWEN_Msk                (_UINT32_(0x1) << ISC_PFE_CFG0_ROWEN_Pos)            /* (ISC_PFE_CFG0) Row Cropping Enable Mask */
#define ISC_PFE_CFG0_ROWEN(value)             (ISC_PFE_CFG0_ROWEN_Msk & (_UINT32_(value) << ISC_PFE_CFG0_ROWEN_Pos)) /* Assigment of value for ROWEN in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_SKIPCNT_Pos              _UINT32_(16)                                         /* (ISC_PFE_CFG0) Frame Skipping Counter Position */
#define ISC_PFE_CFG0_SKIPCNT_Msk              (_UINT32_(0xFF) << ISC_PFE_CFG0_SKIPCNT_Pos)         /* (ISC_PFE_CFG0) Frame Skipping Counter Mask */
#define ISC_PFE_CFG0_SKIPCNT(value)           (ISC_PFE_CFG0_SKIPCNT_Msk & (_UINT32_(value) << ISC_PFE_CFG0_SKIPCNT_Pos)) /* Assigment of value for SKIPCNT in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_CCIR_REP_Pos             _UINT32_(27)                                         /* (ISC_PFE_CFG0) CCIR Replication Position */
#define ISC_PFE_CFG0_CCIR_REP_Msk             (_UINT32_(0x1) << ISC_PFE_CFG0_CCIR_REP_Pos)         /* (ISC_PFE_CFG0) CCIR Replication Mask */
#define ISC_PFE_CFG0_CCIR_REP(value)          (ISC_PFE_CFG0_CCIR_REP_Msk & (_UINT32_(value) << ISC_PFE_CFG0_CCIR_REP_Pos)) /* Assigment of value for CCIR_REP in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_BPS_Pos                  _UINT32_(28)                                         /* (ISC_PFE_CFG0) Bits Per Sample Position */
#define ISC_PFE_CFG0_BPS_Msk                  (_UINT32_(0x7) << ISC_PFE_CFG0_BPS_Pos)              /* (ISC_PFE_CFG0) Bits Per Sample Mask */
#define ISC_PFE_CFG0_BPS(value)               (ISC_PFE_CFG0_BPS_Msk & (_UINT32_(value) << ISC_PFE_CFG0_BPS_Pos)) /* Assigment of value for BPS in the ISC_PFE_CFG0 register */
#define   ISC_PFE_CFG0_BPS_TWELVE_Val         _UINT32_(0x0)                                        /* (ISC_PFE_CFG0) 12-bit input  */
#define   ISC_PFE_CFG0_BPS_ELEVEN_Val         _UINT32_(0x1)                                        /* (ISC_PFE_CFG0) 11-bit input  */
#define   ISC_PFE_CFG0_BPS_TEN_Val            _UINT32_(0x2)                                        /* (ISC_PFE_CFG0) 10-bit input  */
#define   ISC_PFE_CFG0_BPS_NINE_Val           _UINT32_(0x3)                                        /* (ISC_PFE_CFG0) 9-bit input  */
#define   ISC_PFE_CFG0_BPS_EIGHT_Val          _UINT32_(0x4)                                        /* (ISC_PFE_CFG0) 8-bit input  */
#define ISC_PFE_CFG0_BPS_TWELVE               (ISC_PFE_CFG0_BPS_TWELVE_Val << ISC_PFE_CFG0_BPS_Pos) /* (ISC_PFE_CFG0) 12-bit input Position  */
#define ISC_PFE_CFG0_BPS_ELEVEN               (ISC_PFE_CFG0_BPS_ELEVEN_Val << ISC_PFE_CFG0_BPS_Pos) /* (ISC_PFE_CFG0) 11-bit input Position  */
#define ISC_PFE_CFG0_BPS_TEN                  (ISC_PFE_CFG0_BPS_TEN_Val << ISC_PFE_CFG0_BPS_Pos)   /* (ISC_PFE_CFG0) 10-bit input Position  */
#define ISC_PFE_CFG0_BPS_NINE                 (ISC_PFE_CFG0_BPS_NINE_Val << ISC_PFE_CFG0_BPS_Pos)  /* (ISC_PFE_CFG0) 9-bit input Position  */
#define ISC_PFE_CFG0_BPS_EIGHT                (ISC_PFE_CFG0_BPS_EIGHT_Val << ISC_PFE_CFG0_BPS_Pos) /* (ISC_PFE_CFG0) 8-bit input Position  */
#define ISC_PFE_CFG0_REP_Pos                  _UINT32_(31)                                         /* (ISC_PFE_CFG0) Up Multiply with Replication Position */
#define ISC_PFE_CFG0_REP_Msk                  (_UINT32_(0x1) << ISC_PFE_CFG0_REP_Pos)              /* (ISC_PFE_CFG0) Up Multiply with Replication Mask */
#define ISC_PFE_CFG0_REP(value)               (ISC_PFE_CFG0_REP_Msk & (_UINT32_(value) << ISC_PFE_CFG0_REP_Pos)) /* Assigment of value for REP in the ISC_PFE_CFG0 register */
#define ISC_PFE_CFG0_Msk                      _UINT32_(0xF8FF3FFF)                                 /* (ISC_PFE_CFG0) Register Mask  */

#define ISC_PFE_CFG0_CCIR_Pos                 _UINT32_(9)                                          /* (ISC_PFE_CFG0 Position) CCIR656 input mode */
#define ISC_PFE_CFG0_CCIR_Msk                 (_UINT32_(0x1) << ISC_PFE_CFG0_CCIR_Pos)             /* (ISC_PFE_CFG0 Mask) CCIR */
#define ISC_PFE_CFG0_CCIR(value)              (ISC_PFE_CFG0_CCIR_Msk & (_UINT32_(value) << ISC_PFE_CFG0_CCIR_Pos)) 

/* -------- ISC_PFE_CFG1 : (ISC Offset: 0x10) (R/W 32) Parallel Front End Configuration 1 Register -------- */
#define ISC_PFE_CFG1_COLMIN_Pos               _UINT32_(0)                                          /* (ISC_PFE_CFG1) Column Minimum Limit Position */
#define ISC_PFE_CFG1_COLMIN_Msk               (_UINT32_(0xFFFF) << ISC_PFE_CFG1_COLMIN_Pos)        /* (ISC_PFE_CFG1) Column Minimum Limit Mask */
#define ISC_PFE_CFG1_COLMIN(value)            (ISC_PFE_CFG1_COLMIN_Msk & (_UINT32_(value) << ISC_PFE_CFG1_COLMIN_Pos)) /* Assigment of value for COLMIN in the ISC_PFE_CFG1 register */
#define ISC_PFE_CFG1_COLMAX_Pos               _UINT32_(16)                                         /* (ISC_PFE_CFG1) Column Maximum Limit Position */
#define ISC_PFE_CFG1_COLMAX_Msk               (_UINT32_(0xFFFF) << ISC_PFE_CFG1_COLMAX_Pos)        /* (ISC_PFE_CFG1) Column Maximum Limit Mask */
#define ISC_PFE_CFG1_COLMAX(value)            (ISC_PFE_CFG1_COLMAX_Msk & (_UINT32_(value) << ISC_PFE_CFG1_COLMAX_Pos)) /* Assigment of value for COLMAX in the ISC_PFE_CFG1 register */
#define ISC_PFE_CFG1_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (ISC_PFE_CFG1) Register Mask  */


