Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/uart/uart_echo_interrupt/firmware/src/packs/ATSAMA5D29_DFP/component/isc.h
/* -------- ISC_SUB422_CTRL : (ISC Offset: 0x3C4) (R/W 32) Subsampling 4:4:4 to 4:2:2 Control Register -------- */
#define ISC_SUB422_CTRL_ENABLE_Pos            _UINT32_(0)                                          /* (ISC_SUB422_CTRL) 4:4:4 to 4:2:2 Chrominance Horizontal Subsampling Filter Enable Position */
#define ISC_SUB422_CTRL_ENABLE_Msk            (_UINT32_(0x1) << ISC_SUB422_CTRL_ENABLE_Pos)        /* (ISC_SUB422_CTRL) 4:4:4 to 4:2:2 Chrominance Horizontal Subsampling Filter Enable Mask */
#define ISC_SUB422_CTRL_ENABLE(value)         (ISC_SUB422_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_SUB422_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_SUB422_CTRL register */
#define ISC_SUB422_CTRL_Msk                   _UINT32_(0x00000001)                                 /* (ISC_SUB422_CTRL) Register Mask  */


/* -------- ISC_WB_CFG : (ISC Offset: 0x5C) (R/W 32) White Balance Configuration Register -------- */
#define ISC_WB_CFG_BAYCFG_Pos                 _UINT32_(0)                                          /* (ISC_WB_CFG) White Balance Bayer Configuration (Pixel Color Pattern) Position */
#define ISC_WB_CFG_BAYCFG_Msk                 (_UINT32_(0x3) << ISC_WB_CFG_BAYCFG_Pos)             /* (ISC_WB_CFG) White Balance Bayer Configuration (Pixel Color Pattern) Mask */
#define ISC_WB_CFG_BAYCFG(value)              (ISC_WB_CFG_BAYCFG_Msk & (_UINT32_(value) << ISC_WB_CFG_BAYCFG_Pos)) /* Assigment of value for BAYCFG in the ISC_WB_CFG register */
#define   ISC_WB_CFG_BAYCFG_GRGR_Val          _UINT32_(0x0)                                        /* (ISC_WB_CFG) Starting Row configuration is G R G R (Red Row)  */
#define   ISC_WB_CFG_BAYCFG_RGRG_Val          _UINT32_(0x1)                                        /* (ISC_WB_CFG) Starting Row configuration is R G R G (Red Row)  */
#define   ISC_WB_CFG_BAYCFG_GBGB_Val          _UINT32_(0x2)                                        /* (ISC_WB_CFG) Starting Row configuration is G B G B (Blue Row)  */
#define   ISC_WB_CFG_BAYCFG_BGBG_Val          _UINT32_(0x3)                                        /* (ISC_WB_CFG) Starting Row configuration is B G B G (Blue Row)  */
#define ISC_WB_CFG_BAYCFG_GRGR                (ISC_WB_CFG_BAYCFG_GRGR_Val << ISC_WB_CFG_BAYCFG_Pos) /* (ISC_WB_CFG) Starting Row configuration is G R G R (Red Row) Position  */
#define ISC_WB_CFG_BAYCFG_RGRG                (ISC_WB_CFG_BAYCFG_RGRG_Val << ISC_WB_CFG_BAYCFG_Pos) /* (ISC_WB_CFG) Starting Row configuration is R G R G (Red Row) Position  */
#define ISC_WB_CFG_BAYCFG_GBGB                (ISC_WB_CFG_BAYCFG_GBGB_Val << ISC_WB_CFG_BAYCFG_Pos) /* (ISC_WB_CFG) Starting Row configuration is G B G B (Blue Row) Position  */
#define ISC_WB_CFG_BAYCFG_BGBG                (ISC_WB_CFG_BAYCFG_BGBG_Val << ISC_WB_CFG_BAYCFG_Pos) /* (ISC_WB_CFG) Starting Row configuration is B G B G (Blue Row) Position  */
#define ISC_WB_CFG_Msk                        _UINT32_(0x00000003)                                 /* (ISC_WB_CFG) Register Mask  */


/* -------- ISC_WB_CTRL : (ISC Offset: 0x58) (R/W 32) White Balance Control Register -------- */
#define ISC_WB_CTRL_ENABLE_Pos                _UINT32_(0)                                          /* (ISC_WB_CTRL) White Balance Enable Position */
#define ISC_WB_CTRL_ENABLE_Msk                (_UINT32_(0x1) << ISC_WB_CTRL_ENABLE_Pos)            /* (ISC_WB_CTRL) White Balance Enable Mask */
#define ISC_WB_CTRL_ENABLE(value)             (ISC_WB_CTRL_ENABLE_Msk & (_UINT32_(value) << ISC_WB_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISC_WB_CTRL register */
#define ISC_WB_CTRL_Msk                       _UINT32_(0x00000001)                                 /* (ISC_WB_CTRL) Register Mask  */


/* -------- ISC_WB_G_BGB : (ISC Offset: 0x6C) (R/W 32) White Balance Gain for B, GB Register -------- */
#define ISC_WB_G_BGB_BGAIN_Pos                _UINT32_(0)                                          /* (ISC_WB_G_BGB) Blue Component Gain (unsigned 13 bits, 0:4:9) Position */
#define ISC_WB_G_BGB_BGAIN_Msk                (_UINT32_(0x1FFF) << ISC_WB_G_BGB_BGAIN_Pos)         /* (ISC_WB_G_BGB) Blue Component Gain (unsigned 13 bits, 0:4:9) Mask */
#define ISC_WB_G_BGB_BGAIN(value)             (ISC_WB_G_BGB_BGAIN_Msk & (_UINT32_(value) << ISC_WB_G_BGB_BGAIN_Pos)) /* Assigment of value for BGAIN in the ISC_WB_G_BGB register */
#define ISC_WB_G_BGB_GBGAIN_Pos               _UINT32_(16)                                         /* (ISC_WB_G_BGB) Green Component (Blue row) Gain (unsigned 13 bits, 0:4:9) Position */
#define ISC_WB_G_BGB_GBGAIN_Msk               (_UINT32_(0x1FFF) << ISC_WB_G_BGB_GBGAIN_Pos)        /* (ISC_WB_G_BGB) Green Component (Blue row) Gain (unsigned 13 bits, 0:4:9) Mask */
#define ISC_WB_G_BGB_GBGAIN(value)            (ISC_WB_G_BGB_GBGAIN_Msk & (_UINT32_(value) << ISC_WB_G_BGB_GBGAIN_Pos)) /* Assigment of value for GBGAIN in the ISC_WB_G_BGB register */
#define ISC_WB_G_BGB_Msk                      _UINT32_(0x1FFF1FFF)                                 /* (ISC_WB_G_BGB) Register Mask  */


/* -------- ISC_WB_G_RGR : (ISC Offset: 0x68) (R/W 32) White Balance Gain for R, GR Register -------- */
#define ISC_WB_G_RGR_RGAIN_Pos                _UINT32_(0)                                          /* (ISC_WB_G_RGR) Red Component Gain (unsigned 13 bits, 0:4:9) Position */
#define ISC_WB_G_RGR_RGAIN_Msk                (_UINT32_(0x1FFF) << ISC_WB_G_RGR_RGAIN_Pos)         /* (ISC_WB_G_RGR) Red Component Gain (unsigned 13 bits, 0:4:9) Mask */
#define ISC_WB_G_RGR_RGAIN(value)             (ISC_WB_G_RGR_RGAIN_Msk & (_UINT32_(value) << ISC_WB_G_RGR_RGAIN_Pos)) /* Assigment of value for RGAIN in the ISC_WB_G_RGR register */
#define ISC_WB_G_RGR_GRGAIN_Pos               _UINT32_(16)                                         /* (ISC_WB_G_RGR) Green Component (Red row) Gain (unsigned 13 bits, 0:4:9) Position */
#define ISC_WB_G_RGR_GRGAIN_Msk               (_UINT32_(0x1FFF) << ISC_WB_G_RGR_GRGAIN_Pos)        /* (ISC_WB_G_RGR) Green Component (Red row) Gain (unsigned 13 bits, 0:4:9) Mask */
#define ISC_WB_G_RGR_GRGAIN(value)            (ISC_WB_G_RGR_GRGAIN_Msk & (_UINT32_(value) << ISC_WB_G_RGR_GRGAIN_Pos)) /* Assigment of value for GRGAIN in the ISC_WB_G_RGR register */
#define ISC_WB_G_RGR_Msk                      _UINT32_(0x1FFF1FFF)                                 /* (ISC_WB_G_RGR) Register Mask  */


