Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/uart/uart_echo_interrupt/firmware/src/packs/ATSAMA5D29_DFP/component/isc.h
#define ISC_HIS_ENTRY167_REG_OFST      _UINT32_(0x6AC)     /* (ISC_HIS_ENTRY167) Histogram Entry Offset */
#define ISC_HIS_ENTRY168_REG_OFST      _UINT32_(0x6B0)     /* (ISC_HIS_ENTRY168) Histogram Entry Offset */
#define ISC_HIS_ENTRY169_REG_OFST      _UINT32_(0x6B4)     /* (ISC_HIS_ENTRY169) Histogram Entry Offset */
#define ISC_HIS_ENTRY170_REG_OFST      _UINT32_(0x6B8)     /* (ISC_HIS_ENTRY170) Histogram Entry Offset */
#define ISC_HIS_ENTRY171_REG_OFST      _UINT32_(0x6BC)     /* (ISC_HIS_ENTRY171) Histogram Entry Offset */
#define ISC_HIS_ENTRY172_REG_OFST      _UINT32_(0x6C0)     /* (ISC_HIS_ENTRY172) Histogram Entry Offset */
#define ISC_HIS_ENTRY173_REG_OFST      _UINT32_(0x6C4)     /* (ISC_HIS_ENTRY173) Histogram Entry Offset */
#define ISC_HIS_ENTRY174_REG_OFST      _UINT32_(0x6C8)     /* (ISC_HIS_ENTRY174) Histogram Entry Offset */
#define ISC_HIS_ENTRY175_REG_OFST      _UINT32_(0x6CC)     /* (ISC_HIS_ENTRY175) Histogram Entry Offset */
#define ISC_HIS_ENTRY176_REG_OFST      _UINT32_(0x6D0)     /* (ISC_HIS_ENTRY176) Histogram Entry Offset */
#define ISC_HIS_ENTRY177_REG_OFST      _UINT32_(0x6D4)     /* (ISC_HIS_ENTRY177) Histogram Entry Offset */
#define ISC_HIS_ENTRY178_REG_OFST      _UINT32_(0x6D8)     /* (ISC_HIS_ENTRY178) Histogram Entry Offset */
#define ISC_HIS_ENTRY179_REG_OFST      _UINT32_(0x6DC)     /* (ISC_HIS_ENTRY179) Histogram Entry Offset */
#define ISC_HIS_ENTRY180_REG_OFST      _UINT32_(0x6E0)     /* (ISC_HIS_ENTRY180) Histogram Entry Offset */
#define ISC_HIS_ENTRY181_REG_OFST      _UINT32_(0x6E4)     /* (ISC_HIS_ENTRY181) Histogram Entry Offset */
#define ISC_HIS_ENTRY182_REG_OFST      _UINT32_(0x6E8)     /* (ISC_HIS_ENTRY182) Histogram Entry Offset */
#define ISC_HIS_ENTRY183_REG_OFST      _UINT32_(0x6EC)     /* (ISC_HIS_ENTRY183) Histogram Entry Offset */
#define ISC_HIS_ENTRY184_REG_OFST      _UINT32_(0x6F0)     /* (ISC_HIS_ENTRY184) Histogram Entry Offset */
#define ISC_HIS_ENTRY185_REG_OFST      _UINT32_(0x6F4)     /* (ISC_HIS_ENTRY185) Histogram Entry Offset */
#define ISC_HIS_ENTRY186_REG_OFST      _UINT32_(0x6F8)     /* (ISC_HIS_ENTRY186) Histogram Entry Offset */
#define ISC_HIS_ENTRY187_REG_OFST      _UINT32_(0x6FC)     /* (ISC_HIS_ENTRY187) Histogram Entry Offset */
#define ISC_HIS_ENTRY188_REG_OFST      _UINT32_(0x700)     /* (ISC_HIS_ENTRY188) Histogram Entry Offset */
#define ISC_HIS_ENTRY189_REG_OFST      _UINT32_(0x704)     /* (ISC_HIS_ENTRY189) Histogram Entry Offset */
#define ISC_HIS_ENTRY190_REG_OFST      _UINT32_(0x708)     /* (ISC_HIS_ENTRY190) Histogram Entry Offset */
#define ISC_HIS_ENTRY191_REG_OFST      _UINT32_(0x70C)     /* (ISC_HIS_ENTRY191) Histogram Entry Offset */
#define ISC_HIS_ENTRY192_REG_OFST      _UINT32_(0x710)     /* (ISC_HIS_ENTRY192) Histogram Entry Offset */
#define ISC_HIS_ENTRY193_REG_OFST      _UINT32_(0x714)     /* (ISC_HIS_ENTRY193) Histogram Entry Offset */
#define ISC_HIS_ENTRY194_REG_OFST      _UINT32_(0x718)     /* (ISC_HIS_ENTRY194) Histogram Entry Offset */
#define ISC_HIS_ENTRY195_REG_OFST      _UINT32_(0x71C)     /* (ISC_HIS_ENTRY195) Histogram Entry Offset */
#define ISC_HIS_ENTRY196_REG_OFST      _UINT32_(0x720)     /* (ISC_HIS_ENTRY196) Histogram Entry Offset */
#define ISC_HIS_ENTRY197_REG_OFST      _UINT32_(0x724)     /* (ISC_HIS_ENTRY197) Histogram Entry Offset */
#define ISC_HIS_ENTRY198_REG_OFST      _UINT32_(0x728)     /* (ISC_HIS_ENTRY198) Histogram Entry Offset */
#define ISC_HIS_ENTRY199_REG_OFST      _UINT32_(0x72C)     /* (ISC_HIS_ENTRY199) Histogram Entry Offset */
#define ISC_HIS_ENTRY200_REG_OFST      _UINT32_(0x730)     /* (ISC_HIS_ENTRY200) Histogram Entry Offset */
#define ISC_HIS_ENTRY201_REG_OFST      _UINT32_(0x734)     /* (ISC_HIS_ENTRY201) Histogram Entry Offset */
#define ISC_HIS_ENTRY202_REG_OFST      _UINT32_(0x738)     /* (ISC_HIS_ENTRY202) Histogram Entry Offset */
#define ISC_HIS_ENTRY203_REG_OFST      _UINT32_(0x73C)     /* (ISC_HIS_ENTRY203) Histogram Entry Offset */
#define ISC_HIS_ENTRY204_REG_OFST      _UINT32_(0x740)     /* (ISC_HIS_ENTRY204) Histogram Entry Offset */
#define ISC_HIS_ENTRY205_REG_OFST      _UINT32_(0x744)     /* (ISC_HIS_ENTRY205) Histogram Entry Offset */
#define ISC_HIS_ENTRY206_REG_OFST      _UINT32_(0x748)     /* (ISC_HIS_ENTRY206) Histogram Entry Offset */
#define ISC_HIS_ENTRY207_REG_OFST      _UINT32_(0x74C)     /* (ISC_HIS_ENTRY207) Histogram Entry Offset */
#define ISC_HIS_ENTRY208_REG_OFST      _UINT32_(0x750)     /* (ISC_HIS_ENTRY208) Histogram Entry Offset */
#define ISC_HIS_ENTRY209_REG_OFST      _UINT32_(0x754)     /* (ISC_HIS_ENTRY209) Histogram Entry Offset */
#define ISC_HIS_ENTRY210_REG_OFST      _UINT32_(0x758)     /* (ISC_HIS_ENTRY210) Histogram Entry Offset */
#define ISC_HIS_ENTRY211_REG_OFST      _UINT32_(0x75C)     /* (ISC_HIS_ENTRY211) Histogram Entry Offset */
#define ISC_HIS_ENTRY212_REG_OFST      _UINT32_(0x760)     /* (ISC_HIS_ENTRY212) Histogram Entry Offset */
#define ISC_HIS_ENTRY213_REG_OFST      _UINT32_(0x764)     /* (ISC_HIS_ENTRY213) Histogram Entry Offset */
#define ISC_HIS_ENTRY214_REG_OFST      _UINT32_(0x768)     /* (ISC_HIS_ENTRY214) Histogram Entry Offset */
#define ISC_HIS_ENTRY215_REG_OFST      _UINT32_(0x76C)     /* (ISC_HIS_ENTRY215) Histogram Entry Offset */
#define ISC_HIS_ENTRY216_REG_OFST      _UINT32_(0x770)     /* (ISC_HIS_ENTRY216) Histogram Entry Offset */
#define ISC_HIS_ENTRY217_REG_OFST      _UINT32_(0x774)     /* (ISC_HIS_ENTRY217) Histogram Entry Offset */
#define ISC_HIS_ENTRY218_REG_OFST      _UINT32_(0x778)     /* (ISC_HIS_ENTRY218) Histogram Entry Offset */
#define ISC_HIS_ENTRY219_REG_OFST      _UINT32_(0x77C)     /* (ISC_HIS_ENTRY219) Histogram Entry Offset */
#define ISC_HIS_ENTRY220_REG_OFST      _UINT32_(0x780)     /* (ISC_HIS_ENTRY220) Histogram Entry Offset */
#define ISC_HIS_ENTRY221_REG_OFST      _UINT32_(0x784)     /* (ISC_HIS_ENTRY221) Histogram Entry Offset */
#define ISC_HIS_ENTRY222_REG_OFST      _UINT32_(0x788)     /* (ISC_HIS_ENTRY222) Histogram Entry Offset */
#define ISC_HIS_ENTRY223_REG_OFST      _UINT32_(0x78C)     /* (ISC_HIS_ENTRY223) Histogram Entry Offset */
#define ISC_HIS_ENTRY224_REG_OFST      _UINT32_(0x790)     /* (ISC_HIS_ENTRY224) Histogram Entry Offset */
#define ISC_HIS_ENTRY225_REG_OFST      _UINT32_(0x794)     /* (ISC_HIS_ENTRY225) Histogram Entry Offset */
#define ISC_HIS_ENTRY226_REG_OFST      _UINT32_(0x798)     /* (ISC_HIS_ENTRY226) Histogram Entry Offset */
#define ISC_HIS_ENTRY227_REG_OFST      _UINT32_(0x79C)     /* (ISC_HIS_ENTRY227) Histogram Entry Offset */
#define ISC_HIS_ENTRY228_REG_OFST      _UINT32_(0x7A0)     /* (ISC_HIS_ENTRY228) Histogram Entry Offset */
#define ISC_HIS_ENTRY229_REG_OFST      _UINT32_(0x7A4)     /* (ISC_HIS_ENTRY229) Histogram Entry Offset */
#define ISC_HIS_ENTRY230_REG_OFST      _UINT32_(0x7A8)     /* (ISC_HIS_ENTRY230) Histogram Entry Offset */
#define ISC_HIS_ENTRY231_REG_OFST      _UINT32_(0x7AC)     /* (ISC_HIS_ENTRY231) Histogram Entry Offset */
#define ISC_HIS_ENTRY232_REG_OFST      _UINT32_(0x7B0)     /* (ISC_HIS_ENTRY232) Histogram Entry Offset */
#define ISC_HIS_ENTRY233_REG_OFST      _UINT32_(0x7B4)     /* (ISC_HIS_ENTRY233) Histogram Entry Offset */
#define ISC_HIS_ENTRY234_REG_OFST      _UINT32_(0x7B8)     /* (ISC_HIS_ENTRY234) Histogram Entry Offset */
#define ISC_HIS_ENTRY235_REG_OFST      _UINT32_(0x7BC)     /* (ISC_HIS_ENTRY235) Histogram Entry Offset */
#define ISC_HIS_ENTRY236_REG_OFST      _UINT32_(0x7C0)     /* (ISC_HIS_ENTRY236) Histogram Entry Offset */
#define ISC_HIS_ENTRY237_REG_OFST      _UINT32_(0x7C4)     /* (ISC_HIS_ENTRY237) Histogram Entry Offset */
#define ISC_HIS_ENTRY238_REG_OFST      _UINT32_(0x7C8)     /* (ISC_HIS_ENTRY238) Histogram Entry Offset */
#define ISC_HIS_ENTRY239_REG_OFST      _UINT32_(0x7CC)     /* (ISC_HIS_ENTRY239) Histogram Entry Offset */
#define ISC_HIS_ENTRY240_REG_OFST      _UINT32_(0x7D0)     /* (ISC_HIS_ENTRY240) Histogram Entry Offset */
#define ISC_HIS_ENTRY241_REG_OFST      _UINT32_(0x7D4)     /* (ISC_HIS_ENTRY241) Histogram Entry Offset */
#define ISC_HIS_ENTRY242_REG_OFST      _UINT32_(0x7D8)     /* (ISC_HIS_ENTRY242) Histogram Entry Offset */
#define ISC_HIS_ENTRY243_REG_OFST      _UINT32_(0x7DC)     /* (ISC_HIS_ENTRY243) Histogram Entry Offset */
#define ISC_HIS_ENTRY244_REG_OFST      _UINT32_(0x7E0)     /* (ISC_HIS_ENTRY244) Histogram Entry Offset */
#define ISC_HIS_ENTRY245_REG_OFST      _UINT32_(0x7E4)     /* (ISC_HIS_ENTRY245) Histogram Entry Offset */
#define ISC_HIS_ENTRY246_REG_OFST      _UINT32_(0x7E8)     /* (ISC_HIS_ENTRY246) Histogram Entry Offset */
#define ISC_HIS_ENTRY247_REG_OFST      _UINT32_(0x7EC)     /* (ISC_HIS_ENTRY247) Histogram Entry Offset */
#define ISC_HIS_ENTRY248_REG_OFST      _UINT32_(0x7F0)     /* (ISC_HIS_ENTRY248) Histogram Entry Offset */
#define ISC_HIS_ENTRY249_REG_OFST      _UINT32_(0x7F4)     /* (ISC_HIS_ENTRY249) Histogram Entry Offset */
#define ISC_HIS_ENTRY250_REG_OFST      _UINT32_(0x7F8)     /* (ISC_HIS_ENTRY250) Histogram Entry Offset */
#define ISC_HIS_ENTRY251_REG_OFST      _UINT32_(0x7FC)     /* (ISC_HIS_ENTRY251) Histogram Entry Offset */
#define ISC_HIS_ENTRY252_REG_OFST      _UINT32_(0x800)     /* (ISC_HIS_ENTRY252) Histogram Entry Offset */
#define ISC_HIS_ENTRY253_REG_OFST      _UINT32_(0x804)     /* (ISC_HIS_ENTRY253) Histogram Entry Offset */
#define ISC_HIS_ENTRY254_REG_OFST      _UINT32_(0x808)     /* (ISC_HIS_ENTRY254) Histogram Entry Offset */
#define ISC_HIS_ENTRY255_REG_OFST      _UINT32_(0x80C)     /* (ISC_HIS_ENTRY255) Histogram Entry Offset */
#define ISC_HIS_ENTRY256_REG_OFST      _UINT32_(0x810)     /* (ISC_HIS_ENTRY256) Histogram Entry Offset */
#define ISC_HIS_ENTRY257_REG_OFST      _UINT32_(0x814)     /* (ISC_HIS_ENTRY257) Histogram Entry Offset */
#define ISC_HIS_ENTRY258_REG_OFST      _UINT32_(0x818)     /* (ISC_HIS_ENTRY258) Histogram Entry Offset */
#define ISC_HIS_ENTRY259_REG_OFST      _UINT32_(0x81C)     /* (ISC_HIS_ENTRY259) Histogram Entry Offset */
#define ISC_HIS_ENTRY260_REG_OFST      _UINT32_(0x820)     /* (ISC_HIS_ENTRY260) Histogram Entry Offset */
#define ISC_HIS_ENTRY261_REG_OFST      _UINT32_(0x824)     /* (ISC_HIS_ENTRY261) Histogram Entry Offset */
#define ISC_HIS_ENTRY262_REG_OFST      _UINT32_(0x828)     /* (ISC_HIS_ENTRY262) Histogram Entry Offset */
#define ISC_HIS_ENTRY263_REG_OFST      _UINT32_(0x82C)     /* (ISC_HIS_ENTRY263) Histogram Entry Offset */
#define ISC_HIS_ENTRY264_REG_OFST      _UINT32_(0x830)     /* (ISC_HIS_ENTRY264) Histogram Entry Offset */
#define ISC_HIS_ENTRY265_REG_OFST      _UINT32_(0x834)     /* (ISC_HIS_ENTRY265) Histogram Entry Offset */
#define ISC_HIS_ENTRY266_REG_OFST      _UINT32_(0x838)     /* (ISC_HIS_ENTRY266) Histogram Entry Offset */
#define ISC_HIS_ENTRY267_REG_OFST      _UINT32_(0x83C)     /* (ISC_HIS_ENTRY267) Histogram Entry Offset */
#define ISC_HIS_ENTRY268_REG_OFST      _UINT32_(0x840)     /* (ISC_HIS_ENTRY268) Histogram Entry Offset */
#define ISC_HIS_ENTRY269_REG_OFST      _UINT32_(0x844)     /* (ISC_HIS_ENTRY269) Histogram Entry Offset */
#define ISC_HIS_ENTRY270_REG_OFST      _UINT32_(0x848)     /* (ISC_HIS_ENTRY270) Histogram Entry Offset */
#define ISC_HIS_ENTRY271_REG_OFST      _UINT32_(0x84C)     /* (ISC_HIS_ENTRY271) Histogram Entry Offset */
#define ISC_HIS_ENTRY272_REG_OFST      _UINT32_(0x850)     /* (ISC_HIS_ENTRY272) Histogram Entry Offset */
#define ISC_HIS_ENTRY273_REG_OFST      _UINT32_(0x854)     /* (ISC_HIS_ENTRY273) Histogram Entry Offset */
#define ISC_HIS_ENTRY274_REG_OFST      _UINT32_(0x858)     /* (ISC_HIS_ENTRY274) Histogram Entry Offset */
#define ISC_HIS_ENTRY275_REG_OFST      _UINT32_(0x85C)     /* (ISC_HIS_ENTRY275) Histogram Entry Offset */
#define ISC_HIS_ENTRY276_REG_OFST      _UINT32_(0x860)     /* (ISC_HIS_ENTRY276) Histogram Entry Offset */
#define ISC_HIS_ENTRY277_REG_OFST      _UINT32_(0x864)     /* (ISC_HIS_ENTRY277) Histogram Entry Offset */
#define ISC_HIS_ENTRY278_REG_OFST      _UINT32_(0x868)     /* (ISC_HIS_ENTRY278) Histogram Entry Offset */
#define ISC_HIS_ENTRY279_REG_OFST      _UINT32_(0x86C)     /* (ISC_HIS_ENTRY279) Histogram Entry Offset */
#define ISC_HIS_ENTRY280_REG_OFST      _UINT32_(0x870)     /* (ISC_HIS_ENTRY280) Histogram Entry Offset */
#define ISC_HIS_ENTRY281_REG_OFST      _UINT32_(0x874)     /* (ISC_HIS_ENTRY281) Histogram Entry Offset */
#define ISC_HIS_ENTRY282_REG_OFST      _UINT32_(0x878)     /* (ISC_HIS_ENTRY282) Histogram Entry Offset */
#define ISC_HIS_ENTRY283_REG_OFST      _UINT32_(0x87C)     /* (ISC_HIS_ENTRY283) Histogram Entry Offset */
#define ISC_HIS_ENTRY284_REG_OFST      _UINT32_(0x880)     /* (ISC_HIS_ENTRY284) Histogram Entry Offset */
#define ISC_HIS_ENTRY285_REG_OFST      _UINT32_(0x884)     /* (ISC_HIS_ENTRY285) Histogram Entry Offset */
#define ISC_HIS_ENTRY286_REG_OFST      _UINT32_(0x888)     /* (ISC_HIS_ENTRY286) Histogram Entry Offset */
#define ISC_HIS_ENTRY287_REG_OFST      _UINT32_(0x88C)     /* (ISC_HIS_ENTRY287) Histogram Entry Offset */
#define ISC_HIS_ENTRY288_REG_OFST      _UINT32_(0x890)     /* (ISC_HIS_ENTRY288) Histogram Entry Offset */
#define ISC_HIS_ENTRY289_REG_OFST      _UINT32_(0x894)     /* (ISC_HIS_ENTRY289) Histogram Entry Offset */
#define ISC_HIS_ENTRY290_REG_OFST      _UINT32_(0x898)     /* (ISC_HIS_ENTRY290) Histogram Entry Offset */
#define ISC_HIS_ENTRY291_REG_OFST      _UINT32_(0x89C)     /* (ISC_HIS_ENTRY291) Histogram Entry Offset */
#define ISC_HIS_ENTRY292_REG_OFST      _UINT32_(0x8A0)     /* (ISC_HIS_ENTRY292) Histogram Entry Offset */
#define ISC_HIS_ENTRY293_REG_OFST      _UINT32_(0x8A4)     /* (ISC_HIS_ENTRY293) Histogram Entry Offset */
#define ISC_HIS_ENTRY294_REG_OFST      _UINT32_(0x8A8)     /* (ISC_HIS_ENTRY294) Histogram Entry Offset */
#define ISC_HIS_ENTRY295_REG_OFST      _UINT32_(0x8AC)     /* (ISC_HIS_ENTRY295) Histogram Entry Offset */
#define ISC_HIS_ENTRY296_REG_OFST      _UINT32_(0x8B0)     /* (ISC_HIS_ENTRY296) Histogram Entry Offset */
#define ISC_HIS_ENTRY297_REG_OFST      _UINT32_(0x8B4)     /* (ISC_HIS_ENTRY297) Histogram Entry Offset */
#define ISC_HIS_ENTRY298_REG_OFST      _UINT32_(0x8B8)     /* (ISC_HIS_ENTRY298) Histogram Entry Offset */
#define ISC_HIS_ENTRY299_REG_OFST      _UINT32_(0x8BC)     /* (ISC_HIS_ENTRY299) Histogram Entry Offset */
#define ISC_HIS_ENTRY300_REG_OFST      _UINT32_(0x8C0)     /* (ISC_HIS_ENTRY300) Histogram Entry Offset */
#define ISC_HIS_ENTRY301_REG_OFST      _UINT32_(0x8C4)     /* (ISC_HIS_ENTRY301) Histogram Entry Offset */
#define ISC_HIS_ENTRY302_REG_OFST      _UINT32_(0x8C8)     /* (ISC_HIS_ENTRY302) Histogram Entry Offset */
#define ISC_HIS_ENTRY303_REG_OFST      _UINT32_(0x8CC)     /* (ISC_HIS_ENTRY303) Histogram Entry Offset */
#define ISC_HIS_ENTRY304_REG_OFST      _UINT32_(0x8D0)     /* (ISC_HIS_ENTRY304) Histogram Entry Offset */
#define ISC_HIS_ENTRY305_REG_OFST      _UINT32_(0x8D4)     /* (ISC_HIS_ENTRY305) Histogram Entry Offset */
#define ISC_HIS_ENTRY306_REG_OFST      _UINT32_(0x8D8)     /* (ISC_HIS_ENTRY306) Histogram Entry Offset */
#define ISC_HIS_ENTRY307_REG_OFST      _UINT32_(0x8DC)     /* (ISC_HIS_ENTRY307) Histogram Entry Offset */
#define ISC_HIS_ENTRY308_REG_OFST      _UINT32_(0x8E0)     /* (ISC_HIS_ENTRY308) Histogram Entry Offset */
#define ISC_HIS_ENTRY309_REG_OFST      _UINT32_(0x8E4)     /* (ISC_HIS_ENTRY309) Histogram Entry Offset */
#define ISC_HIS_ENTRY310_REG_OFST      _UINT32_(0x8E8)     /* (ISC_HIS_ENTRY310) Histogram Entry Offset */
#define ISC_HIS_ENTRY311_REG_OFST      _UINT32_(0x8EC)     /* (ISC_HIS_ENTRY311) Histogram Entry Offset */
#define ISC_HIS_ENTRY312_REG_OFST      _UINT32_(0x8F0)     /* (ISC_HIS_ENTRY312) Histogram Entry Offset */
#define ISC_HIS_ENTRY313_REG_OFST      _UINT32_(0x8F4)     /* (ISC_HIS_ENTRY313) Histogram Entry Offset */
#define ISC_HIS_ENTRY314_REG_OFST      _UINT32_(0x8F8)     /* (ISC_HIS_ENTRY314) Histogram Entry Offset */
#define ISC_HIS_ENTRY315_REG_OFST      _UINT32_(0x8FC)     /* (ISC_HIS_ENTRY315) Histogram Entry Offset */
#define ISC_HIS_ENTRY316_REG_OFST      _UINT32_(0x900)     /* (ISC_HIS_ENTRY316) Histogram Entry Offset */
#define ISC_HIS_ENTRY317_REG_OFST      _UINT32_(0x904)     /* (ISC_HIS_ENTRY317) Histogram Entry Offset */
#define ISC_HIS_ENTRY318_REG_OFST      _UINT32_(0x908)     /* (ISC_HIS_ENTRY318) Histogram Entry Offset */
#define ISC_HIS_ENTRY319_REG_OFST      _UINT32_(0x90C)     /* (ISC_HIS_ENTRY319) Histogram Entry Offset */
#define ISC_HIS_ENTRY320_REG_OFST      _UINT32_(0x910)     /* (ISC_HIS_ENTRY320) Histogram Entry Offset */
#define ISC_HIS_ENTRY321_REG_OFST      _UINT32_(0x914)     /* (ISC_HIS_ENTRY321) Histogram Entry Offset */
#define ISC_HIS_ENTRY322_REG_OFST      _UINT32_(0x918)     /* (ISC_HIS_ENTRY322) Histogram Entry Offset */
#define ISC_HIS_ENTRY323_REG_OFST      _UINT32_(0x91C)     /* (ISC_HIS_ENTRY323) Histogram Entry Offset */
#define ISC_HIS_ENTRY324_REG_OFST      _UINT32_(0x920)     /* (ISC_HIS_ENTRY324) Histogram Entry Offset */
#define ISC_HIS_ENTRY325_REG_OFST      _UINT32_(0x924)     /* (ISC_HIS_ENTRY325) Histogram Entry Offset */
#define ISC_HIS_ENTRY326_REG_OFST      _UINT32_(0x928)     /* (ISC_HIS_ENTRY326) Histogram Entry Offset */
#define ISC_HIS_ENTRY327_REG_OFST      _UINT32_(0x92C)     /* (ISC_HIS_ENTRY327) Histogram Entry Offset */
#define ISC_HIS_ENTRY328_REG_OFST      _UINT32_(0x930)     /* (ISC_HIS_ENTRY328) Histogram Entry Offset */
#define ISC_HIS_ENTRY329_REG_OFST      _UINT32_(0x934)     /* (ISC_HIS_ENTRY329) Histogram Entry Offset */
#define ISC_HIS_ENTRY330_REG_OFST      _UINT32_(0x938)     /* (ISC_HIS_ENTRY330) Histogram Entry Offset */
#define ISC_HIS_ENTRY331_REG_OFST      _UINT32_(0x93C)     /* (ISC_HIS_ENTRY331) Histogram Entry Offset */
#define ISC_HIS_ENTRY332_REG_OFST      _UINT32_(0x940)     /* (ISC_HIS_ENTRY332) Histogram Entry Offset */
#define ISC_HIS_ENTRY333_REG_OFST      _UINT32_(0x944)     /* (ISC_HIS_ENTRY333) Histogram Entry Offset */
#define ISC_HIS_ENTRY334_REG_OFST      _UINT32_(0x948)     /* (ISC_HIS_ENTRY334) Histogram Entry Offset */
#define ISC_HIS_ENTRY335_REG_OFST      _UINT32_(0x94C)     /* (ISC_HIS_ENTRY335) Histogram Entry Offset */
#define ISC_HIS_ENTRY336_REG_OFST      _UINT32_(0x950)     /* (ISC_HIS_ENTRY336) Histogram Entry Offset */
#define ISC_HIS_ENTRY337_REG_OFST      _UINT32_(0x954)     /* (ISC_HIS_ENTRY337) Histogram Entry Offset */
#define ISC_HIS_ENTRY338_REG_OFST      _UINT32_(0x958)     /* (ISC_HIS_ENTRY338) Histogram Entry Offset */
#define ISC_HIS_ENTRY339_REG_OFST      _UINT32_(0x95C)     /* (ISC_HIS_ENTRY339) Histogram Entry Offset */
#define ISC_HIS_ENTRY340_REG_OFST      _UINT32_(0x960)     /* (ISC_HIS_ENTRY340) Histogram Entry Offset */
#define ISC_HIS_ENTRY341_REG_OFST      _UINT32_(0x964)     /* (ISC_HIS_ENTRY341) Histogram Entry Offset */
#define ISC_HIS_ENTRY342_REG_OFST      _UINT32_(0x968)     /* (ISC_HIS_ENTRY342) Histogram Entry Offset */
#define ISC_HIS_ENTRY343_REG_OFST      _UINT32_(0x96C)     /* (ISC_HIS_ENTRY343) Histogram Entry Offset */
#define ISC_HIS_ENTRY344_REG_OFST      _UINT32_(0x970)     /* (ISC_HIS_ENTRY344) Histogram Entry Offset */
#define ISC_HIS_ENTRY345_REG_OFST      _UINT32_(0x974)     /* (ISC_HIS_ENTRY345) Histogram Entry Offset */
#define ISC_HIS_ENTRY346_REG_OFST      _UINT32_(0x978)     /* (ISC_HIS_ENTRY346) Histogram Entry Offset */
#define ISC_HIS_ENTRY347_REG_OFST      _UINT32_(0x97C)     /* (ISC_HIS_ENTRY347) Histogram Entry Offset */
#define ISC_HIS_ENTRY348_REG_OFST      _UINT32_(0x980)     /* (ISC_HIS_ENTRY348) Histogram Entry Offset */
#define ISC_HIS_ENTRY349_REG_OFST      _UINT32_(0x984)     /* (ISC_HIS_ENTRY349) Histogram Entry Offset */
#define ISC_HIS_ENTRY350_REG_OFST      _UINT32_(0x988)     /* (ISC_HIS_ENTRY350) Histogram Entry Offset */
#define ISC_HIS_ENTRY351_REG_OFST      _UINT32_(0x98C)     /* (ISC_HIS_ENTRY351) Histogram Entry Offset */
#define ISC_HIS_ENTRY352_REG_OFST      _UINT32_(0x990)     /* (ISC_HIS_ENTRY352) Histogram Entry Offset */
#define ISC_HIS_ENTRY353_REG_OFST      _UINT32_(0x994)     /* (ISC_HIS_ENTRY353) Histogram Entry Offset */
#define ISC_HIS_ENTRY354_REG_OFST      _UINT32_(0x998)     /* (ISC_HIS_ENTRY354) Histogram Entry Offset */
#define ISC_HIS_ENTRY355_REG_OFST      _UINT32_(0x99C)     /* (ISC_HIS_ENTRY355) Histogram Entry Offset */
#define ISC_HIS_ENTRY356_REG_OFST      _UINT32_(0x9A0)     /* (ISC_HIS_ENTRY356) Histogram Entry Offset */
#define ISC_HIS_ENTRY357_REG_OFST      _UINT32_(0x9A4)     /* (ISC_HIS_ENTRY357) Histogram Entry Offset */
#define ISC_HIS_ENTRY358_REG_OFST      _UINT32_(0x9A8)     /* (ISC_HIS_ENTRY358) Histogram Entry Offset */
#define ISC_HIS_ENTRY359_REG_OFST      _UINT32_(0x9AC)     /* (ISC_HIS_ENTRY359) Histogram Entry Offset */
#define ISC_HIS_ENTRY360_REG_OFST      _UINT32_(0x9B0)     /* (ISC_HIS_ENTRY360) Histogram Entry Offset */
#define ISC_HIS_ENTRY361_REG_OFST      _UINT32_(0x9B4)     /* (ISC_HIS_ENTRY361) Histogram Entry Offset */
#define ISC_HIS_ENTRY362_REG_OFST      _UINT32_(0x9B8)     /* (ISC_HIS_ENTRY362) Histogram Entry Offset */
#define ISC_HIS_ENTRY363_REG_OFST      _UINT32_(0x9BC)     /* (ISC_HIS_ENTRY363) Histogram Entry Offset */
#define ISC_HIS_ENTRY364_REG_OFST      _UINT32_(0x9C0)     /* (ISC_HIS_ENTRY364) Histogram Entry Offset */
#define ISC_HIS_ENTRY365_REG_OFST      _UINT32_(0x9C4)     /* (ISC_HIS_ENTRY365) Histogram Entry Offset */
#define ISC_HIS_ENTRY366_REG_OFST      _UINT32_(0x9C8)     /* (ISC_HIS_ENTRY366) Histogram Entry Offset */
#define ISC_HIS_ENTRY367_REG_OFST      _UINT32_(0x9CC)     /* (ISC_HIS_ENTRY367) Histogram Entry Offset */
#define ISC_HIS_ENTRY368_REG_OFST      _UINT32_(0x9D0)     /* (ISC_HIS_ENTRY368) Histogram Entry Offset */
#define ISC_HIS_ENTRY369_REG_OFST      _UINT32_(0x9D4)     /* (ISC_HIS_ENTRY369) Histogram Entry Offset */
#define ISC_HIS_ENTRY370_REG_OFST      _UINT32_(0x9D8)     /* (ISC_HIS_ENTRY370) Histogram Entry Offset */
#define ISC_HIS_ENTRY371_REG_OFST      _UINT32_(0x9DC)     /* (ISC_HIS_ENTRY371) Histogram Entry Offset */
#define ISC_HIS_ENTRY372_REG_OFST      _UINT32_(0x9E0)     /* (ISC_HIS_ENTRY372) Histogram Entry Offset */
#define ISC_HIS_ENTRY373_REG_OFST      _UINT32_(0x9E4)     /* (ISC_HIS_ENTRY373) Histogram Entry Offset */
#define ISC_HIS_ENTRY374_REG_OFST      _UINT32_(0x9E8)     /* (ISC_HIS_ENTRY374) Histogram Entry Offset */
#define ISC_HIS_ENTRY375_REG_OFST      _UINT32_(0x9EC)     /* (ISC_HIS_ENTRY375) Histogram Entry Offset */
#define ISC_HIS_ENTRY376_REG_OFST      _UINT32_(0x9F0)     /* (ISC_HIS_ENTRY376) Histogram Entry Offset */
#define ISC_HIS_ENTRY377_REG_OFST      _UINT32_(0x9F4)     /* (ISC_HIS_ENTRY377) Histogram Entry Offset */
#define ISC_HIS_ENTRY378_REG_OFST      _UINT32_(0x9F8)     /* (ISC_HIS_ENTRY378) Histogram Entry Offset */
#define ISC_HIS_ENTRY379_REG_OFST      _UINT32_(0x9FC)     /* (ISC_HIS_ENTRY379) Histogram Entry Offset */
#define ISC_HIS_ENTRY380_REG_OFST      _UINT32_(0xA00)     /* (ISC_HIS_ENTRY380) Histogram Entry Offset */
#define ISC_HIS_ENTRY381_REG_OFST      _UINT32_(0xA04)     /* (ISC_HIS_ENTRY381) Histogram Entry Offset */
#define ISC_HIS_ENTRY382_REG_OFST      _UINT32_(0xA08)     /* (ISC_HIS_ENTRY382) Histogram Entry Offset */
#define ISC_HIS_ENTRY383_REG_OFST      _UINT32_(0xA0C)     /* (ISC_HIS_ENTRY383) Histogram Entry Offset */
#define ISC_HIS_ENTRY384_REG_OFST      _UINT32_(0xA10)     /* (ISC_HIS_ENTRY384) Histogram Entry Offset */
#define ISC_HIS_ENTRY385_REG_OFST      _UINT32_(0xA14)     /* (ISC_HIS_ENTRY385) Histogram Entry Offset */
#define ISC_HIS_ENTRY386_REG_OFST      _UINT32_(0xA18)     /* (ISC_HIS_ENTRY386) Histogram Entry Offset */
#define ISC_HIS_ENTRY387_REG_OFST      _UINT32_(0xA1C)     /* (ISC_HIS_ENTRY387) Histogram Entry Offset */
#define ISC_HIS_ENTRY388_REG_OFST      _UINT32_(0xA20)     /* (ISC_HIS_ENTRY388) Histogram Entry Offset */
#define ISC_HIS_ENTRY389_REG_OFST      _UINT32_(0xA24)     /* (ISC_HIS_ENTRY389) Histogram Entry Offset */
#define ISC_HIS_ENTRY390_REG_OFST      _UINT32_(0xA28)     /* (ISC_HIS_ENTRY390) Histogram Entry Offset */
