Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/uart/uart_echo_interrupt/firmware/src/packs/ATSAMA5D29_DFP/component/isc.h
#define ISC_HIS_ENTRY391_REG_OFST      _UINT32_(0xA2C)     /* (ISC_HIS_ENTRY391) Histogram Entry Offset */
#define ISC_HIS_ENTRY392_REG_OFST      _UINT32_(0xA30)     /* (ISC_HIS_ENTRY392) Histogram Entry Offset */
#define ISC_HIS_ENTRY393_REG_OFST      _UINT32_(0xA34)     /* (ISC_HIS_ENTRY393) Histogram Entry Offset */
#define ISC_HIS_ENTRY394_REG_OFST      _UINT32_(0xA38)     /* (ISC_HIS_ENTRY394) Histogram Entry Offset */
#define ISC_HIS_ENTRY395_REG_OFST      _UINT32_(0xA3C)     /* (ISC_HIS_ENTRY395) Histogram Entry Offset */
#define ISC_HIS_ENTRY396_REG_OFST      _UINT32_(0xA40)     /* (ISC_HIS_ENTRY396) Histogram Entry Offset */
#define ISC_HIS_ENTRY397_REG_OFST      _UINT32_(0xA44)     /* (ISC_HIS_ENTRY397) Histogram Entry Offset */
#define ISC_HIS_ENTRY398_REG_OFST      _UINT32_(0xA48)     /* (ISC_HIS_ENTRY398) Histogram Entry Offset */
#define ISC_HIS_ENTRY399_REG_OFST      _UINT32_(0xA4C)     /* (ISC_HIS_ENTRY399) Histogram Entry Offset */
#define ISC_HIS_ENTRY400_REG_OFST      _UINT32_(0xA50)     /* (ISC_HIS_ENTRY400) Histogram Entry Offset */
#define ISC_HIS_ENTRY401_REG_OFST      _UINT32_(0xA54)     /* (ISC_HIS_ENTRY401) Histogram Entry Offset */
#define ISC_HIS_ENTRY402_REG_OFST      _UINT32_(0xA58)     /* (ISC_HIS_ENTRY402) Histogram Entry Offset */
#define ISC_HIS_ENTRY403_REG_OFST      _UINT32_(0xA5C)     /* (ISC_HIS_ENTRY403) Histogram Entry Offset */
#define ISC_HIS_ENTRY404_REG_OFST      _UINT32_(0xA60)     /* (ISC_HIS_ENTRY404) Histogram Entry Offset */
#define ISC_HIS_ENTRY405_REG_OFST      _UINT32_(0xA64)     /* (ISC_HIS_ENTRY405) Histogram Entry Offset */
#define ISC_HIS_ENTRY406_REG_OFST      _UINT32_(0xA68)     /* (ISC_HIS_ENTRY406) Histogram Entry Offset */
#define ISC_HIS_ENTRY407_REG_OFST      _UINT32_(0xA6C)     /* (ISC_HIS_ENTRY407) Histogram Entry Offset */
#define ISC_HIS_ENTRY408_REG_OFST      _UINT32_(0xA70)     /* (ISC_HIS_ENTRY408) Histogram Entry Offset */
#define ISC_HIS_ENTRY409_REG_OFST      _UINT32_(0xA74)     /* (ISC_HIS_ENTRY409) Histogram Entry Offset */
#define ISC_HIS_ENTRY410_REG_OFST      _UINT32_(0xA78)     /* (ISC_HIS_ENTRY410) Histogram Entry Offset */
#define ISC_HIS_ENTRY411_REG_OFST      _UINT32_(0xA7C)     /* (ISC_HIS_ENTRY411) Histogram Entry Offset */
#define ISC_HIS_ENTRY412_REG_OFST      _UINT32_(0xA80)     /* (ISC_HIS_ENTRY412) Histogram Entry Offset */
#define ISC_HIS_ENTRY413_REG_OFST      _UINT32_(0xA84)     /* (ISC_HIS_ENTRY413) Histogram Entry Offset */
#define ISC_HIS_ENTRY414_REG_OFST      _UINT32_(0xA88)     /* (ISC_HIS_ENTRY414) Histogram Entry Offset */
#define ISC_HIS_ENTRY415_REG_OFST      _UINT32_(0xA8C)     /* (ISC_HIS_ENTRY415) Histogram Entry Offset */
#define ISC_HIS_ENTRY416_REG_OFST      _UINT32_(0xA90)     /* (ISC_HIS_ENTRY416) Histogram Entry Offset */
#define ISC_HIS_ENTRY417_REG_OFST      _UINT32_(0xA94)     /* (ISC_HIS_ENTRY417) Histogram Entry Offset */
#define ISC_HIS_ENTRY418_REG_OFST      _UINT32_(0xA98)     /* (ISC_HIS_ENTRY418) Histogram Entry Offset */
#define ISC_HIS_ENTRY419_REG_OFST      _UINT32_(0xA9C)     /* (ISC_HIS_ENTRY419) Histogram Entry Offset */
#define ISC_HIS_ENTRY420_REG_OFST      _UINT32_(0xAA0)     /* (ISC_HIS_ENTRY420) Histogram Entry Offset */
#define ISC_HIS_ENTRY421_REG_OFST      _UINT32_(0xAA4)     /* (ISC_HIS_ENTRY421) Histogram Entry Offset */
#define ISC_HIS_ENTRY422_REG_OFST      _UINT32_(0xAA8)     /* (ISC_HIS_ENTRY422) Histogram Entry Offset */
#define ISC_HIS_ENTRY423_REG_OFST      _UINT32_(0xAAC)     /* (ISC_HIS_ENTRY423) Histogram Entry Offset */
#define ISC_HIS_ENTRY424_REG_OFST      _UINT32_(0xAB0)     /* (ISC_HIS_ENTRY424) Histogram Entry Offset */
#define ISC_HIS_ENTRY425_REG_OFST      _UINT32_(0xAB4)     /* (ISC_HIS_ENTRY425) Histogram Entry Offset */
#define ISC_HIS_ENTRY426_REG_OFST      _UINT32_(0xAB8)     /* (ISC_HIS_ENTRY426) Histogram Entry Offset */
#define ISC_HIS_ENTRY427_REG_OFST      _UINT32_(0xABC)     /* (ISC_HIS_ENTRY427) Histogram Entry Offset */
#define ISC_HIS_ENTRY428_REG_OFST      _UINT32_(0xAC0)     /* (ISC_HIS_ENTRY428) Histogram Entry Offset */
#define ISC_HIS_ENTRY429_REG_OFST      _UINT32_(0xAC4)     /* (ISC_HIS_ENTRY429) Histogram Entry Offset */
#define ISC_HIS_ENTRY430_REG_OFST      _UINT32_(0xAC8)     /* (ISC_HIS_ENTRY430) Histogram Entry Offset */
#define ISC_HIS_ENTRY431_REG_OFST      _UINT32_(0xACC)     /* (ISC_HIS_ENTRY431) Histogram Entry Offset */
#define ISC_HIS_ENTRY432_REG_OFST      _UINT32_(0xAD0)     /* (ISC_HIS_ENTRY432) Histogram Entry Offset */
#define ISC_HIS_ENTRY433_REG_OFST      _UINT32_(0xAD4)     /* (ISC_HIS_ENTRY433) Histogram Entry Offset */
#define ISC_HIS_ENTRY434_REG_OFST      _UINT32_(0xAD8)     /* (ISC_HIS_ENTRY434) Histogram Entry Offset */
#define ISC_HIS_ENTRY435_REG_OFST      _UINT32_(0xADC)     /* (ISC_HIS_ENTRY435) Histogram Entry Offset */
#define ISC_HIS_ENTRY436_REG_OFST      _UINT32_(0xAE0)     /* (ISC_HIS_ENTRY436) Histogram Entry Offset */
#define ISC_HIS_ENTRY437_REG_OFST      _UINT32_(0xAE4)     /* (ISC_HIS_ENTRY437) Histogram Entry Offset */
#define ISC_HIS_ENTRY438_REG_OFST      _UINT32_(0xAE8)     /* (ISC_HIS_ENTRY438) Histogram Entry Offset */
#define ISC_HIS_ENTRY439_REG_OFST      _UINT32_(0xAEC)     /* (ISC_HIS_ENTRY439) Histogram Entry Offset */
#define ISC_HIS_ENTRY440_REG_OFST      _UINT32_(0xAF0)     /* (ISC_HIS_ENTRY440) Histogram Entry Offset */
#define ISC_HIS_ENTRY441_REG_OFST      _UINT32_(0xAF4)     /* (ISC_HIS_ENTRY441) Histogram Entry Offset */
#define ISC_HIS_ENTRY442_REG_OFST      _UINT32_(0xAF8)     /* (ISC_HIS_ENTRY442) Histogram Entry Offset */
#define ISC_HIS_ENTRY443_REG_OFST      _UINT32_(0xAFC)     /* (ISC_HIS_ENTRY443) Histogram Entry Offset */
#define ISC_HIS_ENTRY444_REG_OFST      _UINT32_(0xB00)     /* (ISC_HIS_ENTRY444) Histogram Entry Offset */
#define ISC_HIS_ENTRY445_REG_OFST      _UINT32_(0xB04)     /* (ISC_HIS_ENTRY445) Histogram Entry Offset */
#define ISC_HIS_ENTRY446_REG_OFST      _UINT32_(0xB08)     /* (ISC_HIS_ENTRY446) Histogram Entry Offset */
#define ISC_HIS_ENTRY447_REG_OFST      _UINT32_(0xB0C)     /* (ISC_HIS_ENTRY447) Histogram Entry Offset */
#define ISC_HIS_ENTRY448_REG_OFST      _UINT32_(0xB10)     /* (ISC_HIS_ENTRY448) Histogram Entry Offset */
#define ISC_HIS_ENTRY449_REG_OFST      _UINT32_(0xB14)     /* (ISC_HIS_ENTRY449) Histogram Entry Offset */
#define ISC_HIS_ENTRY450_REG_OFST      _UINT32_(0xB18)     /* (ISC_HIS_ENTRY450) Histogram Entry Offset */
#define ISC_HIS_ENTRY451_REG_OFST      _UINT32_(0xB1C)     /* (ISC_HIS_ENTRY451) Histogram Entry Offset */
#define ISC_HIS_ENTRY452_REG_OFST      _UINT32_(0xB20)     /* (ISC_HIS_ENTRY452) Histogram Entry Offset */
#define ISC_HIS_ENTRY453_REG_OFST      _UINT32_(0xB24)     /* (ISC_HIS_ENTRY453) Histogram Entry Offset */
#define ISC_HIS_ENTRY454_REG_OFST      _UINT32_(0xB28)     /* (ISC_HIS_ENTRY454) Histogram Entry Offset */
#define ISC_HIS_ENTRY455_REG_OFST      _UINT32_(0xB2C)     /* (ISC_HIS_ENTRY455) Histogram Entry Offset */
#define ISC_HIS_ENTRY456_REG_OFST      _UINT32_(0xB30)     /* (ISC_HIS_ENTRY456) Histogram Entry Offset */
#define ISC_HIS_ENTRY457_REG_OFST      _UINT32_(0xB34)     /* (ISC_HIS_ENTRY457) Histogram Entry Offset */
#define ISC_HIS_ENTRY458_REG_OFST      _UINT32_(0xB38)     /* (ISC_HIS_ENTRY458) Histogram Entry Offset */
#define ISC_HIS_ENTRY459_REG_OFST      _UINT32_(0xB3C)     /* (ISC_HIS_ENTRY459) Histogram Entry Offset */
#define ISC_HIS_ENTRY460_REG_OFST      _UINT32_(0xB40)     /* (ISC_HIS_ENTRY460) Histogram Entry Offset */
#define ISC_HIS_ENTRY461_REG_OFST      _UINT32_(0xB44)     /* (ISC_HIS_ENTRY461) Histogram Entry Offset */
#define ISC_HIS_ENTRY462_REG_OFST      _UINT32_(0xB48)     /* (ISC_HIS_ENTRY462) Histogram Entry Offset */
#define ISC_HIS_ENTRY463_REG_OFST      _UINT32_(0xB4C)     /* (ISC_HIS_ENTRY463) Histogram Entry Offset */
#define ISC_HIS_ENTRY464_REG_OFST      _UINT32_(0xB50)     /* (ISC_HIS_ENTRY464) Histogram Entry Offset */
#define ISC_HIS_ENTRY465_REG_OFST      _UINT32_(0xB54)     /* (ISC_HIS_ENTRY465) Histogram Entry Offset */
#define ISC_HIS_ENTRY466_REG_OFST      _UINT32_(0xB58)     /* (ISC_HIS_ENTRY466) Histogram Entry Offset */
#define ISC_HIS_ENTRY467_REG_OFST      _UINT32_(0xB5C)     /* (ISC_HIS_ENTRY467) Histogram Entry Offset */
#define ISC_HIS_ENTRY468_REG_OFST      _UINT32_(0xB60)     /* (ISC_HIS_ENTRY468) Histogram Entry Offset */
#define ISC_HIS_ENTRY469_REG_OFST      _UINT32_(0xB64)     /* (ISC_HIS_ENTRY469) Histogram Entry Offset */
#define ISC_HIS_ENTRY470_REG_OFST      _UINT32_(0xB68)     /* (ISC_HIS_ENTRY470) Histogram Entry Offset */
#define ISC_HIS_ENTRY471_REG_OFST      _UINT32_(0xB6C)     /* (ISC_HIS_ENTRY471) Histogram Entry Offset */
#define ISC_HIS_ENTRY472_REG_OFST      _UINT32_(0xB70)     /* (ISC_HIS_ENTRY472) Histogram Entry Offset */
#define ISC_HIS_ENTRY473_REG_OFST      _UINT32_(0xB74)     /* (ISC_HIS_ENTRY473) Histogram Entry Offset */
#define ISC_HIS_ENTRY474_REG_OFST      _UINT32_(0xB78)     /* (ISC_HIS_ENTRY474) Histogram Entry Offset */
#define ISC_HIS_ENTRY475_REG_OFST      _UINT32_(0xB7C)     /* (ISC_HIS_ENTRY475) Histogram Entry Offset */
#define ISC_HIS_ENTRY476_REG_OFST      _UINT32_(0xB80)     /* (ISC_HIS_ENTRY476) Histogram Entry Offset */
#define ISC_HIS_ENTRY477_REG_OFST      _UINT32_(0xB84)     /* (ISC_HIS_ENTRY477) Histogram Entry Offset */
#define ISC_HIS_ENTRY478_REG_OFST      _UINT32_(0xB88)     /* (ISC_HIS_ENTRY478) Histogram Entry Offset */
#define ISC_HIS_ENTRY479_REG_OFST      _UINT32_(0xB8C)     /* (ISC_HIS_ENTRY479) Histogram Entry Offset */
#define ISC_HIS_ENTRY480_REG_OFST      _UINT32_(0xB90)     /* (ISC_HIS_ENTRY480) Histogram Entry Offset */
#define ISC_HIS_ENTRY481_REG_OFST      _UINT32_(0xB94)     /* (ISC_HIS_ENTRY481) Histogram Entry Offset */
#define ISC_HIS_ENTRY482_REG_OFST      _UINT32_(0xB98)     /* (ISC_HIS_ENTRY482) Histogram Entry Offset */
#define ISC_HIS_ENTRY483_REG_OFST      _UINT32_(0xB9C)     /* (ISC_HIS_ENTRY483) Histogram Entry Offset */
#define ISC_HIS_ENTRY484_REG_OFST      _UINT32_(0xBA0)     /* (ISC_HIS_ENTRY484) Histogram Entry Offset */
#define ISC_HIS_ENTRY485_REG_OFST      _UINT32_(0xBA4)     /* (ISC_HIS_ENTRY485) Histogram Entry Offset */
#define ISC_HIS_ENTRY486_REG_OFST      _UINT32_(0xBA8)     /* (ISC_HIS_ENTRY486) Histogram Entry Offset */
#define ISC_HIS_ENTRY487_REG_OFST      _UINT32_(0xBAC)     /* (ISC_HIS_ENTRY487) Histogram Entry Offset */
#define ISC_HIS_ENTRY488_REG_OFST      _UINT32_(0xBB0)     /* (ISC_HIS_ENTRY488) Histogram Entry Offset */
#define ISC_HIS_ENTRY489_REG_OFST      _UINT32_(0xBB4)     /* (ISC_HIS_ENTRY489) Histogram Entry Offset */
#define ISC_HIS_ENTRY490_REG_OFST      _UINT32_(0xBB8)     /* (ISC_HIS_ENTRY490) Histogram Entry Offset */
#define ISC_HIS_ENTRY491_REG_OFST      _UINT32_(0xBBC)     /* (ISC_HIS_ENTRY491) Histogram Entry Offset */
#define ISC_HIS_ENTRY492_REG_OFST      _UINT32_(0xBC0)     /* (ISC_HIS_ENTRY492) Histogram Entry Offset */
#define ISC_HIS_ENTRY493_REG_OFST      _UINT32_(0xBC4)     /* (ISC_HIS_ENTRY493) Histogram Entry Offset */
#define ISC_HIS_ENTRY494_REG_OFST      _UINT32_(0xBC8)     /* (ISC_HIS_ENTRY494) Histogram Entry Offset */
#define ISC_HIS_ENTRY495_REG_OFST      _UINT32_(0xBCC)     /* (ISC_HIS_ENTRY495) Histogram Entry Offset */
#define ISC_HIS_ENTRY496_REG_OFST      _UINT32_(0xBD0)     /* (ISC_HIS_ENTRY496) Histogram Entry Offset */
#define ISC_HIS_ENTRY497_REG_OFST      _UINT32_(0xBD4)     /* (ISC_HIS_ENTRY497) Histogram Entry Offset */
#define ISC_HIS_ENTRY498_REG_OFST      _UINT32_(0xBD8)     /* (ISC_HIS_ENTRY498) Histogram Entry Offset */
#define ISC_HIS_ENTRY499_REG_OFST      _UINT32_(0xBDC)     /* (ISC_HIS_ENTRY499) Histogram Entry Offset */
#define ISC_HIS_ENTRY500_REG_OFST      _UINT32_(0xBE0)     /* (ISC_HIS_ENTRY500) Histogram Entry Offset */
#define ISC_HIS_ENTRY501_REG_OFST      _UINT32_(0xBE4)     /* (ISC_HIS_ENTRY501) Histogram Entry Offset */
#define ISC_HIS_ENTRY502_REG_OFST      _UINT32_(0xBE8)     /* (ISC_HIS_ENTRY502) Histogram Entry Offset */
#define ISC_HIS_ENTRY503_REG_OFST      _UINT32_(0xBEC)     /* (ISC_HIS_ENTRY503) Histogram Entry Offset */
#define ISC_HIS_ENTRY504_REG_OFST      _UINT32_(0xBF0)     /* (ISC_HIS_ENTRY504) Histogram Entry Offset */
#define ISC_HIS_ENTRY505_REG_OFST      _UINT32_(0xBF4)     /* (ISC_HIS_ENTRY505) Histogram Entry Offset */
#define ISC_HIS_ENTRY506_REG_OFST      _UINT32_(0xBF8)     /* (ISC_HIS_ENTRY506) Histogram Entry Offset */
#define ISC_HIS_ENTRY507_REG_OFST      _UINT32_(0xBFC)     /* (ISC_HIS_ENTRY507) Histogram Entry Offset */
#define ISC_HIS_ENTRY508_REG_OFST      _UINT32_(0xC00)     /* (ISC_HIS_ENTRY508) Histogram Entry Offset */
#define ISC_HIS_ENTRY509_REG_OFST      _UINT32_(0xC04)     /* (ISC_HIS_ENTRY509) Histogram Entry Offset */
#define ISC_HIS_ENTRY510_REG_OFST      _UINT32_(0xC08)     /* (ISC_HIS_ENTRY510) Histogram Entry Offset */
#define ISC_HIS_ENTRY511_REG_OFST      _UINT32_(0xC0C)     /* (ISC_HIS_ENTRY511) Histogram Entry Offset */
#define ISC_INTDIS_REG_OFST            _UINT32_(0x2C)      /* (ISC_INTDIS) Interrupt Disable Register Offset */
#define ISC_INTEN_REG_OFST             _UINT32_(0x28)      /* (ISC_INTEN) Interrupt Enable Register Offset */
#define ISC_INTMASK_REG_OFST           _UINT32_(0x30)      /* (ISC_INTMASK) Interrupt Mask Register Offset */
#define ISC_INTSR_REG_OFST             _UINT32_(0x34)      /* (ISC_INTSR) Interrupt Status Register Offset */
#define ISC_PFE_CFG0_REG_OFST          _UINT32_(0x0C)      /* (ISC_PFE_CFG0) Parallel Front End Configuration 0 Register Offset */
#define ISC_PFE_CFG1_REG_OFST          _UINT32_(0x10)      /* (ISC_PFE_CFG1) Parallel Front End Configuration 1 Register Offset */
#define ISC_PFE_CFG2_REG_OFST          _UINT32_(0x14)      /* (ISC_PFE_CFG2) Parallel Front End Configuration 2 Register Offset */
#define ISC_RLP_CFG_REG_OFST           _UINT32_(0x3D0)     /* (ISC_RLP_CFG) Rounding, Limiting and Packing Configuration Register Offset */
#define ISC_SUB420_CTRL_REG_OFST       _UINT32_(0x3CC)     /* (ISC_SUB420_CTRL) Subsampling 4:2:2 to 4:2:0 Control Register Offset */
#define ISC_SUB422_CFG_REG_OFST        _UINT32_(0x3C8)     /* (ISC_SUB422_CFG) Subsampling 4:4:4 to 4:2:2 Configuration Register Offset */
#define ISC_SUB422_CTRL_REG_OFST       _UINT32_(0x3C4)     /* (ISC_SUB422_CTRL) Subsampling 4:4:4 to 4:2:2 Control Register Offset */
#define ISC_WB_CFG_REG_OFST            _UINT32_(0x5C)      /* (ISC_WB_CFG) White Balance Configuration Register Offset */
#define ISC_WB_CTRL_REG_OFST           _UINT32_(0x58)      /* (ISC_WB_CTRL) White Balance Control Register Offset */
#define ISC_WB_G_BGB_REG_OFST          _UINT32_(0x6C)      /* (ISC_WB_G_BGB) White Balance Gain for B, GB Register Offset */
#define ISC_WB_G_RGR_REG_OFST          _UINT32_(0x68)      /* (ISC_WB_G_RGR) White Balance Gain for R, GR Register Offset */
#define ISC_WB_O_BGB_REG_OFST          _UINT32_(0x64)      /* (ISC_WB_O_BGB) White Balance Offset for B, GB Register Offset */
#define ISC_WB_O_RGR_REG_OFST          _UINT32_(0x60)      /* (ISC_WB_O_RGR) White Balance Offset for R, GR Register Offset */

